[{"id": 4759, "text": "PARAMETER_1 - an array of PRIMITIVE_0, with each element indicating the update count, FIELD_0 or FIELD_1 for each SQL command in the batch for JDBC drivers that continue processing after a command failure; an update count or FIELD_0 for each SQL command in the batch prior to the failure for JDBC drivers that stop processing after a command failure", "labels": ["Other"]}, {"id": 4760, "text": "PARAMETER_1 - an array of the names of the columns in the inserted row that should be made available for retrieval by a call to the method METHOD_4", "labels": ["Temporal"]}, {"id": 4761, "text": "PARAMETER_4 - a boolean, true if a series of changes are in progress", "labels": ["Other"]}, {"id": 4762, "text": "PARAMETER_0 - the CLASS_0 to act as owner or null if this window has no owner", "labels": ["Other"]}, {"id": 4763, "text": "PARAMETER_1 - The index, relative to the current position, of the character following the last character in the subsequence; must be no smaller than PARAMETER_0 and no larger than METHOD_2", "labels": ["Guard"]}, {"id": 4764, "text": "PARAMETER_0 - A non-null enumeration containing the components for the new composite name. Each element is of class String. The enumeration will be consumed to extract its elements.", "labels": ["Other"]}, {"id": 4765, "text": "PARAMETER_2 - the name of the file containing the execution point represented by the stack trace element, or null if this information is unavailable", "labels": ["Other"]}, {"id": 4766, "text": "PARAMETER_0 - true if explicit policy is to be required, false otherwise", "labels": ["Other"]}, {"id": 4767, "text": "PARAMETER_0 - the set of child requirements. If of zero length, the returns result will be a default instance of SizeRequirements.", "labels": ["Other"]}, {"id": 4768, "text": "PARAMETER_3 - a catalog name; must match the catalog name as it is stored in the database; \"\" retrieves those without a catalog; null means drop catalog name from the selection criteria", "labels": ["Guard"]}, {"id": 4769, "text": "PARAMETER_0 - The possibly null detail string explaining more about the problem with resolving a link. If null, it means no detail will be recorded.", "labels": ["Other"]}, {"id": 4770, "text": "PARAMETER_0 - the method handle to invoke before filtering the return value", "labels": ["Other"]}, {"id": 4771, "text": "PARAMETER_1 - a string identifying the other file or null if there isn't another file or if not known", "labels": ["Other"]}, {"id": 4772, "text": "PARAMETER_0 - The 0-based index of the component at which to stop. Must be in the range [0,size()].", "labels": ["Guard"]}, {"id": 4773, "text": "PARAMETER_0 - the period to subtract, not null", "labels": ["Other"]}, {"id": 4774, "text": "PARAMETER_0 - the class that the hook should run for, not null", "labels": ["Other"]}, {"id": 4775, "text": "PARAMETER_2 - the horizontal offset of the first subsample within the region, or within the image if no region is set.", "labels": ["Other"]}, {"id": 4776, "text": "PARAMETER_2 - information related to the error, if available", "labels": ["Other"]}, {"id": 4777, "text": "PARAMETER_3 - The possibly null environment to be used in the creation of the object factory and the object.", "labels": ["Other"]}, {"id": 4778, "text": "PARAMETER_1 - the factory to use when creating new threads", "labels": ["Other"]}, {"id": 4779, "text": "PARAMETER_2 - a list of CLASS_3s that have already been applied. The list is defensively copied to protect against subsequent modification. The list must contain at least one entry.", "labels": ["Guard"]}, {"id": 4780, "text": "PARAMETER_0 - The possibly null compound name to check.", "labels": ["Other"]}, {"id": 4781, "text": "PARAMETER_3 - the underlying reason for this CLASS_1 (which is saved for later retrieval by the METHOD_0 method); may be null indicating the cause is non-existent or unknown.", "labels": ["Other"]}, {"id": 4782, "text": "PARAMETER_0 - One of the constants defined by the CLASS_2 class; if this parameter is null then this component will inherit the cursor of its parent", "labels": ["Other"]}, {"id": 4783, "text": "PARAMETER_0 - the node to determinate whether it is a child", "labels": ["Other"]}, {"id": 4784, "text": "PARAMETER_0 - desired encoding of the stream after processing", "labels": ["Other"]}, {"id": 4785, "text": "PARAMETER_1 - array of strings, each element of which has environment variable settings in the format name=value, or null if the subprocess should inherit the environment of the current process.", "labels": ["Other"]}, {"id": 4786, "text": "PARAMETER_1 - the index after the last array element that can be used in the PRIMITIVE_0 array", "labels": ["Other"]}, {"id": 4787, "text": "PARAMETER_0 - the namespace context to use for this writer, may not be null", "labels": ["Other"]}, {"id": 4788, "text": "PARAMETER_0 - the algorithm parameters (may be null if not required or optional)", "labels": ["Other"]}, {"id": 4789, "text": "PARAMETER_0 - The error information encapsulated in a transformer exception.", "labels": ["Other"]}, {"id": 4790, "text": "PARAMETER_1 - The non-null string name of the object.", "labels": ["Guard"]}, {"id": 4791, "text": "PARAMETER_2 - a CLASS_0 associated with log message; can be null.", "labels": ["Other"]}, {"id": 4792, "text": "PARAMETER_1 - the underlying reason for this CLASS_2 (which is saved for later retrieval by the METHOD_1 method); may be null indicating the cause is non-existent or unknown.", "labels": ["Other"]}, {"id": 4793, "text": "PARAMETER_1 - the partially complete temporal to query for zone and chronology; querying for other things is undefined and not recommended, not null", "labels": ["Guard"]}, {"id": 4794, "text": "PARAMETER_1 - a set of attributes to control the new connector server's behavior. This parameter can be null. Keys in this map must be Strings. The appropriate type of each associated value depends on the attribute. The contents of PARAMETER_1 are not changed by this call.", "labels": ["Other"]}, {"id": 4795, "text": "PARAMETER_0 - the new solo state for the track. true implies the track should be solo'd, false implies the track should not be solo'd.", "labels": ["Other"]}, {"id": 4796, "text": "PARAMETER_0 - the maximum number of tasks to process. If less than or equal to zero, then no tasks are processed.", "labels": ["Other"]}, {"id": 4797, "text": "PARAMETER_0 - true if columns may be selected; otherwise false", "labels": ["Other"]}, {"id": 4798, "text": "PARAMETER_0 - the CLASS_0 used to compare list elements. A null value indicates that the elements' natural ordering should be used", "labels": ["Other"]}, {"id": 4799, "text": "PARAMETER_0 - the CLASS_0 for the CLASS_4, or null", "labels": ["Other"]}, {"id": 4800, "text": "PARAMETER_1 - The CLASS_1 object that receives (possibly augmented) XML. This parameter can be null if the caller is not interested in it. Note that when a CLASS_9 is used, a validator might just pass the same DOM node from CLASS_4 to CLASS_9 (in which case METHOD_1), it might copy the entire DOM tree, or it might alter the node given by the source.", "labels": ["Other"]}, {"id": 4801, "text": "PARAMETER_1 - an CLASS_1 used to control the reading process, or null.", "labels": ["Other"]}, {"id": 4802, "text": "PARAMETER_1 - The unit size in bytes, must be a power of 2", "labels": ["Guard"]}, {"id": 4803, "text": "PARAMETER_0 - The warning information encapsulated in a transformer exception.", "labels": ["Other"]}, {"id": 4804, "text": "PARAMETER_0 - a string label for this check box, or null for no label.", "labels": ["Other"]}, {"id": 4805, "text": "PARAMETER_1 - The query expression to be applied for selecting MBeans. If null no query expression will be applied for selecting MBeans.", "labels": ["Other"]}, {"id": 4806, "text": "PARAMETER_0 - the non-null mime type for the content editing support", "labels": ["Guard"]}, {"id": 4807, "text": "PARAMETER_0 - the possibly-null value to describe", "labels": ["Other"]}, {"id": 4808, "text": "PARAMETER_1 - the unit to measure the amount in, not null", "labels": ["Guard"]}, {"id": 4809, "text": "PARAMETER_1 - the destination for the filtering operation or null", "labels": ["Other"]}, {"id": 4810, "text": "PARAMETER_0 - the object to be sealed; can be null.", "labels": ["Other"]}, {"id": 4811, "text": "PARAMETER_0 - the maximum CRL number accepted (or null)", "labels": ["Other"]}, {"id": 4812, "text": "PARAMETER_1 - should be null.", "labels": ["Guard"]}, {"id": 4813, "text": "PARAMETER_1 - If true, caught exceptions will be reported.", "labels": ["Other"]}, {"id": 4814, "text": "PARAMETER_0 - the CLASS_0 that specifies how to load the keystore, which may be null", "labels": ["Other"]}, {"id": 4815, "text": "PARAMETER_0 - the adjuster to use, not null", "labels": ["Guard"]}, {"id": 4816, "text": "PARAMETER_0 - The name of a supported character encoding. May be null, to indicate the default platform encoding.", "labels": ["Other"]}, {"id": 4817, "text": "PARAMETER_1 - name value map of the settings to set, not null", "labels": ["Guard"]}, {"id": 4818, "text": "PARAMETER_0 - The public identifier, or null if none is available.", "labels": ["Other"]}, {"id": 4819, "text": "PARAMETER_0 - the format style to use, not null", "labels": ["Guard"]}, {"id": 4820, "text": "PARAMETER_0 - true if unknown tags should be saved in the model, otherwise tags are dropped", "labels": ["Other"]}, {"id": 4821, "text": "PARAMETER_0 - Environment used in creating an initial context implementation. Can be null.", "labels": ["Other"]}, {"id": 4822, "text": "PARAMETER_1 - the position to parse from, updated with length parsed and the index of any error, not null", "labels": ["Guard"]}, {"id": 4823, "text": "PARAMETER_1 - value to set, can be null", "labels": ["Other"]}, {"id": 4824, "text": "PARAMETER_1 - The PARAMETER_1 parameter takes an interface implemented by the user which contains the methods to be called when the event occurs.", "labels": ["Other"]}, {"id": 4825, "text": "PARAMETER_1 - an array of the names of the columns that should be returned from the inserted row", "labels": ["Other"]}, {"id": 4826, "text": "PARAMETER_0 - the localdate, not null", "labels": ["Guard"]}, {"id": 4827, "text": "PARAMETER_3 - The system identifier, a URI reference [IETF RFC 2396], of the external resource being referenced, or null if no system identifier was supplied.", "labels": ["Other"]}, {"id": 4828, "text": "PARAMETER_0 - the message to use for this exception, may be null", "labels": ["Other"]}, {"id": 4829, "text": "PARAMETER_1 - The CLASS_0 from which the source document is to be read. The source document must be an XML fragment, i.e. anything except a complete XML document (except in the case where the context node of type FIELD_0, and the action is FIELD_1), a DOCTYPE (internal subset), entity declaration(s), notation declaration(s), or XML or text declaration(s).", "labels": ["Guard"]}, {"id": 4830, "text": "PARAMETER_0 - the Proxy through which this connection will be made. If direct connection is desired, Proxy.NO_PROXY should be specified.", "labels": ["Other"]}, {"id": 4831, "text": "PARAMETER_0 - whether a gap between the container and components that touch the border of the container should automatically be created", "labels": ["Other"]}, {"id": 4832, "text": "PARAMETER_2 - the CLASS_2 used to protect the CLASS_1, which may be null", "labels": ["Other"]}, {"id": 4833, "text": "PARAMETER_2 - The name of the method to implement. This name is arbitrary, and has no meaning for this linkage method. When used with METHOD_0, this is provided by the CLASS_2 of the CLASS_3 structure and is stacked automatically by the VM.", "labels": ["Other"]}, {"id": 4834, "text": "PARAMETER_1 - the first character that can not be included in the next layout, even if the text after the limit would fit within the wrapping width; PARAMETER_1 must be greater than the current position", "labels": ["Guard"]}, {"id": 4835, "text": "PARAMETER_0 - The possibly null environment properties used when creating the context.", "labels": ["Other"]}, {"id": 4836, "text": "PARAMETER_0 - A stream metadata object, or null.", "labels": ["Other"]}, {"id": 4837, "text": "PARAMETER_0 - The name to set remaining name to. Cannot be null.", "labels": ["Guard"]}, {"id": 4838, "text": "PARAMETER_0 - the text of the paragraph after performing the deletion. Cannot be null.", "labels": ["Guard"]}, {"id": 4839, "text": "PARAMETER_1 - the initial CLASS_4 for this drag operation or null for the default cursor handling; see class level documentation for more details on the cursor handling mechanism during drag and drop", "labels": ["Other"]}, {"id": 4840, "text": "PARAMETER_1 - the end of the desired zone. This should be > getStartOffset() and <= getEndOffset(). This value should also be > p0.", "labels": ["Guard"]}, {"id": 4841, "text": "PARAMETER_1 - the location of the error", "labels": ["Other"]}, {"id": 4842, "text": "PARAMETER_0 - meta-message type (must be less than 128)", "labels": ["Guard"]}, {"id": 4843, "text": "PARAMETER_0 - the CLASS_0 that the specified PARAMETER_1 will run as. This parameter may be null.", "labels": ["Other"]}, {"id": 4844, "text": "PARAMETER_4 - an ObjectInputFilter applied when deserializing invocation arguments; may be null", "labels": ["Other"]}, {"id": 4845, "text": "PARAMETER_3 - The other Component involved in the focus change, or null", "labels": ["Other"]}, {"id": 4846, "text": "PARAMETER_0 - The time period in milliseconds, or 0 to indicate that no timeout should occur", "labels": ["Other"]}, {"id": 4847, "text": "PARAMETER_0 - A non-null enumeration of the components to add. Each element of the enumeration is of class String. The enumeration will be consumed to extract its elements.", "labels": ["Guard"]}, {"id": 4848, "text": "PARAMETER_3 - a method descriptor string the lookup type, if the request is for a method invocation, or describing the invocation type, if the request is for a field or constructor", "labels": ["Other"]}, {"id": 4849, "text": "PARAMETER_0 - timestamp of current event, or the current, system time if the current event has no timestamp, or the AWT cannot determine which event is currently being handled", "labels": ["Other"]}, {"id": 4850, "text": "PARAMETER_3 - an array of CLASS_1s indicating additional formats supported by this object, or null if there are none.", "labels": ["Other"]}, {"id": 4851, "text": "PARAMETER_0 - the desired encoding after conversion", "labels": ["Other"]}, {"id": 4852, "text": "PARAMETER_0 - an ordered array of application protocols, with METHOD_0 being the most preferred. If the array is empty (zero-length), protocol indications will not be used.", "labels": ["Other"]}, {"id": 4853, "text": "PARAMETER_2 - a table name; must match the table name as it is stored in the database", "labels": ["Other"]}, {"id": 4854, "text": "PARAMETER_0 - a CLASS_1 object that represents a particular geographical, political, or cultural region. Specifying null is equivalent to specifying METHOD_0.", "labels": ["Other"]}, {"id": 4855, "text": "PARAMETER_1 - if true, extend the current selection", "labels": ["Other"]}, {"id": 4856, "text": "PARAMETER_1 - The namespace of the resource being resolved, e.g. the target namespace of the XML Schema [XML Schema Part 1] when resolving XML Schema resources.", "labels": ["Other"]}, {"id": 4857, "text": "PARAMETER_1 - the sources of peer authentication trust decisions or null", "labels": ["Other"]}, {"id": 4858, "text": "PARAMETER_0 - The non-null class name of the object to which this reference refers.", "labels": ["Guard"]}, {"id": 4859, "text": "PARAMETER_1 - the unit that the amount is measured in, must have an exact duration, not null", "labels": ["Guard"]}, {"id": 4860, "text": "PARAMETER_0 - the first list, may be empty but not null", "labels": ["Guard"]}, {"id": 4861, "text": "PARAMETER_4 - true if Popup should be heavy weight, otherwise popup type will be selected by popup factory.", "labels": ["Other"]}, {"id": 4862, "text": "PARAMETER_1 - The object name of the MBean. May be null.", "labels": ["Other"]}, {"id": 4863, "text": "PARAMETER_2 - method handle to call if a matching exception is thrown", "labels": ["Other"]}, {"id": 4864, "text": "PARAMETER_0 - an CLASS_1, or null to use a default CLASS_1.", "labels": ["Other"]}, {"id": 4865, "text": "PARAMETER_0 - String array of field names. The array and array elements cannot be null.", "labels": ["Guard"]}, {"id": 4866, "text": "PARAMETER_0 - true if the progress bar should render a string", "labels": ["Other"]}, {"id": 4867, "text": "PARAMETER_0 - true if the parse method returns BigDecimal; false otherwise", "labels": ["Other"]}, {"id": 4868, "text": "PARAMETER_0 - The stratum to retrieve information from or null for the METHOD_1.", "labels": ["Other"]}, {"id": 4869, "text": "PARAMETER_2 - number of bytes within PARAMETER_0 allotted for the signature. Both this default implementation and the SUN provider do not return partial digests. If the value of this parameter is less than the actual signature length, this method will throw a SignatureException. This parameter is ignored if its value is greater than or equal to the actual signature length.", "labels": ["Exception"]}, {"id": 4870, "text": "PARAMETER_0 - true if table view should draw grid lines", "labels": ["Other"]}, {"id": 4871, "text": "PARAMETER_10 - Amount to offset the text when painting", "labels": ["Other"]}, {"id": 4872, "text": "PARAMETER_2 - the array containing the pixel to be returned or null", "labels": ["Other"]}, {"id": 4873, "text": "PARAMETER_0 - the query to invoke, not null", "labels": ["Guard"]}, {"id": 4874, "text": "PARAMETER_0 - if true and border property is not null, the border is painted.", "labels": ["Other"]}, {"id": 4875, "text": "PARAMETER_4 - The parent (if any) of this raster", "labels": ["Other"]}, {"id": 4876, "text": "PARAMETER_0 - whether or not tick marks should be painted", "labels": ["Other"]}, {"id": 4877, "text": "PARAMETER_0 - the operator to apply after this operator is applied", "labels": ["Other"]}, {"id": 4878, "text": "PARAMETER_3 - the reference type, as a URI (may be null)", "labels": ["Other"]}, {"id": 4879, "text": "PARAMETER_0 - the exception to throw. If this exception is not a CLASS_0 or CLASS_1, the actual exception thrown will be a CLASS_0 with cause PARAMETER_0.", "labels": ["Other"]}, {"id": 4880, "text": "PARAMETER_1 - Object array of the corresponding field values. Elements of the array can be null. The METHOD_0 must be valid for the METHOD_1 (as defined in method METHOD_2) Note: array sizes of parameters should match. If both arrays are empty, then an empty descriptor is created.", "labels": ["Other"]}, {"id": 4881, "text": "PARAMETER_0 - Termination status. By convention, a nonzero status code indicates abnormal termination. If the METHOD_0 (equivalently, CLASS_0) method has already been invoked then this status code will override the status code passed to that method.", "labels": ["Other"]}, {"id": 4882, "text": "PARAMETER_0 - The name of the level to set on the specified logger, or null if setting the level to inherit from its nearest ancestor.", "labels": ["Other"]}, {"id": 4883, "text": "PARAMETER_0 - the component from which this UI delegate is being removed; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components", "labels": ["Other"]}, {"id": 4884, "text": "PARAMETER_0 - the component that will display the string, may be null", "labels": ["Other"]}, {"id": 4885, "text": "PARAMETER_0 - the predicate to apply to a value, if present", "labels": ["Other"]}, {"id": 4886, "text": "PARAMETER_0 - the minimum number of fraction digits to be shown; if less than zero, then zero is used. The concrete subclass may enforce an upper limit to this value appropriate to the numeric type being formatted.", "labels": ["Other"]}, {"id": 4887, "text": "PARAMETER_1 - severity of the printer state reason. This must be an instance of class CLASS_3", "labels": ["Other"]}, {"id": 4888, "text": "PARAMETER_1 - if true then the returned stream is a parallel stream; if false the returned stream is a sequential stream.", "labels": ["Other"]}, {"id": 4889, "text": "PARAMETER_2 - time in seconds before which the validation process is expected to be completed, otherwise the validation process is aborted. A value of 0 indicates the validation process will not time out.", "labels": ["Other"]}, {"id": 4890, "text": "PARAMETER_1 - true to indicate that the column name is case sensitive; false otherwise", "labels": ["Other"]}, {"id": 4891, "text": "PARAMETER_3 - The value of the charset attribute to match. May be null.", "labels": ["Other"]}, {"id": 4892, "text": "PARAMETER_0 - A CLASS_4 used to select which CLASS_1s should be returned. Specify null to return all CLASS_1s (if supported).", "labels": ["Other"]}, {"id": 4893, "text": "PARAMETER_1 - name/value map of the settings to set, not null", "labels": ["Guard"]}, {"id": 4894, "text": "PARAMETER_0 - The name of this object relative to PARAMETER_1, or null if no name is specified.", "labels": ["Other"]}, {"id": 4895, "text": "PARAMETER_0 - the query defining the type to parse to, not null", "labels": ["Guard"]}, {"id": 4896, "text": "PARAMETER_0 - A CLASS_3 used to select which FIELD_0s should be returned. Specify null to return all FIELD_0s (if supported).", "labels": ["Other"]}, {"id": 4897, "text": "PARAMETER_0 - The row number where to insert a new row. This index starts from 0 and is relative only to the rows contained inside this section, not all the rows in the table.", "labels": ["Other"]}, {"id": 4898, "text": "PARAMETER_1 - the CLASS_0 to store; refer to CLASS_1 for details on how null is handled", "labels": ["Other"]}, {"id": 4899, "text": "PARAMETER_2 - the child views to add. This value can be null to indicate no children are being added (useful to remove).", "labels": ["Other"]}, {"id": 4900, "text": "PARAMETER_2 - The parent class loader for the class loader created by this method; may be null for the bootstrap class loader", "labels": ["Other"]}, {"id": 4901, "text": "PARAMETER_0 - the FormatStyle for the date, null for time-only pattern", "labels": ["Other"]}, {"id": 4902, "text": "PARAMETER_0 - true if the high endpoint is to be included in the returned view", "labels": ["Other"]}, {"id": 4903, "text": "PARAMETER_2 - the Unicode Extension key for this PARAMETER_1, not null.", "labels": ["Guard"]}, {"id": 4904, "text": "PARAMETER_2 - If true, this color model supports alpha.", "labels": ["Other"]}, {"id": 4905, "text": "PARAMETER_2 - the 2nd error message argument", "labels": ["Other"]}, {"id": 4906, "text": "PARAMETER_3 - an attribute name pattern; must match the attribute name as it is declared in the database", "labels": ["Other"]}, {"id": 4907, "text": "PARAMETER_1 - contains information about a graphics device which is needed to measure the text correctly. Text measurements can vary slightly depending on the device resolution, and attributes such as antialiasing. This parameter does not specify a translation between the CLASS_0 and user space.", "labels": ["Other"]}, {"id": 4908, "text": "PARAMETER_2 - the modifier keys down during event (shift, ctrl, alt, meta) Either extended _DOWN_MASK or old _MASK modifiers should be used, but both models should not be mixed in one event. Use of the extended modifiers is preferred.", "labels": ["Other"]}, {"id": 4909, "text": "PARAMETER_0 - the text to parse such as \"10:15:30\", not null", "labels": ["Guard"]}, {"id": 4910, "text": "PARAMETER_0 - the WebSocket on which the error has occurred", "labels": ["Other"]}, {"id": 4911, "text": "PARAMETER_0 - the first column is 1, the second is 2, and so on; must be between 1 and the number of columns in the rowset, inclusive", "labels": ["Guard"]}, {"id": 4912, "text": "PARAMETER_2 - cannot be a null or empty string.", "labels": ["Guard"]}, {"id": 4913, "text": "PARAMETER_0 - true indicates that sessions may be created; this is the default. false indicates that an existing session must be resumed.", "labels": ["Other"]}, {"id": 4914, "text": "PARAMETER_3 - the URLStreamHandlerFactory to use when creating URLs", "labels": ["Other"]}, {"id": 4915, "text": "PARAMETER_1 - the time-zone, not null", "labels": ["Guard"]}, {"id": 4916, "text": "PARAMETER_1 - The Management Interface exported by this MBean's implementation. If null, then this object will use standard JMX design pattern to determine the management interface associated with the given implementation.", "labels": ["Other"]}, {"id": 4917, "text": "PARAMETER_3 - the rendering style attributes for the text range, or null", "labels": ["Other"]}, {"id": 4918, "text": "PARAMETER_0 - an optional handle to return the iterator to start the loop. If non-null, the handle must return CLASS_4 or a subtype. See above for other constraints.", "labels": ["Other"]}, {"id": 4919, "text": "PARAMETER_2 - the number of bytes in the stream; lengths of 0 or less are are undefined but will cause an invalid length exception to be thrown in the underlying JDBC driver.", "labels": ["Exception"]}, {"id": 4920, "text": "PARAMETER_1 - a mapping function to produce values, must be non-null", "labels": ["Guard"]}, {"id": 4921, "text": "PARAMETER_0 - An appropriate CLASS_0, or null.", "labels": ["Other"]}, {"id": 4922, "text": "PARAMETER_0 - the authenticator to set. If null then any previously set authenticator is removed, and client authentication will no longer be required.", "labels": ["Other"]}, {"id": 4923, "text": "PARAMETER_3 - true if end should be omitted", "labels": ["Other"]}, {"id": 4924, "text": "PARAMETER_1 - The class loader to be used to load provider-configuration files and provider classes, or null if the system class loader (or, failing that, the bootstrap class loader) is to be used", "labels": ["Other"]}, {"id": 4925, "text": "PARAMETER_3 - The possibly null object containing location or reference information that can be used in creating an object.", "labels": ["Other"]}, {"id": 4926, "text": "PARAMETER_0 - a function to be applied after the subscriber has completed", "labels": ["Other"]}, {"id": 4927, "text": "PARAMETER_0 - The Graphics2D object to configure. Will not be null.", "labels": ["Guard"]}, {"id": 4928, "text": "PARAMETER_0 - handler METHOD_1 permission, or the calling thread is not allowed to create a subprocess", "labels": ["Other"]}, {"id": 4929, "text": "PARAMETER_0 - the release argument. This value is always the one passed to a release method, or the current state value upon entry to a condition wait. The value is otherwise uninterpreted and can represent anything you like.", "labels": ["Other"]}, {"id": 4930, "text": "PARAMETER_2 - the localName of the event, may be null", "labels": ["Other"]}, {"id": 4931, "text": "PARAMETER_0 - The non-null challenge sent from the server. The challenge array may have zero length.", "labels": ["Guard"]}, {"id": 4932, "text": "PARAMETER_1 - a filter that can be used to inspect each header-name-and-value pair in the given map to determine if it should, or should not, be added to the to the HTTP headers", "labels": ["Other"]}, {"id": 4933, "text": "PARAMETER_0 - the ordinal number of the placeholder parameter in this CLASS_0 object's command that is to be set. The first parameter is 1, the second is 2, and so on; must be 1 or greater", "labels": ["Guard"]}, {"id": 4934, "text": "PARAMETER_0 - the array used to return the three HSB values, or null", "labels": ["Other"]}, {"id": 4935, "text": "PARAMETER_0 - the offset to combine with, not null", "labels": ["Guard"]}, {"id": 4936, "text": "PARAMETER_0 - the offset within the composed text, if there is composed text; null otherwise", "labels": ["Other"]}, {"id": 4937, "text": "PARAMETER_2 - The handback that was specified when the listener was added.", "labels": ["Other"]}, {"id": 4938, "text": "PARAMETER_0 - the cause of this exception or null", "labels": ["Other"]}, {"id": 4939, "text": "PARAMETER_0 - if true, the tool bar can be moved; false otherwise", "labels": ["Other"]}, {"id": 4940, "text": "PARAMETER_3 - The possibly null environment to be used in the creation of the object's state.", "labels": ["Other"]}, {"id": 4941, "text": "PARAMETER_0 - the thread group. If null and there is a security manager, the group is determined by SecurityManager.getThreadGroup(). If there is not a security manager or SecurityManager.getThreadGroup() returns null, the group is set to the current thread's thread group.", "labels": ["Other"]}, {"id": 4942, "text": "PARAMETER_0 - if non-null, contains the returned kernel data", "labels": ["Other"]}, {"id": 4943, "text": "PARAMETER_2 - if true, the proxy is for an CLASS_3, and appropriate mappings will be applied to method parameters and return values.", "labels": ["Other"]}, {"id": 4944, "text": "PARAMETER_0 - a mapping function to produce keys, must be non-null", "labels": ["Guard"]}, {"id": 4945, "text": "PARAMETER_0 - the wrapped error.", "labels": ["Other"]}, {"id": 4946, "text": "PARAMETER_0 - listener to remove, not null", "labels": ["Guard"]}, {"id": 4947, "text": "PARAMETER_0 - The object bound to name. Can be null.", "labels": ["Other"]}, {"id": 4948, "text": "PARAMETER_2 - the associated CodeSource, or null if none", "labels": ["Other"]}, {"id": 4949, "text": "PARAMETER_2 - the CLASS_0 to be used for this connection. This parameter can be null, which indicates that implementations of this interface are free to select an alias applicable to any engine.", "labels": ["Other"]}, {"id": 4950, "text": "PARAMETER_0 - true if the check box menu item is on, otherwise false", "labels": ["Other"]}, {"id": 4951, "text": "PARAMETER_1 - the command to execute when the barrier is tripped, or null if there is no action", "labels": ["Other"]}, {"id": 4952, "text": "PARAMETER_0 - true if the view is underlined, otherwise false", "labels": ["Other"]}, {"id": 4953, "text": "PARAMETER_2 - an array of objects indicating the possible choices the user can make; if the objects are components, they are rendered properly; non-CLASS_2 objects are rendered using their METHOD_0 methods; if this parameter is null, the options are determined by the Look and Feel", "labels": ["Other"]}, {"id": 4954, "text": "PARAMETER_0 - The CLASS_0 whose contents should be merged into this one", "labels": ["Other"]}, {"id": 4955, "text": "PARAMETER_0 - the object whose METHOD_5 method is invoked when this thread is started. If null, this thread's run method is invoked.", "labels": ["Other"]}, {"id": 4956, "text": "PARAMETER_4 - Resource bundle to localize PARAMETER_1, can be null.", "labels": ["Other"]}, {"id": 4957, "text": "PARAMETER_1 - the exception handler for the parser, or null to use the default exception handler", "labels": ["Other"]}, {"id": 4958, "text": "PARAMETER_0 - The number of floats to be read from the given array; must be non-negative and no larger than METHOD_3", "labels": ["Guard"]}, {"id": 4959, "text": "PARAMETER_0 - true if, and only if, the invoker can provide no additional input bytes beyond those in the given buffer", "labels": ["Other"]}, {"id": 4960, "text": "PARAMETER_0 - the locale, not null", "labels": ["Guard"]}, {"id": 4961, "text": "PARAMETER_1 - the human-readable string used to identify this flavor; if this parameter is null then the value of the MIME Content Type is used", "labels": ["Other"]}, {"id": 4962, "text": "PARAMETER_3 - If a specific PARAMETER_3 is specified, then the result will be returned as the corresponding type.For XPath 1.0 results, this must be one of the codes of the CLASS_9 interface.", "labels": ["Other"]}, {"id": 4963, "text": "PARAMETER_0 - a distinguished name as X500Principal (or null)", "labels": ["Other"]}, {"id": 4964, "text": "PARAMETER_0 - the field to query the range for, not null", "labels": ["Guard"]}, {"id": 4965, "text": "PARAMETER_3 - for METHOD_1 or METHOD_2, this is the number of digits after the decimal point. For Java Object types CLASS_0 and CLASS_1, this is the length of the data in the stream or reader. For all other types, this value will be ignored.", "labels": ["Other"]}, {"id": 4966, "text": "PARAMETER_0 - the temporal object to check, not null", "labels": ["Guard"]}, {"id": 4967, "text": "PARAMETER_1 - the type of the notification. This is usually one of the constants FIELD_0, FIELD_1, FIELD_2, FIELD_3. It is not an error for it to be a different string.", "labels": ["Other"]}, {"id": 4968, "text": "PARAMETER_3 - an instance of CLASS_0 that is used by the application to set the desired QOP. Set the desired QOP to 0 in PARAMETER_3 to request the default QOP. Alternatively pass in null for PARAMETER_3 to request the default QOP.", "labels": ["Other"]}, {"id": 4969, "text": "PARAMETER_0 - The new replacement; must not be null, must have non-zero length, must not be longer than the value returned by the METHOD_1 method, and must be METHOD_2", "labels": ["Guard"]}, {"id": 4970, "text": "PARAMETER_0 - a CLASS_0 specifying the constraints on the target certificate (or null)", "labels": ["Other"]}, {"id": 4971, "text": "PARAMETER_2 - the remapping function to recompute a value if present", "labels": ["Other"]}, {"id": 4972, "text": "PARAMETER_4 - If non-null, returns the samples in this array.", "labels": ["Other"]}, {"id": 4973, "text": "PARAMETER_1 - the destination point or null", "labels": ["Other"]}, {"id": 4974, "text": "PARAMETER_2 - the namespace being searched for. Must not be null.", "labels": ["Guard"]}, {"id": 4975, "text": "PARAMETER_1 - the offset into the document to insert the content >= 0. All positions that track change at or after the given location will move.", "labels": ["Other"]}, {"id": 4976, "text": "PARAMETER_2 - the PARAMETER_2 for the emitted CLASS_0. Can be null. See METHOD_2.", "labels": ["Other"]}, {"id": 4977, "text": "PARAMETER_0 - Limit on the number of characters that may be read while still preserving the mark. After reading this many characters, attempting to reset the stream may fail.", "labels": ["Temporal"]}, {"id": 4978, "text": "PARAMETER_2 - This parameter is ignored as the method never blocks", "labels": ["Other"]}, {"id": 4979, "text": "PARAMETER_0 - the name of the font, or null", "labels": ["Other"]}, {"id": 4980, "text": "PARAMETER_1 - the duration of each visible tick, not negative, not null", "labels": ["Guard"]}, {"id": 4981, "text": "PARAMETER_0 - the CLASS_0 from which file format information should be extracted", "labels": ["Other"]}, {"id": 4982, "text": "PARAMETER_0 - the size to which to set the send buffer size. This value must be greater than 0.", "labels": ["Guard"]}, {"id": 4983, "text": "PARAMETER_0 - true if authorization is allowed; false otherwise", "labels": ["Other"]}, {"id": 4984, "text": "PARAMETER_0 - the element the content is inserted after", "labels": ["Other"]}, {"id": 4985, "text": "PARAMETER_2 - the starting offset into PARAMETER_1 of where the data should be placed.", "labels": ["Other"]}, {"id": 4986, "text": "PARAMETER_2 - a boolean value indicating the initial selection state. If true the check box is selected", "labels": ["Other"]}, {"id": 4987, "text": "PARAMETER_0 - The error information encapsulated in a CLASS_0.", "labels": ["Other"]}, {"id": 4988, "text": "PARAMETER_2 - an array of PRIMITIVE_0 that specifies the index values of the removed items. The indices must be in sorted order, from lowest to highest", "labels": ["Guard"]}, {"id": 4989, "text": "PARAMETER_0 - String used when formatting if the value does not completely fill the mask", "labels": ["Other"]}, {"id": 4990, "text": "PARAMETER_1 - the NetworkInterface through which the test will be done, or null for any interface", "labels": ["Other"]}, {"id": 4991, "text": "PARAMETER_0 - The local address to bind the socket, or null to bind the socket to an automatically assigned socket address", "labels": ["Other"]}, {"id": 4992, "text": "PARAMETER_0 - the pattern string to parse; not null", "labels": ["Guard"]}, {"id": 4993, "text": "PARAMETER_0 - an OID map, where each key is an object identifier in String form (a sequence of nonnegative integers separated by periods) that maps to a corresponding attribute type keyword String. The map may be empty but never null.", "labels": ["Guard"]}, {"id": 4994, "text": "PARAMETER_4 - a boolean value that determines whether the rectangle appears to be raised above the surface or etched into the surface.", "labels": ["Other"]}, {"id": 4995, "text": "PARAMETER_1 - the local name of the attribute, cannot be null", "labels": ["Guard"]}, {"id": 4996, "text": "PARAMETER_0 - The offset within the string of the last char to be read, plus one; must be non-negative and no larger than METHOD_3", "labels": ["Guard"]}, {"id": 4997, "text": "PARAMETER_7 - if true, component PARAMETER_1 will be validated before being painted", "labels": ["Other"]}, {"id": 4998, "text": "PARAMETER_0 - the cause (which is saved for later retrieval by the METHOD_2 method). (A null value is permitted, and indicates that the cause is nonexistent or unknown.)", "labels": ["Other"]}, {"id": 4999, "text": "PARAMETER_2 - the name of the method (which must not be \"<init>\")", "labels": ["Guard"]}, {"id": 5000, "text": "PARAMETER_0 - the new set of resolver fields, null if no fields", "labels": ["Other"]}, {"id": 5001, "text": "PARAMETER_0 - provide Timezone. null is a legal value.", "labels": ["Other"]}, {"id": 5002, "text": "PARAMETER_3 - to be browsable, must be METHOD_0", "labels": ["Other"]}, {"id": 5003, "text": "PARAMETER_1 - Environment to use when creating the factory. Can be null.", "labels": ["Other"]}, {"id": 5004, "text": "PARAMETER_3 - The Graphics2D to render to. This must not be null.", "labels": ["Guard"]}, {"id": 5005, "text": "PARAMETER_0 - a CLASS_0 object marking a savepoint in the current transaction. All changes made before s was set will be undone. All changes made after s was set will be made permanent.", "labels": ["Other"]}, {"id": 5006, "text": "PARAMETER_2 - the component where the x,y location is being queried; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components", "labels": ["Other"]}, {"id": 5007, "text": "PARAMETER_1 - if true, render cell appropriately. For example, put a special border on the cell, if the cell can be edited, render in the color used to indicate editing", "labels": ["Other"]}, {"id": 5008, "text": "PARAMETER_2 - the attributes to be used for the modification; may not be null", "labels": ["Guard"]}, {"id": 5009, "text": "PARAMETER_3 - The descriptions, in the same order as itemNames, of the items contained in the composite data values described by this CLASS_0 instance; should be of the same size as itemNames; no element can be null or an empty string.", "labels": ["Guard"]}, {"id": 5010, "text": "PARAMETER_0 - the text to parse such as \"--12-03\", not null", "labels": ["Guard"]}, {"id": 5011, "text": "PARAMETER_0 - a PRIMITIVE_0 indicating whether a cache file should be used, in cases where it is optional.", "labels": ["Other"]}, {"id": 5012, "text": "PARAMETER_1 - the initial orientation -- it must be either FIELD_0 or FIELD_1", "labels": ["Guard"]}, {"id": 5013, "text": "PARAMETER_1 - An array of PRIMITIVE_0s to be used as the first and only bank of this CLASS_0.", "labels": ["Other"]}, {"id": 5014, "text": "PARAMETER_2 - the object name to which this permission applies. May be null, which represents an object name that is implied by any object name but does not imply any other object name.", "labels": ["Other"]}, {"id": 5015, "text": "PARAMETER_1 - The possibly null ASN.1 BER encoded value of the extended response. This is the raw BER bytes including the tag and length of the response value. It does not include the response OID. Its value is ignored because a Start TLS response is not expected to contain any response value.", "labels": ["Other"]}, {"id": 5016, "text": "PARAMETER_6 - Array of band indices, or null to use all bands", "labels": ["Other"]}, {"id": 5017, "text": "PARAMETER_0 - the non-null text to use as the replacement", "labels": ["Guard"]}, {"id": 5018, "text": "PARAMETER_1 - the keytab CLASS_1 object, must not be null", "labels": ["Guard"]}, {"id": 5019, "text": "PARAMETER_0 - One of the constants defined by the CLASS_1 class. If this parameter is null then the cursor for this window will be set to the type Cursor.DEFAULT_CURSOR.", "labels": ["Other"]}, {"id": 5020, "text": "PARAMETER_1 - true if the width preference has changed", "labels": ["Other"]}, {"id": 5021, "text": "PARAMETER_1 - the logical style to assign to the paragraph, null if none", "labels": ["Other"]}, {"id": 5022, "text": "PARAMETER_0 - The non-null name of the object.", "labels": ["Guard"]}, {"id": 5023, "text": "PARAMETER_0 - the text to parse such as \"2007-12-03T10:15:30\", not null", "labels": ["Guard"]}, {"id": 5024, "text": "PARAMETER_1 - The non-null string name of the protocol for which the authentication is being performed (e.g., \"ldap\").", "labels": ["Guard"]}, {"id": 5025, "text": "PARAMETER_0 - the end date, exclusive, which may be in any chronology, not null", "labels": ["Guard"]}, {"id": 5026, "text": "PARAMETER_1 - the uri to bind to the prefix, may be null", "labels": ["Other"]}, {"id": 5027, "text": "PARAMETER_1 - the filtered output stream to set as this object's outputstream, or null if no change.", "labels": ["Other"]}, {"id": 5028, "text": "PARAMETER_0 - The error code identifying the exception.", "labels": ["Other"]}, {"id": 5029, "text": "PARAMETER_3 - Specifies the node being cloned, adopted, imported, or renamed. This is null when the node is being deleted.", "labels": ["Other"]}, {"id": 5030, "text": "PARAMETER_0 - the column being dragged, or null if no column is being dragged", "labels": ["Other"]}, {"id": 5031, "text": "PARAMETER_2 - true to request a shared lock, in which case this channel must be open for reading (and possibly writing); false to request an exclusive lock, in which case this channel must be open for writing (and possibly reading)", "labels": ["Other"]}, {"id": 5032, "text": "PARAMETER_4 - the size after truncation", "labels": ["Other"]}, {"id": 5033, "text": "PARAMETER_4 - the environment containing attributes for the new CLASS_1. Can be null, equivalent to an empty map.", "labels": ["Other"]}, {"id": 5034, "text": "PARAMETER_0 - The InetAddress of the site requesting authorization, or null if not known.", "labels": ["Other"]}, {"id": 5035, "text": "PARAMETER_1 - the position in this CLASS_0 object at which to begin the search; the first position is 1; must not be less than 1 nor greater than the length of this CLASS_0 object", "labels": ["Guard"]}, {"id": 5036, "text": "PARAMETER_0 - the object to use as the default uncaught exception handler. If null then there is no default handler.", "labels": ["Other"]}, {"id": 5037, "text": "PARAMETER_1 - a mechanism-specific XML structure from which to unmarshal the parameters from (may be null if not required or optional)", "labels": ["Other"]}, {"id": 5038, "text": "PARAMETER_2 - a database vendor-specific exception code", "labels": ["Other"]}, {"id": 5039, "text": "PARAMETER_1 - the local name (without prefix), or the empty string if Namespace processing is not being performed", "labels": ["Other"]}, {"id": 5040, "text": "PARAMETER_9 - a boolean, true if this event is a trigger for a popup-menu", "labels": ["Other"]}, {"id": 5041, "text": "PARAMETER_1 - the CLASS_0 containing additional context (may be null if not applicable)", "labels": ["Other"]}, {"id": 5042, "text": "PARAMETER_2 - Whether the attribute is a of type ID.", "labels": ["Other"]}, {"id": 5043, "text": "PARAMETER_1 - body of the loop, which may not be null. It controls the loop parameters and result type in the standard case (see above for details). It must accept its own return type (if non-void) plus an PRIMITIVE_0 parameter (for the counter), and may accept any number of additional types. See above for other constraints.", "labels": ["Guard"]}, {"id": 5044, "text": "PARAMETER_3 - the locale for which the resource bundle should be instantiated", "labels": ["Other"]}, {"id": 5045, "text": "PARAMETER_12 - Specifies whether or not meta key was depressed during the CLASS_2.", "labels": ["Other"]}, {"id": 5046, "text": "PARAMETER_0 - the output stream, non-null", "labels": ["Guard"]}, {"id": 5047, "text": "PARAMETER_1 - the new mute state for the track. true implies the track should be muted, false implies the track should be unmuted.", "labels": ["Other"]}, {"id": 5048, "text": "PARAMETER_0 - a description of the exception.", "labels": ["Other"]}, {"id": 5049, "text": "PARAMETER_0 - true to auto-size the image, false otherwise", "labels": ["Other"]}, {"id": 5050, "text": "PARAMETER_0 - true if the focus change is temporary, such as when the window loses the focus; for more information on temporary focus changes see the Focus Specification", "labels": ["Other"]}, {"id": 5051, "text": "PARAMETER_5 - an CLASS_5 object representing image metadata, or null.", "labels": ["Other"]}, {"id": 5052, "text": "PARAMETER_0 - true if the image is a multi-frame animation", "labels": ["Other"]}, {"id": 5053, "text": "PARAMETER_2 - a diagnostic listener; if null use the tool's default method for reporting diagnostics", "labels": ["Other"]}, {"id": 5054, "text": "PARAMETER_0 - The possibly null environment that is used in creating the object.", "labels": ["Other"]}, {"id": 5055, "text": "PARAMETER_0 - true if root handles should be displayed; otherwise, false", "labels": ["Other"]}, {"id": 5056, "text": "PARAMETER_1 - the queries defining the types to attempt to parse to, must implement CLASS_2, not null", "labels": ["Guard"]}, {"id": 5057, "text": "PARAMETER_6 - true if the attribute has a getter exposed for management.", "labels": ["Other"]}, {"id": 5058, "text": "PARAMETER_1 - the 1st error message argument", "labels": ["Other"]}, {"id": 5059, "text": "PARAMETER_3 - the field to append, not null", "labels": ["Guard"]}, {"id": 5060, "text": "PARAMETER_0 - the new threshold. Must not be less than zero. The value of zero means that call sites will never be considered unstable.", "labels": ["Guard"]}, {"id": 5061, "text": "PARAMETER_0 - The number of doubles to be read from the given array; must be non-negative and no larger than METHOD_3", "labels": ["Guard"]}, {"id": 5062, "text": "PARAMETER_1 - the CLASS_1 the newly created CLASS_0 object must support.", "labels": ["Other"]}, {"id": 5063, "text": "PARAMETER_1 - Characteristics of this spliterator's source or elements (FIELD_1 and FIELD_2, if supplied, are ignored and are not reported.)", "labels": ["Other"]}, {"id": 5064, "text": "PARAMETER_0 - the list of URLs (separated by spaces) to load the class from, or null", "labels": ["Other"]}, {"id": 5065, "text": "PARAMETER_0 - a boolean value indicating whether integrity should be enabled or not.", "labels": ["Other"]}, {"id": 5066, "text": "PARAMETER_0 - the locale for which text input is supported, or null", "labels": ["Other"]}, {"id": 5067, "text": "PARAMETER_1 - whether or not to verify the jar file if it is signed.", "labels": ["Other"]}, {"id": 5068, "text": "PARAMETER_0 - The cause (which is saved for later retrieval by the METHOD_1 method). (A null value is permitted, and indicates that the cause is nonexistent or unknown.)", "labels": ["Other"]}, {"id": 5069, "text": "PARAMETER_0 - whether or not to paint labels", "labels": ["Other"]}, {"id": 5070, "text": "PARAMETER_0 - an array of CLASS_1s which will be the key set of the returned CLASS_0. If null is specified, a mapping of all supported CLASS_1 natives to their most preferred CLASS_2s will be returned.", "labels": ["Other"]}, {"id": 5071, "text": "PARAMETER_0 - the CLASS_0; null turns sorting off", "labels": ["Other"]}, {"id": 5072, "text": "PARAMETER_0 - a default CLASS_0 to return if property PARAMETER_1 is not defined", "labels": ["Other"]}, {"id": 5073, "text": "PARAMETER_2 - the encryption algorithm parameter specification, which may be null", "labels": ["Other"]}, {"id": 5074, "text": "PARAMETER_0 - value constraints are summarized in year field of date/time field mapping table. If year is FIELD_0, then eon is set to null.", "labels": ["Other"]}, {"id": 5075, "text": "PARAMETER_0 - the object whose METHOD_1 method is invoked when this thread is started. If null, this classes METHOD_1 method does nothing.", "labels": ["Other"]}, {"id": 5076, "text": "PARAMETER_2 - the attributes to return. null indicates that all attributes are to be returned; an empty array indicates that none are to be returned.", "labels": ["Other"]}, {"id": 5077, "text": "PARAMETER_0 - the cause (which is saved for later retrieval by the METHOD_1 method). (A null value is permitted, and indicates that the cause is nonexistent or unknown.)", "labels": ["Other"]}, {"id": 5078, "text": "PARAMETER_0 - this parameter is not used", "labels": ["Other"]}, {"id": 5079, "text": "PARAMETER_1 - the CLASS_2 for which the color is desired; refer to CLASS_3 for details on how a null CLASS_2 is handled", "labels": ["Other"]}, {"id": 5080, "text": "PARAMETER_0 - The prefix to look for. If this parameter is null, the method will return the default namespace URI if any.", "labels": ["Other"]}, {"id": 5081, "text": "PARAMETER_0 - true to specify that the split pane should provide a collapse/expand widget", "labels": ["Other"]}, {"id": 5082, "text": "PARAMETER_9 - a boolean value, true if this event is a trigger for a popup-menu", "labels": ["Other"]}, {"id": 5083, "text": "PARAMETER_1 - null if the iteration of the directory completes without an error; otherwise the I/O exception that caused the iteration of the directory to complete prematurely", "labels": ["Other"]}, {"id": 5084, "text": "PARAMETER_3 - the component to be used as the observer if this icon has no image observer", "labels": ["Other"]}, {"id": 5085, "text": "PARAMETER_2 - The name of this object relative to PARAMETER_1. Specifying a name is optional; if it is omitted, PARAMETER_2 should be null.", "labels": ["Other"]}, {"id": 5086, "text": "PARAMETER_0 - on input is application supplied attributes, on output the contents are updated to reflect user choices. This parameter may not be null.", "labels": ["Guard"]}, {"id": 5087, "text": "PARAMETER_2 - The system identifier of the entity that generated the error or warning.", "labels": ["Other"]}, {"id": 5088, "text": "PARAMETER_0 - a list of CLASS_0 objects to be placed in this array. If METHOD_0 is less that the length of the array, the first METHOD_0 elements are set.", "labels": ["Other"]}, {"id": 5089, "text": "PARAMETER_0 - the array into which the elements of this set are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.", "labels": ["Other"]}, {"id": 5090, "text": "PARAMETER_0 - true if no dialog decorations are to be enabled; false if dialog decorations are to be enabled", "labels": ["Other"]}, {"id": 5091, "text": "PARAMETER_1 - should be null", "labels": ["Guard"]}, {"id": 5092, "text": "PARAMETER_1 - a GSSCredential containing one or more mechanism specific credentials for the same entity. These mechanism specific credentials will be populated in the returned Subject's private credential set. Passing in a value of null will imply that the private credential set should be left empty.", "labels": ["Other"]}, {"id": 5093, "text": "PARAMETER_3 - for an object of METHOD_2 , this is the number of digits after the decimal point. For Java Object types CLASS_1 and CLASS_2, this is the length of the data in the stream or reader. For all other types, this value will be ignored.", "labels": ["Other"]}, {"id": 5094, "text": "PARAMETER_0 - true for rollover toolbar buttons; otherwise false", "labels": ["Other"]}, {"id": 5095, "text": "PARAMETER_0 - the action to be performed, if a value is present", "labels": ["Other"]}, {"id": 5096, "text": "PARAMETER_0 - Socket address to bind to, or null for an unbound socket.", "labels": ["Other"]}, {"id": 5097, "text": "PARAMETER_0 - true if METHOD_0 and METHOD_1 are forwarded, false if they should operate directly on the CLASS_0.", "labels": ["Other"]}, {"id": 5098, "text": "PARAMETER_3 - the string to display, may be null", "labels": ["Other"]}, {"id": 5099, "text": "PARAMETER_0 - the local time, not null", "labels": ["Guard"]}, {"id": 5100, "text": "PARAMETER_1 - an optional CLASS_1 to be applied to the coordinates as they are returned in the iteration, or null if untransformed coordinates are desired", "labels": ["Other"]}, {"id": 5101, "text": "PARAMETER_0 - the guarded invocation that the call site should incorporate into its target method handle.", "labels": ["Other"]}, {"id": 5102, "text": "PARAMETER_3 - the default value for the CLASS_0 reference, or null.", "labels": ["Other"]}, {"id": 5103, "text": "PARAMETER_3 - upon return from the method, this object will contain the applied QOP, the privacy state of the message, and supplementary information stating if the token was a duplicate, old, out of sequence or arriving after a gap.", "labels": ["Other"]}, {"id": 5104, "text": "PARAMETER_0 - The property name, which is a non-null fully-qualified URI.", "labels": ["Guard"]}, {"id": 5105, "text": "PARAMETER_1 - for a horizontal progress bar, this should be the inside height of the progress bar; this value might be used to constrain or determine the return value", "labels": ["Other"]}, {"id": 5106, "text": "PARAMETER_2 - the menu to be used for the tray icon's popup menu; if the value is null no popup menu is shown", "labels": ["Other"]}, {"id": 5107, "text": "PARAMETER_0 - the port on which the object is exported (an anonymous port is used if port=0)", "labels": ["Other"]}, {"id": 5108, "text": "PARAMETER_0 - The possibly null name to set resolved name to. If null, it sets the resolved name field to null.", "labels": ["Other"]}, {"id": 5109, "text": "PARAMETER_1 - the column label to be used in printouts and displays; if the column label is null, an empty CLASS_1 is set", "labels": ["Other"]}, {"id": 5110, "text": "PARAMETER_4 - A string representing the attribute's default value, or null if there is none.", "labels": ["Other"]}, {"id": 5111, "text": "PARAMETER_0 - the end date, exclusive, which is converted to a CLASS_0 in the same chronology, not null", "labels": ["Guard"]}, {"id": 5112, "text": "PARAMETER_0 - The exception that was caught.", "labels": ["Other"]}, {"id": 5113, "text": "PARAMETER_3 - the line number of the source line containing the execution point represented by this stack trace element, or a negative number if this information is unavailable. A value of -2 indicates that the method containing the execution point is a native method", "labels": ["Other"]}, {"id": 5114, "text": "PARAMETER_0 - the new viewport to be used; if viewport is null, the old viewport is still removed and the new viewport is set to null", "labels": ["Other"]}, {"id": 5115, "text": "PARAMETER_4 - an array of CLASS_1s indicating the class names of any additional formats supported by this object, or null if there are none.", "labels": ["Other"]}, {"id": 5116, "text": "PARAMETER_0 - The possibly null Attributes that is to be bound with the object.", "labels": ["Other"]}, {"id": 5117, "text": "PARAMETER_0 - the CLASS_1 corresponding to the annotation type, not null", "labels": ["Guard"]}, {"id": 5118, "text": "PARAMETER_5 - the name of the table that imports the key; must match the table name as it is stored in the database", "labels": ["Other"]}, {"id": 5119, "text": "PARAMETER_2 - an array containing embedding values for each character in the paragraph. This can be null, in which case it is assumed that there is no external embedding information.", "labels": ["Other"]}, {"id": 5120, "text": "PARAMETER_0 - a catalog name; \"\" retrieves those without a catalog; null means drop catalog name from the selection criteria", "labels": ["Other"]}, {"id": 5121, "text": "PARAMETER_1 - the title of the PrintJob. A null title is equivalent to \"\".", "labels": ["Other"]}, {"id": 5122, "text": "PARAMETER_2 - the CLASS_1 that is asking the renderer to draw; can be null", "labels": ["Other"]}, {"id": 5123, "text": "PARAMETER_0 - the map of fields to values, which can be updated, not null", "labels": ["Guard"]}, {"id": 5124, "text": "PARAMETER_1 - An optional list of file attributes to set atomically when creating the file", "labels": ["Other"]}, {"id": 5125, "text": "PARAMETER_2 - the time, in milliseconds, before the call aborts", "labels": ["Other"]}, {"id": 5126, "text": "PARAMETER_0 - the system-dependent file name where data is written, not null", "labels": ["Guard"]}, {"id": 5127, "text": "PARAMETER_0 - The non-null component to add.", "labels": ["Guard"]}, {"id": 5128, "text": "PARAMETER_0 - if true, enables this menu item; if false, disables it.", "labels": ["Other"]}, {"id": 5129, "text": "PARAMETER_1 - The possibly null environment properties to use when for the new context. If null, the context is initialized with no environment properties.", "labels": ["Other"]}, {"id": 5130, "text": "PARAMETER_1 - the list of acceptable CA issuer subject names, or null if it does not matter which issuers are used.", "labels": ["Other"]}, {"id": 5131, "text": "PARAMETER_0 - the sharding key to be validated against this connection. The sharding key may be null", "labels": ["Other"]}, {"id": 5132, "text": "PARAMETER_0 - the end temporal, exclusive, converted to be of the same type as this object, not null", "labels": ["Guard"]}, {"id": 5133, "text": "PARAMETER_0 - client window's PARAMETER_0 on the screen; or null if the client window is iconified or invisible", "labels": ["Other"]}, {"id": 5134, "text": "PARAMETER_0 - the ordinal number of the placeholder parameter in this CLASS_2 object's command that is to be set. The first parameter is 1, the second is 2, and so on; must be 1 or greater", "labels": ["Guard"]}, {"id": 5135, "text": "PARAMETER_1 - list of descriptors that describes the fields of the event, not null", "labels": ["Guard"]}, {"id": 5136, "text": "PARAMETER_0 - an CLASS_2, or null to use a default CLASS_2.", "labels": ["Other"]}, {"id": 5137, "text": "PARAMETER_3 - The context to be sent to the listener when a notification is emitted.", "labels": ["Other"]}, {"id": 5138, "text": "PARAMETER_0 - The unit size in bytes, must be a power of 2", "labels": ["Guard"]}, {"id": 5139, "text": "PARAMETER_4 - a schema name; must match the schema name as it is stored in the database; \"\" retrieves those without a schema; null means drop schema name from the selection criteria", "labels": ["Other"]}, {"id": 5140, "text": "PARAMETER_0 - the exception to be added to the list of suppressed exceptions", "labels": ["Other"]}, {"id": 5141, "text": "PARAMETER_2 - the field to append, not null", "labels": ["Guard"]}, {"id": 5142, "text": "PARAMETER_0 - the window to act as owner or null if this window has no owner", "labels": ["Other"]}]