[{"id": 3991, "text": "The logical bounds does not always enclose all the text.", "labels": ["Other"]}, {"id": 3992, "text": "Pending events, if any, remain pending and may be retrieved by invoking the METHOD_0 method after the key is cancelled.", "labels": ["Other"]}, {"id": 3993, "text": "The given CLASS_1 must contain all the following attributes: description Attribute Name Type index METHOD_0 startTime METHOD_0 endTime METHOD_0 memoryUsageBeforeGc METHOD_1 memoryUsageAfterGc METHOD_1", "labels": ["Other"]}, {"id": 3994, "text": "Note: This method exists for backward binary compatibility with earlier versions of the Swing library.", "labels": ["Other"]}, {"id": 3995, "text": "Therefore, the default implementation is to return true if the view has children.", "labels": ["Other"]}, {"id": 3996, "text": "Processes a mouse event forwarded from the CLASS_0 and changes the menu selection, if necessary, by using the CLASS_0's API.", "labels": ["Other"]}, {"id": 3997, "text": "If this method is called more than once with the same library name, the second and subsequent calls are ignored.", "labels": ["Other"]}, {"id": 3998, "text": "class MyListUI extends BasicListUI { protected MouseInputListener createMouseInputListener() { return new MyMouseInputHandler(); } public class MyMouseInputHandler extends MouseInputHandler { public void mouseMoved(MouseEvent e) { // do some extra work when the mouse moves super.mouseMoved(e); } } }", "labels": ["Other"]}, {"id": 3999, "text": "The returned CLASS_0 will not be resizable by the user, however programs can invoke METHOD_1 on the CLASS_0 instance to change this property.", "labels": ["Temporal"]}, {"id": 4000, "text": "However, providing different heights to each page will likely not work well with FIELD_0 when it has to spread columns across pages.", "labels": ["Other"]}, {"id": 4001, "text": "If no such implementation exists, this method returns null.", "labels": ["Other"]}, {"id": 4002, "text": "If an attribute with that name is already present in the element, its value is changed to be that of the value parameter.", "labels": ["Other"]}, {"id": 4003, "text": "Security manager permission checks are performed in this factory method, when the CLASS_6 is created.", "labels": ["Other"]}, {"id": 4004, "text": "If dragger is not null it is messaged with continueDrag.", "labels": ["Other"]}, {"id": 4005, "text": "Returns true if and only if this CLASS_0 instance contains an item whose value is PARAMETER_0.", "labels": ["Other"]}, {"id": 4006, "text": "An CLASS_2 will be thrown if the CLASS_0 cannot be resovled with the CLASS_1.", "labels": ["Exception"]}, {"id": 4007, "text": "If no registered CLASS_2 claims to be able to read the stream, null is returned.", "labels": ["Other"]}, {"id": 4008, "text": "If you want a CLASS_0 that respects the component orientation you should create the CLASS_0 using the constructor and pass in FIELD_0, eg: Box lineBox = new Box(BoxLayout.PAGE_AXIS);", "labels": ["Other"]}, {"id": 4009, "text": "Closes the current entry if still active.", "labels": ["Other"]}, {"id": 4010, "text": "Note that this conversion can lose information about the overall magnitude and precision of this CLASS_0 value as well as return a result with the opposite sign.", "labels": ["Other"]}, {"id": 4011, "text": "This method returns -1 if the initial memory size is undefined.", "labels": ["Other"]}, {"id": 4012, "text": "Used to indicate whether the 'ctrl' key was depressed during the firing of the event.", "labels": ["Other"]}, {"id": 4013, "text": "Returns whether this two-dimensional size attribute is equivalent to the passed in object.", "labels": ["Other"]}, {"id": 4014, "text": "Returns a read-only iterator over the nodes contained in this CLASS_0 in document order.", "labels": ["Other"]}, {"id": 4015, "text": "Returns whether this Container is the root of a focus traversal cycle.", "labels": ["Other"]}, {"id": 4016, "text": "Gets the instance of CLASS_0 associated with the specified CLASS_1 object, or null if none of the menu items being managed by this menu bar is associated with the specified menu shortcut.", "labels": ["Other"]}, {"id": 4017, "text": "Determines whether the specified RDN sequence forms a suffix of this LDAP name.", "labels": ["Other"]}, {"id": 4018, "text": "If it is not sorted, the results are undefined.", "labels": ["Guard"]}, {"id": 4019, "text": "The returned value is a hint, rather than a guarantee, because the underlying operating system may have paged out some of the buffer's data by the time that an invocation of this method returns.", "labels": ["Other"]}, {"id": 4020, "text": "An attempt to write a file of such a type will fail with an CLASS_0 if the length in the audio file type is FIELD_0.", "labels": ["Guard"]}, {"id": 4021, "text": "Returns a copy of the array of AC Huffman tables set on the most recent call to METHOD_0, or null if tables are not currently set.", "labels": ["Other"]}, {"id": 4022, "text": "When the new key is set, a PropertyChange event (FOCUS_ACCELERATOR_KEY) will be fired.", "labels": ["Other"]}, {"id": 4023, "text": "If the default implementation of METHOD_2 is used (that is, that method is not overridden), then this results in a call to the security manager's METHOD_4 method with a METHOD_5 permission.", "labels": ["Other"]}, {"id": 4024, "text": "UIs might need to override this if they present areas on the screen that can be viewed as components, but actual components are not used for presenting those areas.", "labels": ["Other"]}, {"id": 4025, "text": "Note that right rotation with a negative distance is equivalent to left rotation: METHOD_0.", "labels": ["Other"]}, {"id": 4026, "text": "More formally, a thread is monitor deadlocked if it is part of a cycle in the relation \"is waiting for an object monitor owned by\".", "labels": ["Other"]}, {"id": 4027, "text": "If there are additional parameters, the array element will itself be an array containing the value to be set plus any additional parameter values supplied to the setter method.", "labels": ["Other"]}, {"id": 4028, "text": "If the exponent of the result is between FIELD_0 and FIELD_1, the answer is calculated exactly.", "labels": ["Other"]}, {"id": 4029, "text": "Always returns a List, which may be empty if the header is not present.", "labels": ["Other"]}, {"id": 4030, "text": "If non-null you can override some of the system supplied values while accepting others by setting those fields you want to accept from system to FIELD_0.", "labels": ["Other"]}, {"id": 4031, "text": "Only system and user function descriptions matching the schema and function name criteria are returned.", "labels": ["Other"]}, {"id": 4032, "text": "Sets whether or not the view represents a subscript.", "labels": ["Other"]}, {"id": 4033, "text": "The value is always between the minimum and maximum values, inclusive.", "labels": ["Other"]}, {"id": 4034, "text": "Returns read access mode for the role (true if it is readable).", "labels": ["Other"]}, {"id": 4035, "text": "Unlike METHOD_0, the mappings will only be established in one direction, and the natives need not be encoded.", "labels": ["Other"]}, {"id": 4036, "text": "Attempting to move beyond the first/last row in the result set positions the cursor before/after the the first/last row.", "labels": ["Other"]}, {"id": 4037, "text": "The CLASS_1 will receive drops only if it is enabled.", "labels": ["Other"]}, {"id": 4038, "text": "The mapping from a local date-time to an offset is not straightforward.", "labels": ["Other"]}, {"id": 4039, "text": "When the object name is null or no domain and key properties are specified, all objects are to be selected (and filtered if a query is specified).", "labels": ["Other"]}, {"id": 4040, "text": "The file tree is traversed depth-first, the elements in the stream are CLASS_1 objects that are obtained as if by METHOD_0 the relative path against PARAMETER_0.", "labels": ["Other"]}, {"id": 4041, "text": "The METHOD_0 method may be used if only source clipping is desired.", "labels": ["Other"]}, {"id": 4042, "text": "For example, this method will return the FIELD_0 block if provided with the \"BASIC_LATIN\" name.", "labels": ["Other"]}, {"id": 4043, "text": "This method is called once immediately after instantiating this input method.", "labels": ["Other"]}, {"id": 4044, "text": "When the METHOD_0 is null, the CLASS_2 uses its METHOD_1.", "labels": ["Other"]}, {"id": 4045, "text": "Zero-padding should be achieved using the appendValue methods.", "labels": ["Other"]}, {"id": 4046, "text": "Invoked when the text entered through an input method has changed.", "labels": ["Other"]}, {"id": 4047, "text": "The returned string will typically include the thread name, the thread ID, its state, and a stack trace if any.", "labels": ["Other"]}, {"id": 4048, "text": "Client code should not assume one behavior over another, nor should it assume that the behavior, once established, will not change.", "labels": ["Other"]}, {"id": 4049, "text": "Return whether the password should be displayed as it is being typed.", "labels": ["Other"]}, {"id": 4050, "text": "The generated name must be unique within active snippets.", "labels": ["Other"]}, {"id": 4051, "text": "Environment variables should be used when a global effect is desired, or when an external system interface requires an environment variable (such as FIELD_0).", "labels": ["Other"]}, {"id": 4052, "text": "The default implementation returns the rectangle returned by METHOD_1, transformed by the provided CLASS_3 if present.", "labels": ["Other"]}, {"id": 4053, "text": "Subclasses should override to undo the operation represented by this edit.", "labels": ["Other"]}, {"id": 4054, "text": "Fields that are ambiguously multiply inherited or fields that are hidden by fields with the same name in a more recently inherited class cannot be accessed by their simple names and are not included in the returned list.", "labels": ["Other"]}, {"id": 4055, "text": "Retrieves whether this database supports some form of FIELD_0 clause.", "labels": ["Other"]}, {"id": 4056, "text": "A value less than 0 indicates the number of edits is not limited.", "labels": ["Other"]}, {"id": 4057, "text": "Returns the CLASS_0 before a given index.", "labels": ["Other"]}, {"id": 4058, "text": "Applications may register a new or different handler in the middle of a parse, and the SAX parser must begin using the new handler immediately.", "labels": ["Other"]}, {"id": 4059, "text": "Tests whether a file is writable.", "labels": ["Other"]}, {"id": 4060, "text": "If this object's file (getLocation().getFile()) doesn't equal codesource's file, then the following checks are made: If this object's file ends with \"/-\", then codesource's file must start with this object's file (exclusive the trailing \"-\").", "labels": ["Other"]}, {"id": 4061, "text": "Determines whether this name is empty.", "labels": ["Other"]}, {"id": 4062, "text": "Returns the index of the first occurrence of the specified element in this vector, searching forwards from PARAMETER_0, or returns -1 if the element is not found.", "labels": ["Other"]}, {"id": 4063, "text": "The shaper assumes EUROPEAN as the starting context, that is, if EUROPEAN digits are encountered before any strong directional text in the string, the context is presumed to be EUROPEAN, and so the digits will not shape.", "labels": ["Other"]}, {"id": 4064, "text": "Checks if this FilePermission object \"implies\" the specified permission.", "labels": ["Other"]}, {"id": 4065, "text": "Note that the thrown argument is stored in the LogRecord thrown property, rather than the LogRecord parameters property.", "labels": ["Other"]}, {"id": 4066, "text": "Changes made to the CLASS_0 object returned from this method do not affect the CLASS_0 object of this CLASS_1.", "labels": ["Other"]}, {"id": 4067, "text": "Returns true if the given object is also a CLASS_0 and the two NTSids have the same String representation.", "labels": ["Other"]}, {"id": 4068, "text": "If the system property METHOD_4 is defined or it is defined in the file \"sound.properties\", it is used to retrieve the default clip.", "labels": ["Other"]}, {"id": 4069, "text": "If the name sequence is empty then the pathname does not name a parent directory.", "labels": ["Other"]}, {"id": 4070, "text": "The method is only called if the source has actually become invisible.", "labels": ["Other"]}, {"id": 4071, "text": "The returned object will initially be in an initial state as if its METHOD_0 method had been called.", "labels": ["Other"]}, {"id": 4072, "text": "The mark, if defined, is discarded.", "labels": ["Other"]}, {"id": 4073, "text": "A bean may have a default property commonly updated when this bean is customized.", "labels": ["Other"]}, {"id": 4074, "text": "Where used as a work files, the resulting file may be opened using the FIELD_0 option so that the file is deleted when the appropriate METHOD_1 method is invoked.", "labels": ["Other"]}, {"id": 4075, "text": "Determines whether a compound name is a suffix of this compound name.", "labels": ["Other"]}, {"id": 4076, "text": "If this CLASS_1 represents either the CLASS_2 class, an interface type, an array type, a primitive type, or void, the return value is null.", "labels": ["Other"]}, {"id": 4077, "text": "Returns whether the file dialog allows the multiple file selection.", "labels": ["Other"]}, {"id": 4078, "text": "The class will be dynamically loaded later when actually needed using the given CLASS_0, and can be safely changed before attempted uses to avoid loading unwanted classes.", "labels": ["Other"]}, {"id": 4079, "text": "When multiple certificates are available for use in a handshake, the implementation chooses what it considers the \"best\" certificate chain available, and transmits that to the other side.", "labels": ["Other"]}, {"id": 4080, "text": "It will throw the NotActiveException if it is called otherwise.", "labels": ["Exception"]}, {"id": 4081, "text": "It will always return false for \"compound\" states like FIELD_0.", "labels": ["Other"]}, {"id": 4082, "text": "Before writing out the tag, this method ensures that all other tags that have been opened are appropriately closed off.", "labels": ["Other"]}, {"id": 4083, "text": "The following code can be used to dump the set into a newly allocated array of CLASS_0: METHOD_2 Note that METHOD_3 is identical in function to METHOD_0.", "labels": ["Other"]}, {"id": 4084, "text": "The symbolic type descriptor at the call site of METHOD_2 must match the access mode type that is the result of calling METHOD_3 on this VarHandle.", "labels": ["Guard"]}, {"id": 4085, "text": "Returns the default renderer used when no METHOD_0 is defined by a CLASS_0.", "labels": ["Other"]}, {"id": 4086, "text": "If the radix is not in the range FIELD_0 ≤ PARAMETER_0 ≤ FIELD_1 or if the character is not a valid digit in the specified radix, -1 is returned.", "labels": ["Other"]}, {"id": 4087, "text": "Determines whether the authentication id is allowed to act on behalf of the authorization id.", "labels": ["Other"]}, {"id": 4088, "text": "If PARAMETER_0 is a CLASS_3 with a FIELD_0 CLASS_4 that is neither null nor empty, returns true.", "labels": ["Other"]}, {"id": 4089, "text": "You should not normally invoke this, instead set the CLASS_1 or set the value.", "labels": ["Other"]}, {"id": 4090, "text": "Restricts the events generated by this request to the unloading of reference types whose name does not match a restricted regular expression.", "labels": ["Other"]}, {"id": 4091, "text": "Note that the length of the entire message includes the status byte and the meta message type byte, and therefore may be longer than the returned array.", "labels": ["Other"]}, {"id": 4092, "text": "If the parent is null, then the dialog depends on no visible window, and it's placed in a look-and-feel-dependent position such as the center of the screen.", "labels": ["Other"]}, {"id": 4093, "text": "If so, the method calls the security manager's METHOD_0 method with the corresponding permission to ensure that the image creation is allowed.", "labels": ["Other"]}, {"id": 4094, "text": "Returns true if a viewport should always force the height of this CLASS_0 to match the height of the viewport.", "labels": ["Other"]}, {"id": 4095, "text": "Tells whether this process builder merges standard error and standard output.", "labels": ["Other"]}, {"id": 4096, "text": "A CLASS_0 must support reverse checking and may support forward checking.", "labels": ["Other"]}, {"id": 4097, "text": "This exception interacts with a thread's interrupted status, and runtime misbehavior is likely to occur if an InterruptedException is suppressed.", "labels": ["Exception"]}, {"id": 4098, "text": "Developers must never assume that this component is the focus owner until this component receives a FOCUS_GAINED event.", "labels": ["Other"]}, {"id": 4099, "text": "This method gets called when a constrained property is changed.", "labels": ["Other"]}, {"id": 4100, "text": "If the list does not contain the element, it is unchanged.", "labels": ["Other"]}, {"id": 4101, "text": "Returns the type of image to be returned by the read, if one was set by a call to METHOD_0, as an CLASS_0.", "labels": ["Other"]}, {"id": 4102, "text": "If the current line is empty, this will not make it so that the current line is still considered empty.", "labels": ["Other"]}, {"id": 4103, "text": "A single read or skip of this many bytes will not block, but may read or skip fewer bytes.", "labels": ["Other"]}, {"id": 4104, "text": "Checks whether the superscript attribute is set.", "labels": ["Other"]}, {"id": 4105, "text": "If isDefault is false, the prefix must be declared and the writer must prepend xmlns to the prefix and write out a standard prefix declaration.", "labels": ["Other"]}, {"id": 4106, "text": "A component without any properties that would affect the viewport size should just return METHOD_1 here.", "labels": ["Other"]}, {"id": 4107, "text": "This method reads a PRIMITIVE_1 value, starting at the current file pointer, as if by the METHOD_0 method and then converts that PRIMITIVE_1 to a PRIMITIVE_0 using the METHOD_1 method in class CLASS_0.", "labels": ["Other"]}, {"id": 4108, "text": "Specifies that the parser produced by this code will convert CDATA nodes to Text nodes and append it to the adjacent (if any) text node.", "labels": ["Other"]}, {"id": 4109, "text": "The only exception is if the current string contains no whitespace, and won't fit in which case the line length will exceed METHOD_3.", "labels": ["Other"]}, {"id": 4110, "text": "Acquires the lock if it is available and returns immediately with the value true.", "labels": ["Other"]}, {"id": 4111, "text": "Events may be generated before the changes have become permanent.", "labels": ["Other"]}, {"id": 4112, "text": "The static initializer of the class is not run.", "labels": ["Other"]}, {"id": 4113, "text": "If PARAMETER_0 is false, instructs the CLASS_0 to send only one action event to its listeners.", "labels": ["Other"]}, {"id": 4114, "text": "If an operation (such as METHOD_0 for example) is in progress when this method is invoked then the behaviour is implementation dependent.", "labels": ["Other"]}, {"id": 4115, "text": "After this method returns, the next byte to be read will have the value (byte)b.", "labels": ["Other"]}, {"id": 4116, "text": "If there are fewer chars remaining in the buffer than are required to satisfy the request, that is, if PARAMETER_0 > METHOD_0, then no chars are transferred and a CLASS_0 is thrown.", "labels": ["Guard", "Exception"]}, {"id": 4117, "text": "However, most CLASS_0 object users can simply ignore this extra detail because only sophisticated applications will likely want to take advantage of this feature.", "labels": ["Other"]}, {"id": 4118, "text": "Note: The METHOD_4 method will determine if the FIELD_0 is set to true or not.", "labels": ["Other"]}, {"id": 4119, "text": "It is up to the implementation to take into account the FIELD_0 and the cookies attributes and security settings to determine which ones should be returned.", "labels": ["Other"]}, {"id": 4120, "text": "Returns true if the tree root is visible.", "labels": ["Other"]}, {"id": 4121, "text": "Two null values are deeply equal.", "labels": ["Other"]}, {"id": 4122, "text": "The intent is that a reasonable inspection of the basic structure of the image be performed in order to determine if it is within the scope of the encoding format.", "labels": ["Other"]}, {"id": 4123, "text": "This returns true if PARAMETER_0 is a CLASS_0 with the exact same elements (as determined by using METHOD_0 on each element of the path).", "labels": ["Other"]}, {"id": 4124, "text": "It should support direct handoff or unbounded queuing of submitted tasks, and the thread that invokes the METHOD_0 method should never invoke the task directly.", "labels": ["Other"]}, {"id": 4125, "text": "Sets the exception handler for this stream to PARAMETER_0.", "labels": ["Other"]}, {"id": 4126, "text": "The given constant tells the driver whether it should make auto-generated keys available for retrieval.", "labels": ["Other"]}, {"id": 4127, "text": "The Field must be valid for this ObjectReference; that is, it must be from the mirrored object's class or a superclass of that class.", "labels": ["Other"]}, {"id": 4128, "text": "All elements in this range must implement the CLASS_0 interface.", "labels": ["Other"]}, {"id": 4129, "text": "The type must be one that is supported by METHOD_1.", "labels": ["Other"]}, {"id": 4130, "text": "Two CLASS_0 instances are equal if and only if all of the following statements are true: their type names are equal their row types are equal they use the same index names, in the same order", "labels": ["Other"]}, {"id": 4131, "text": "To indicate the root has changed, childIndices and children will be null.", "labels": ["Other"]}, {"id": 4132, "text": "After this method returns successfully, unless there is an intervening call to METHOD_1, subsequent calls to METHOD_2, METHOD_3, and METHOD_0 will return true and calls to METHOD_4 and related methods will result in CLASS_0.", "labels": ["Temporal"]}, {"id": 4133, "text": "Tests if this thread group is a daemon thread group.", "labels": ["Other"]}, {"id": 4134, "text": "If fewer formats are provided than needed, then only the formats for argument indices less than METHOD_3 are replaced.", "labels": ["Other"]}, {"id": 4135, "text": "This method behaves in exactly the same manner as the METHOD_0 method except that instead of specifying a completion handler, this method returns a Future representing the pending result.", "labels": ["Other"]}, {"id": 4136, "text": "If there is no association existing between this channel's socket and the intended receiver, identified by the address in the given messageInfo, then one will be automatically setup to the intended receiver.", "labels": ["Other"]}, {"id": 4137, "text": "While similar to resolveObject these validations are called after the entire graph has been reconstituted.", "labels": ["Other"]}, {"id": 4138, "text": "Even when the platform supports an action, a file or URI may not have a registered application for the action.", "labels": ["Other"]}, {"id": 4139, "text": "Returns true if the entry identified by the given alias was created by a call to METHOD_0, or created by a call to METHOD_1 with a CLASS_0 or a CLASS_1.", "labels": ["Other"]}, {"id": 4140, "text": "If the entry is read from a ZIP file or ZIP file formatted input stream, this is the last modification time from the zip file entry's METHOD_0 if the extended timestamp fields are present.", "labels": ["Other"]}, {"id": 4141, "text": "This method is guaranteed to pass back a non-null array, so that no null-checking is required in fire methods.", "labels": ["Other"]}, {"id": 4142, "text": "If there is a security manager, its METHOD_0 method is called for each InetAddress.", "labels": ["Other"]}, {"id": 4143, "text": "Returns the child Component of this Window that has focus if this Window is focused; returns null otherwise.", "labels": ["Other"]}, {"id": 4144, "text": "Each instance in the returned array should actually be a subclass of CLASS_2 which implements the CLASS_0 interface (typically CLASS_3).", "labels": ["Other"]}, {"id": 4145, "text": "if any of p's headers are not in this's request header list, and if this's request header list is not equal to \"*\", then return false.", "labels": ["Other"]}, {"id": 4146, "text": "Note that the alpha component of the returned color indicates whether the window is in the non-opaque (per-pixel translucent) mode.", "labels": ["Other"]}, {"id": 4147, "text": "Retrieves, but does not remove, the last element of this list, or returns null if this list is empty.", "labels": ["Other"]}, {"id": 4148, "text": "An empty array is returned if the row count is 0, or the specified indices do not bound the viewable set of rows.", "labels": ["Other"]}, {"id": 4149, "text": "Determines if the referenced character (Unicode code point) is an ISO control character.", "labels": ["Other"]}, {"id": 4150, "text": "p.T obj = ....; // instance of p.T : Method m = p.T.class.getDeclaredMethod(\"privateMethod\"); if (m.trySetAccessible()) { m.invoke(obj); } else { // package p is not opened to the caller to access private member of T ... } If there is a security manager, its METHOD_6 method is first called with a METHOD_7 permission.", "labels": ["Other"]}, {"id": 4151, "text": "To iterate over the true bits in a CLASS_0, use the following loop: for (int i = bs.nextSetBit(0); i >= 0; i = bs.nextSetBit(i+1)) { // operate on index i here if (i == Integer.MAX_VALUE) { break; // or (i+1) would overflow } }", "labels": ["Other"]}, {"id": 4152, "text": "When a string-valued filter argument is substituted for a variable, the filter is interpreted as if the string were given in place of the variable, with any characters having special significance within filters (such as '*') having been escaped according to the rules of RFC 2254.", "labels": ["Other"]}, {"id": 4153, "text": "Property to remember whether a directory is currently selected in the UI.", "labels": ["Other"]}, {"id": 4154, "text": "If this is true, then any future calculations, such as addition or subtraction, have no complex edge cases due to time-zone rules.", "labels": ["Other"]}, {"id": 4155, "text": "In order to enable automatic drag handling, this property should be set to true, and the tree's CLASS_0 needs to be METHOD_0.", "labels": ["Other"]}, {"id": 4156, "text": "Returns whether or not PARAMETER_0 is a keyword, boolean literal, or null literal in the given source version.", "labels": ["Other"]}, {"id": 4157, "text": "In this case, some non-null elements in the array may be processed before the method returns abnormally.", "labels": ["Other"]}, {"id": 4158, "text": "If T0 is a reference and T1 a primitive, an unboxing conversion will be applied at runtime, possibly followed by a Java casting conversion (JLS 5.5) on the primitive value, possibly followed by a conversion from byte to boolean by testing the low-order bit.", "labels": ["Other"]}, {"id": 4159, "text": "If verification has been enabled, any invalid signature on the current entry will be reported at some point before the end of the entry is reached.", "labels": ["Other"]}, {"id": 4160, "text": "Returns whether this job impressions attribute is equivalent to the passed in object.", "labels": ["Other"]}, {"id": 4161, "text": "The returned array is always non-null.", "labels": ["Other"]}, {"id": 4162, "text": "May return null if the field is specified only by an integer field ID.", "labels": ["Other"]}, {"id": 4163, "text": "If the given PARAMETER_0 is empty, this CLASS_0 is configured to skip all hidden frames and no class reference is retained.", "labels": ["Other"]}, {"id": 4164, "text": "In other words, it tells us if this credential can be used for initiating or accepting security contexts.", "labels": ["Other"]}, {"id": 4165, "text": "A subclass that can emit other notifications should return an array that contains this element plus descriptions of the other notifications.", "labels": ["Other"]}, {"id": 4166, "text": "If this path was created by converting a path string using the METHOD_0 method then the path string returned by this method may differ from the original String used to create the path.", "labels": ["Other"]}, {"id": 4167, "text": "If necessary, adds dummy arguments.", "labels": ["Other"]}, {"id": 4168, "text": "If no CLASS_1 was set in this client's builder, then the CLASS_0 is empty.", "labels": ["Other"]}, {"id": 4169, "text": "This method is equivalent to evaluating the expression: open((AsynchronousChannelGroup)null);", "labels": ["Other"]}, {"id": 4170, "text": "If the new minimum value is different from the previous minimum value, all change listeners are notified.", "labels": ["Other"]}, {"id": 4171, "text": "Otherwise, if a property is explicitly specified in the stylesheet, that value will be returned.", "labels": ["Other"]}, {"id": 4172, "text": "For an array type, the string starts with the type name, followed by an angle-bracketed comma-separated list of the type's type parameters, if any, followed by a sequence of [] characters, one set of brackets per dimension of the array.", "labels": ["Other"]}, {"id": 4173, "text": "In many common situations, for example when working URIs that are known to be either URNs or URLs, the hierarchical URIs being used will always be server-based.", "labels": ["Other"]}, {"id": 4174, "text": "If a CLASS_5 cannot be created (by means of the CLASS_6 API) for an automatic module then CLASS_7 is thrown.", "labels": ["Other"]}, {"id": 4175, "text": "Tests whether the process represented by this CLASS_0 is alive.", "labels": ["Other"]}, {"id": 4176, "text": "Returns true if the specified object is equal to this enum constant.", "labels": ["Other"]}, {"id": 4177, "text": "This method otherwise behaves exactly as specified by the CLASS_1 interface.", "labels": ["Other"]}, {"id": 4178, "text": "If index is greater than or equal to the number of rules in the list, this returns null.", "labels": ["Other"]}, {"id": 4179, "text": "That is, if the target is exactly of the given PARAMETER_0, it will behave like METHOD_1; otherwise it behave as if METHOD_2 is used to convert the target to the required PARAMETER_0.", "labels": ["Other"]}, {"id": 4180, "text": "Setting the handler to null causes all METHOD_0 requests to be enqueued until another handler is set.", "labels": ["Other"]}, {"id": 4181, "text": "Note: This method should be called under AWT tree lock.", "labels": ["Other"]}, {"id": 4182, "text": "If this thread is blocked in an invocation of the METHOD_1, METHOD_2, or METHOD_3 methods of the CLASS_1 class, or of the METHOD_4, METHOD_5, METHOD_6, METHOD_7, or METHOD_8, methods of this class, then its interrupt status will be cleared and it will receive an CLASS_2.", "labels": ["Other"]}, {"id": 4183, "text": "If the field does not have a fixed set of valid values then an exception will be thrown.", "labels": ["Exception"]}, {"id": 4184, "text": "Sets the resolved link name field of this exception.", "labels": ["Other"]}, {"id": 4185, "text": "The CLASS_2 is also responsible for rendering the the cell representing the tree's current DnD drop location if it has one.", "labels": ["Other"]}, {"id": 4186, "text": "The overall effect is exactly as if the argument were converted to a PRIMITIVE_0 array by the method METHOD_1 and the character in that array were then METHOD_2 to this character sequence.", "labels": ["Other"]}, {"id": 4187, "text": "Returns the file used to create this exception.", "labels": ["Other"]}, {"id": 4188, "text": "If running with modules, all modules in the modules graph are searched for matching packages.", "labels": ["Other"]}, {"id": 4189, "text": "This method is invoked on registered objects when a SSL handshake is completed.", "labels": ["Other"]}, {"id": 4190, "text": "If the iteration variable types (V T) are dropped from the internal parameter list, the resulting shorter list (A...) is called the external parameter list.", "labels": ["Other"]}, {"id": 4191, "text": "Tests if two string regions are equal.", "labels": ["Other"]}, {"id": 4192, "text": "Note that some devices, once closed, cannot be reopened.", "labels": ["Other"]}, {"id": 4193, "text": "If null is returned, the minimum size will be calculated by the component's layout manager instead (this is the preferred approach for any component with a specific layout manager installed).", "labels": ["Other"]}, {"id": 4194, "text": "If no attribute with the given name was present in the given element, nothing happens and no exception is thrown.", "labels": ["Exception"]}, {"id": 4195, "text": "However, if the data line is closed, stopped, drained, or flushed before the requested amount has been read, the method no longer blocks, but returns the number of bytes read thus far.", "labels": ["Other"]}, {"id": 4196, "text": "Returns whether the representation class for this CLASS_0 is METHOD_0 or a subclass thereof.", "labels": ["Other"]}, {"id": 4197, "text": "This method can be used as an alternative to the METHOD_1 method when an application has a connection to an open CLASS_1 object.", "labels": ["Other"]}, {"id": 4198, "text": "This method writes out the preamble associated with the XML encoding if it has not been written already and then writes out all of the values that been written to the stream since the last time METHOD_0 was called.", "labels": ["Other"]}, {"id": 4199, "text": "null indicates the renderers font should be used.", "labels": ["Other"]}, {"id": 4200, "text": "Gets the Serializable (if any) associated with the specified Child", "labels": ["Other"]}, {"id": 4201, "text": "This method blocks until input data is available, the end of the stream is detected, or an exception is thrown.", "labels": ["Other"]}, {"id": 4202, "text": "Otherwise, the string value is a comma-separated list of the ranges in the canonical array form, where each range is represented as \"i\" if the lower bound equals the upper bound or \"i-j\" otherwise.", "labels": ["Other"]}, {"id": 4203, "text": "If the MBean object name given is null, the MBean must provide its own name by implementing the CLASS_0 interface and returning the name from the METHOD_0 method.", "labels": ["Other"]}, {"id": 4204, "text": "This should be done with the utmost care, since the CLASS_2 may still be in use by other threads.", "labels": ["Other"]}, {"id": 4205, "text": "This checks to see if this date represents a point on the local time-line before the other date.", "labels": ["Other"]}, {"id": 4206, "text": "If the membership key is source-specific then the channel will no longer receive datagrams sent to the group from that source address.", "labels": ["Other"]}, {"id": 4207, "text": "Once a file system created by this provider is METHOD_3 it is provider-dependent if this method returns a reference to the closed file system or throws CLASS_1.", "labels": ["Other"]}, {"id": 4208, "text": "This method should be invoked in tandem with the METHOD_0 method, using a METHOD_1 ... METHOD_2 block as shown above, in order to implement asynchronous closing and interruption for this channel.", "labels": ["Temporal"]}, {"id": 4209, "text": "Returns the METHOD_0 as a PRIMITIVE_0 after a widening primitive conversion.", "labels": ["Other"]}, {"id": 4210, "text": "If this method returns false, this Component is inheriting its background color from an ancestor.", "labels": ["Other"]}, {"id": 4211, "text": "See the note in METHOD_3 for more information.", "labels": ["Other"]}, {"id": 4212, "text": "If the selection mode is FIELD_2, then all paths are used.", "labels": ["Other"]}, {"id": 4213, "text": "This will return true if PARAMETER_0 is non-null and actionPerformed is invoked on it.", "labels": ["Other"]}, {"id": 4214, "text": "Checks if this date-time is equal to another date-time, including the chronology.", "labels": ["Other"]}, {"id": 4215, "text": "If the underlying keystore implementation is of type METHOD_1, PARAMETER_0 must be encoded as an CLASS_0 as defined in the PKCS #8 standard.", "labels": ["Guard"]}, {"id": 4216, "text": "Returns the minimum value recorded, or FIELD_0 if no values have been recorded.", "labels": ["Other"]}, {"id": 4217, "text": "If this module is an automatic module then the set of exports is empty.", "labels": ["Other"]}, {"id": 4218, "text": "If this object was loaded by the bootstrap class loader, the method delegates to METHOD_2.", "labels": ["Other"]}, {"id": 4219, "text": "The array contains the color components in the order specified by the CLASS_0, followed by the alpha component, if present.", "labels": ["Other"]}, {"id": 4220, "text": "If the application prefers high bandwidth above low latency, and low latency above short connection time, then it could invoke this method with the values (0, 1, 2).", "labels": ["Other"]}, {"id": 4221, "text": "Determine if this method is synchronized.", "labels": ["Other"]}, {"id": 4222, "text": "Note, however, that while some implementations may instantiate different types of CLASS_1 objects supporting additional features than the \"Core\", such as \"HTML\" [DOM Level 2 HTML] , based on the CLASS_0 specified at creation time, changing it afterwards is very unlikely to result in a change of the features supported.", "labels": ["Other"]}, {"id": 4223, "text": "Returns the currently set Authenticator for this context if one exists.", "labels": ["Other"]}, {"id": 4224, "text": "The exception handler is notified when this stream catches recoverable exceptions.", "labels": ["Other"]}, {"id": 4225, "text": "Calls METHOD_0 on the registered CLASS_0 and passes it the specified CLASS_1 if this CLASS_2 is active.", "labels": ["Other"]}, {"id": 4226, "text": "All packages in the set of package names that are not in the module are added to module.", "labels": ["Other"]}, {"id": 4227, "text": "A resource name with the name \"FIELD_0\" is never encapsulated because \"FIELD_1\" is not a legal package name.", "labels": ["Other"]}, {"id": 4228, "text": "It will always create a CLASS_0 with that number of buffers.", "labels": ["Other"]}, {"id": 4229, "text": "Returns the value of this VM option at the time when this CLASS_0 was created.", "labels": ["Other"]}, {"id": 4230, "text": "The stream will not be buffered, and it will not support the METHOD_0 or METHOD_1 methods.", "labels": ["Other"]}, {"id": 4231, "text": "If the object is found in this vector, each component in the vector with an index greater or equal to the object's index is shifted downward to have an index one smaller than the value it had previously.", "labels": ["Other"]}, {"id": 4232, "text": "If the maximum size has not been set explicitly by METHOD_0 and the CLASS_0 installed on this CLASS_1 is an instance of CLASS_2, then METHOD_1 is used to calculate the maximum size.", "labels": ["Other"]}, {"id": 4233, "text": "When using a normalized transform for converting user space coordinates to device space coordinates 72 user space units equal 1 inch in device space.", "labels": ["Other"]}, {"id": 4234, "text": "The exact format of the string is unspecified and the string may be null.", "labels": ["Other"]}, {"id": 4235, "text": "CLASS_0 is returned if specified factory class name supports the specified schema language.", "labels": ["Other"]}, {"id": 4236, "text": "If edits need to be discarded to shrink the limit, METHOD_0 will be invoked on them in the reverse order they were added.", "labels": ["Other"]}, {"id": 4237, "text": "Return true if the end tag can be omitted.", "labels": ["Other"]}, {"id": 4238, "text": "Null is returned if the value is absent from the response sent by the LDAP server.", "labels": ["Other"]}, {"id": 4239, "text": "Determines whether the CLASS_0 is set to use a continuous layout.", "labels": ["Other"]}, {"id": 4240, "text": "The given PARAMETER_1 function is applied after the given subscriber's METHOD_3 has been invoked.", "labels": ["Other"]}, {"id": 4241, "text": "Use METHOD_4 to determine if the redefinition can change the schema, delete methods, change the class hierarchy, etc.", "labels": ["Other"]}, {"id": 4242, "text": "Return true if this Font contains attributes that require extra layout processing.", "labels": ["Other"]}, {"id": 4243, "text": "A PARAMETER_0 value of null is invalid and returns null.", "labels": ["Other"]}, {"id": 4244, "text": "Any other error returned by the KDC will also cause this method to fail.", "labels": ["Other"]}, {"id": 4245, "text": "Otherwise, the filename argument is mapped to a native library image in an implementation-dependent manner.", "labels": ["Other"]}, {"id": 4246, "text": "If multiple lookup services each specify a default, the chosen service is not precisely defined, but a platform native service, rather than an installed service, is usually returned as the default.", "labels": ["Other"]}, {"id": 4247, "text": "Other CLASS_3 values will throw an exception.", "labels": ["Exception"]}, {"id": 4248, "text": "If another thread has already initiated a write operation upon this Connection then a subsequent invocation of this method will block until the first operation is complete.", "labels": ["Other"]}, {"id": 4249, "text": "This method is useful when the digest value of a CLASS_0 has been previously computed.", "labels": ["Other"]}, {"id": 4250, "text": "If the file is a directory and can be opened successfully, entries in the directory, and their descendants will follow the directory in the stream as they are encountered.", "labels": ["Other"]}, {"id": 4251, "text": "Otherwise, the resulting fixed-arity method handle has the same type and behavior of the current method handle, except that METHOD_1 will be false.", "labels": ["Other"]}, {"id": 4252, "text": "If the invoked method completes normally, the value it returns is copied in the METHOD_2 property.", "labels": ["Other"]}, {"id": 4253, "text": "Determines if the search results have been successfully sorted.", "labels": ["Other"]}, {"id": 4254, "text": "This method returns without blocking; it does not wait for the shift to complete.", "labels": ["Other"]}, {"id": 4255, "text": "Tests if the substring of this string beginning at the specified index starts with the specified prefix.", "labels": ["Other"]}, {"id": 4256, "text": "Invoked when a window is iconified.", "labels": ["Other"]}, {"id": 4257, "text": "If the recorded values contain one or more infinities, the sum will be infinite or NaN.", "labels": ["Other"]}, {"id": 4258, "text": "It is possible that the underlying synthesizer does not support muting channels.", "labels": ["Other"]}, {"id": 4259, "text": "The key set is not directly modifiable.", "labels": ["Other"]}, {"id": 4260, "text": "Otherwise, the exception thrown by METHOD_1 is thrown by this method.", "labels": ["Other"]}, {"id": 4261, "text": "When two values represent the same instant, the local date-time is compared to distinguish them.", "labels": ["Other"]}, {"id": 4262, "text": "If the first week starts after the start of the year then the period before is in the last week of the previous year.", "labels": ["Other"]}, {"id": 4263, "text": "If no such element exists, this returns null .", "labels": ["Other"]}, {"id": 4264, "text": "Ideally, only a single MIME type would be required in order to describe a particular format.", "labels": ["Other"]}, {"id": 4265, "text": "Moves to this CLASS_0 object's next result, returns true if it is a CLASS_1 object, and implicitly closes any current CLASS_1 object(s) obtained with the method METHOD_0.", "labels": ["Other"]}, {"id": 4266, "text": "Also, any event listeners that are registered with this CLASS_0 object must not have scope over the new CLASS_1 object.", "labels": ["Other"]}, {"id": 4267, "text": "This is implemented to fill the row by repeatedly calling the createView method until the available span has been exhausted, a forced break was encountered, or the createView method returned null.", "labels": ["Other"]}, {"id": 4268, "text": "For undo/redo updates it is always moved to the position where update occurred.", "labels": ["Other"]}, {"id": 4269, "text": "The METHOD_0 method for class CLASS_0 implements the most discriminating possible equivalence relation on objects; that is, for any non-null reference values METHOD_1 and METHOD_3, this method returns true if and only if METHOD_1 and METHOD_3 refer to the same object (METHOD_10 has the value true).", "labels": ["Other"]}, {"id": 4270, "text": "Note that because the numbering of elements in an array starts at zero, the array element that corresponds to placeholder parameter number parameterIndex is element number parameterIndex -1.", "labels": ["Other"]}, {"id": 4271, "text": "The driver calls this method on all CLASS_0s registered on the connection when it detects that a CLASS_1 is closed.", "labels": ["Other"]}, {"id": 4272, "text": "If this dialog is modal and blocks some windows, then all of them are also sent to the back to keep them below the blocking dialog.", "labels": ["Other"]}, {"id": 4273, "text": "Implementation Considerations The current thread is assumed to hold the lock associated with this CLASS_0 when this method is called.", "labels": ["Other"]}, {"id": 4274, "text": "This operation is likely to be expensive and should be used sparingly.", "labels": ["Other"]}, {"id": 4275, "text": "Sets the minimum to n after ensuring that n that the other three properties obey the model's constraints: minimum <= value <= value+extent <= maximum", "labels": ["Other"]}, {"id": 4276, "text": "Method setLocator sets an instance of a SourceLocator object that specifies where an error occurred.", "labels": ["Other"]}, {"id": 4277, "text": "METHOD_4 and METHOD_5 always throw CLASS_1.", "labels": ["Exception"]}, {"id": 4278, "text": "Returns the leaf before this node or null if this node is the first leaf in the tree.", "labels": ["Other"]}, {"id": 4279, "text": "If the suffix is too long then it too will be truncated, but if it begins with a period character ('.')", "labels": ["Other"]}, {"id": 4280, "text": "If the painter carries state it can create another painter to represent a new GlyphView that is being created.", "labels": ["Other"]}, {"id": 4281, "text": "If the alpha value of the argument of this method is equal to 0, the background is not painted at all.", "labels": ["Other"]}, {"id": 4282, "text": "Returns true if the attribute described by this CLASS_0 instance is writable, false otherwise.", "labels": ["Other"]}, {"id": 4283, "text": "If the protocol of this URL is \"jar\", then the permission granted is based on the permission that is required by the URL of the Jar file.", "labels": ["Other"]}, {"id": 4284, "text": "If the array contains multiple elements equal to the specified object, there is no guarantee which one will be found.", "labels": ["Other"]}, {"id": 4285, "text": "If the alpha value is 0, the color values are 0.", "labels": ["Other"]}, {"id": 4286, "text": "Sets whether this ContainerOrderFocusTraversalPolicy transfers focus down-cycle implicitly.", "labels": ["Other"]}, {"id": 4287, "text": "Returns the exception that was raised if an error occurred while attempting to load the class.", "labels": ["Other"]}, {"id": 4288, "text": "Note, this is the bytes that are encoded as an OCTET STRING.", "labels": ["Other"]}, {"id": 4289, "text": "When formatting, if the temporal object contains an instant, then it will be converted to a zoned date-time using the override zone.", "labels": ["Other"]}, {"id": 4290, "text": "Indicates whether or not the value was truncated on a read.", "labels": ["Other"]}, {"id": 4291, "text": "Returns true if and only if all of the following statements are true: obj is non null, obj also implements the CLASS_0 interface, their names are equal their open types are equal their access properties (isReadable, isWritable and isIs) are equal their default, min, max and legal values are equal.", "labels": ["Other"]}, {"id": 4292, "text": "The returned index is the largest value METHOD_0 for which: k <= Math.min(fromIndex, this.length()) && this.startsWith(str, k) If no such value of METHOD_0 exists, then -1 is returned.", "labels": ["Other"]}, {"id": 4293, "text": "Receives notification when the state of a recording changes.", "labels": ["Other"]}, {"id": 4294, "text": "Retrieves whether this database supports using columns not included in the FIELD_0 statement in a FIELD_1 clause provided that all of the columns in the FIELD_0 statement are included in the FIELD_1 clause.", "labels": ["Other"]}, {"id": 4295, "text": "Note: event listener use is not recommended for normal application use, but are intended solely to support special purpose facilities including support for accessibility, event record/playback, and diagnostic tracing.", "labels": ["Other"]}, {"id": 4296, "text": "If PARAMETER_0 is false, the iterator will return all of the server provider objects in an arbitrary order.", "labels": ["Other"]}, {"id": 4297, "text": "If a default context was set using the METHOD_0 method, it is returned.", "labels": ["Other"]}, {"id": 4298, "text": "A return of true reported a sufficient period after shutdown may indicate that submitted tasks have ignored or suppressed interruption, causing this executor not to properly terminate.", "labels": ["Other"]}, {"id": 4299, "text": "If so, the method calls the security manager's METHOD_2 method with the corresponding permission to ensure that the access to the image is allowed.", "labels": ["Other"]}, {"id": 4300, "text": "If this is invoked to output a newline, the current line length will need to be reset as will no longer be valid.", "labels": ["Other"]}, {"id": 4301, "text": "The method is only called when the input method is active.", "labels": ["Other"]}, {"id": 4302, "text": "This method should return an array of the same length as that passed in, and if one of the CLASS_1 in METHOD_0 is not valid its entry in the array should be set to -1.", "labels": ["Other"]}, {"id": 4303, "text": "Returns the lub of an exception parameter declared in a catch clause.", "labels": ["Other"]}, {"id": 4304, "text": "If the object name given is null, the MBean must provide its own name by implementing the CLASS_1 interface and returning the name from the METHOD_0 method.", "labels": ["Other"]}, {"id": 4305, "text": "It becomes unavailable when it is in the FIELD_0 state, typically after a call to METHOD_0.", "labels": ["Other"]}, {"id": 4306, "text": "If the current boundary is the last text boundary, it returns FIELD_0 and the iterator's current position is unchanged.", "labels": ["Other"]}, {"id": 4307, "text": "In other words, the byte that specifies the type of CLASS_0 is not considered a data byte.", "labels": ["Other"]}, {"id": 4308, "text": "Retrieves whether for the given type of CLASS_0 object, the result set's own updates are visible.", "labels": ["Other"]}, {"id": 4309, "text": "Gets the BeanContextChild (if any) of the specified child", "labels": ["Other"]}, {"id": 4310, "text": "Care must be taken that the CLASS_0 is not shared with untrusted code.", "labels": ["Other"]}, {"id": 4311, "text": "When two values represent the same instant, the local time is compared to distinguish them.", "labels": ["Other"]}, {"id": 4312, "text": "If this component does not have a CLASS_0 assigned to it and METHOD_0 is true, this will return METHOD_1 (assuming the parent is valid.)", "labels": ["Other"]}, {"id": 4313, "text": "If all of the children of this object implement CLASS_0, then this method should return the number of children of this object.", "labels": ["Other"]}, {"id": 4314, "text": "A writer that does not support insertion of empty images may return false without performing bounds checking on the index.", "labels": ["Other"]}, {"id": 4315, "text": "Renders the echo character, or whatever graphic should be used to display the password characters.", "labels": ["Other"]}, {"id": 4316, "text": "JList.VERTICAL_WRAP If the visible row count is greater than zero, the preferredHeight is the maximum cell height * visibleRowCount.", "labels": ["Other"]}, {"id": 4317, "text": "Gets the color displayed when over a docking area", "labels": ["Other"]}, {"id": 4318, "text": "This happens automatically if the preferences have changed for any of the child views.", "labels": ["Other"]}, {"id": 4319, "text": "This method is called when the user wants to maximize the frame.", "labels": ["Other"]}, {"id": 4320, "text": "If dest is null, a new array is allocated.", "labels": ["Other"]}, {"id": 4321, "text": "Note: All the data in the returned stream must be read prior to getting the value of any other column.", "labels": ["Other"]}, {"id": 4322, "text": "Log a FINER message, which is only to be constructed if the logging level is such that the message will actually be logged.", "labels": ["Other"]}, {"id": 4323, "text": "Retrieves whether a value stored in the designated column is automatically numbered, and thus readonly.", "labels": ["Other"]}, {"id": 4324, "text": "If the recording is already closed, invoking this method has no effect.", "labels": ["Other"]}, {"id": 4325, "text": "If the given URI is already absolute, or if this URI is opaque, then the given URI is returned.", "labels": ["Other"]}, {"id": 4326, "text": "If PARAMETER_0 is not a primitive array of type METHOD_0, a CLASS_0 is thrown.", "labels": ["Exception"]}, {"id": 4327, "text": "Get the system identifier of the entity where the exception occurred.", "labels": ["Other"]}, {"id": 4328, "text": "If the given Collection contains duplicate elements, an arbitrary element of the duplicates is preserved.", "labels": ["Other"]}, {"id": 4329, "text": "Tests if the memory usage of this memory pool after the most recent collection on which the Java virtual machine has expended effort has reached or exceeded its collection usage threshold.", "labels": ["Other"]}, {"id": 4330, "text": "Tests whether or not a display, keyboard, and mouse can be supported in this environment.", "labels": ["Other"]}, {"id": 4331, "text": "If none of the above are true, METHOD_0 returns false.", "labels": ["Other"]}, {"id": 4332, "text": "This implementation updates the background of the text component if the editable and/or enabled state changes.", "labels": ["Other"]}, {"id": 4333, "text": "Otherwise, this method copies PARAMETER_0 floats from this buffer into the given array, starting at the current position of this buffer and at the given offset in the array.", "labels": ["Other"]}, {"id": 4334, "text": "Indicates whether a specified feature is supported.", "labels": ["Other"]}, {"id": 4335, "text": "If this class represents an array type then this method returns the CLASS_0 for the element type.", "labels": ["Other"]}, {"id": 4336, "text": "If the field has no textual representation, then the numeric value will be used.", "labels": ["Other"]}, {"id": 4337, "text": "Note: this method returns the value that was set programmatically; it does not reflect support at the level of the operating system or window manager for dynamic layout on resizing, or the current operating system or window manager settings.", "labels": ["Other"]}, {"id": 4338, "text": "If the second argument is 1.0, then the result is the same as the first argument.", "labels": ["Other"]}, {"id": 4339, "text": "If the system property METHOD_4 is defined or it is defined in the file \"sound.properties\", it is used to retrieve the default source data line.", "labels": ["Other"]}, {"id": 4340, "text": "The CLASS_0 node this attribute is attached to or null if this attribute is not in use.", "labels": ["Other"]}, {"id": 4341, "text": "Otherwise the METHOD_0 equals the viewport's width or height.", "labels": ["Other"]}, {"id": 4342, "text": "Returns the index of the last occurrence of the specified element in this vector, or -1 if this vector does not contain the element.", "labels": ["Other"]}, {"id": 4343, "text": "Returns the actual or expected stop time of the recording associated with this CLASS_0, measured as ms since epoch, or null if the expected or actual stop time is not known, which can only happen if the recording has not yet been stopped.", "labels": ["Other"]}, {"id": 4344, "text": "As a side-effect, forces any changes in the contents of this preference node and its descendants to the persistent store, as if the METHOD_1 method had been invoked on this node.", "labels": ["Other"]}, {"id": 4345, "text": "When the cell is not valid the PARAMETER_2 parameter is ignored.", "labels": ["Other"]}, {"id": 4346, "text": "Again, while a return value of true indicates that the request is likely to succeed, developers must never assume that this Component is the focus owner until this Component receives a FOCUS_GAINED event.", "labels": ["Other"]}, {"id": 4347, "text": "Otherwise, the first byte read is stored into element METHOD_1, the next one into METHOD_2, and so on.", "labels": ["Other"]}, {"id": 4348, "text": "The value is true if the bit with the index PARAMETER_0 is currently set in this CLASS_0; otherwise, the result is false.", "labels": ["Other"]}, {"id": 4349, "text": "Called by a subclass when a client connection is closed normally.", "labels": ["Other"]}, {"id": 4350, "text": "This method is not called unless key events are enabled for the CLASS_0 objects, this FIELD_0 is set to.", "labels": ["Other"]}, {"id": 4351, "text": "If true, an underline should be drawn through the baseline.", "labels": ["Other"]}, {"id": 4352, "text": "A value is a fixed point of a one-argument method if and only if the result of applying the method to the value is equal to the value.)", "labels": ["Other"]}, {"id": 4353, "text": "AuthorityKeyIdentifier ::= SEQUENCE { keyIdentifier [0] KeyIdentifier OPTIONAL, authorityCertIssuer [1] GeneralNames OPTIONAL, authorityCertSerialNumber [2] CertificateSerialNumber OPTIONAL } KeyIdentifier ::= OCTET STRING Authority key identifiers are not parsed by the CLASS_1.", "labels": ["Other"]}, {"id": 4354, "text": "The exact meaning is determined by the chronology with the constraint that a leap-year must imply a year-length longer than a non leap-year.", "labels": ["Other"]}, {"id": 4355, "text": "This method adds the specified amount to the months field in three steps: Add the input months to the month-of-year field Check if the resulting date would be invalid Adjust the day-of-month to the last valid day if necessary For example, 2007-03-31 plus one month would result in the invalid date 2007-04-31.", "labels": ["Other"]}, {"id": 4356, "text": "If METHOD_0 is called after calling an updater method, but before calling the method METHOD_1, then the updates made to the row are lost.", "labels": ["Temporal"]}, {"id": 4357, "text": "In such cases it is recommended that the bytes be passed in directly to the overloaded form of this method METHOD_0.", "labels": ["Other"]}, {"id": 4358, "text": "Invoked when the contents of the underlying model have completely changed.", "labels": ["Other"]}, {"id": 4359, "text": "In either case, if this channel's file position is greater than the given size then it is set to that size.", "labels": ["Other"]}, {"id": 4360, "text": "After that point, this method returns the same value for the duration of the current decoding operation.", "labels": ["Other"]}, {"id": 4361, "text": "Note: Calling the method METHOD_0 may be expensive because the JDBC driver might need to fetch ahead one row in order to determine whether the current row is the last row in the result set.", "labels": ["Other"]}, {"id": 4362, "text": "Returns true if the next token in this scanner's input can be interpreted as a CLASS_0 in the default radix using the METHOD_0 method.", "labels": ["Other"]}, {"id": 4363, "text": "Most applications should use this method for parsing.", "labels": ["Other"]}, {"id": 4364, "text": "This method should return the METHOD_0 used to paint the receiving element.", "labels": ["Other"]}, {"id": 4365, "text": "If no GC information is available, null is returned.", "labels": ["Other"]}, {"id": 4366, "text": "Two non-null arrays, PARAMETER_0 and PARAMETER_1 with specified ranges [PARAMETER_2, METHOD_0) and [PARAMETER_3, METHOD_1) respectively, share a proper if the following expression is true: (aToIndex - aFromIndex) != (bToIndex - bFromIndex) && Arrays.equals(a, 0, Math.min(aToIndex - aFromIndex, bToIndex - bFromIndex), b, 0, Math.min(aToIndex - aFromIndex, bToIndex - bFromIndex))", "labels": ["Other"]}, {"id": 4367, "text": "The scope_id is not checked to determine if it corresponds to any interface on the system.", "labels": ["Other"]}, {"id": 4368, "text": "Note: Closing a socket doesn't clear its binding state, which means this method will return true for a closed socket (see METHOD_0) if it was successfully bound prior to being closed.", "labels": ["Other"]}, {"id": 4369, "text": "The common case is the target method takes no arguments, in which case a value of null should be used for the PARAMETER_2.", "labels": ["Other"]}, {"id": 4370, "text": "This is usually called after the JInternalFrame's IS_SELECTED_PROPERTY has been set to false.", "labels": ["Other"]}, {"id": 4371, "text": "Instead all MenuElements should call this method with the event.", "labels": ["Other"]}, {"id": 4372, "text": "Thus, in the last example, even though $trans1_foo is not a native method, the $trans1_ prefix is applied since $trans1_foo exists.", "labels": ["Other"]}, {"id": 4373, "text": "Modifying this node's child array invalidates any child enumerations created before the modification.", "labels": ["Other"]}, {"id": 4374, "text": "If the underlying field is static, the class that declared the field is initialized if it has not already been initialized.", "labels": ["Other"]}]