[{"id": 4375, "text": "true if this thread group is a daemon thread group; false otherwise.", "labels": ["Other"]}, {"id": 4376, "text": "true if PARAMETER_0 is a valid value for the parameter described by this OpenMBeanAttributeInfoSupport instance, false otherwise.", "labels": ["Other"]}, {"id": 4377, "text": "true if there is a default value.", "labels": ["Other"]}, {"id": 4378, "text": "true if the CLASS_0 specified represents a METHOD_0 of METHOD_1 objects", "labels": ["Other"]}, {"id": 4379, "text": "true if \"offset\" is a boundary position, false otherwise.", "labels": ["Other"]}, {"id": 4380, "text": "The last exception thrown by the Appendable or null if no such exception exists.", "labels": ["Other"]}, {"id": 4381, "text": "true if editing can be started", "labels": ["Other"]}, {"id": 4382, "text": "true if the import can happen, false otherwise", "labels": ["Other"]}, {"id": 4383, "text": "true if this CLASS_0 represents a key release; false otherwise", "labels": ["Other"]}, {"id": 4384, "text": "true if the CLASS_0 exists, false otherwise", "labels": ["Other"]}, {"id": 4385, "text": "an array of CLASS_0s with an even length of at least two, or null.", "labels": ["Other"]}, {"id": 4386, "text": "a method handle testing whether its first argument is of the specified class or subclass.", "labels": ["Other"]}, {"id": 4387, "text": "the object fetched. The METHOD_3 operator should be used to determine the specific kind of object returned.", "labels": ["Temporal"]}, {"id": 4388, "text": "the uri bound to the given prefix or null if it is not bound", "labels": ["Other"]}, {"id": 4389, "text": "the maximum number of processors available to the virtual machine; never smaller than one", "labels": ["Other"]}, {"id": 4390, "text": "true if this memory pool supports usage threshold; false otherwise.", "labels": ["Other"]}, {"id": 4391, "text": "Returns an associated namespace prefix if found or null if none is found. If more than one prefix are associated to the namespace prefix, the returned namespace prefix is implementation dependent.", "labels": ["Other"]}, {"id": 4392, "text": "the weight, which should be a value between ForcedBreakWeight and BadBreakWeight.", "labels": ["Other"]}, {"id": 4393, "text": "the class, may be null if not a Java frame", "labels": ["Other"]}, {"id": 4394, "text": "a CLASS_0 based on this date-time with the seconds added, not null", "labels": ["Other"]}, {"id": 4395, "text": "true if there are edits to be redone", "labels": ["Other"]}, {"id": 4396, "text": "the date in Minguo calendar system, not null", "labels": ["Other"]}, {"id": 4397, "text": "a query that can obtain the zone ID of a temporal, not null", "labels": ["Other"]}, {"id": 4398, "text": "the responder's certificate, or null if not set", "labels": ["Other"]}, {"id": 4399, "text": "The child node before which the result nodes will be inserted.", "labels": ["Other"]}, {"id": 4400, "text": "a flag indicating whether this link is still valid with respect to the CLASS_0 it belongs to", "labels": ["Other"]}, {"id": 4401, "text": "true if the FIELD_0 instances created by this look and feel support client side decorations", "labels": ["Other"]}, {"id": 4402, "text": "true if this is an unnamed package and false otherwise", "labels": ["Other"]}, {"id": 4403, "text": "true if the specified CLASS_0 is compatible with this CLASS_1; false otherwise.", "labels": ["Other"]}, {"id": 4404, "text": "true if this CLASS_1 object is read-Only and thus not updatable; false otherwise", "labels": ["Other"]}, {"id": 4405, "text": "true if the menu is visible, else false", "labels": ["Other"]}, {"id": 4406, "text": "whether the event is significant for edit undo purposes", "labels": ["Other"]}, {"id": 4407, "text": "true if a cache file is needed by the output streams created by this service provider.", "labels": ["Other"]}, {"id": 4408, "text": "a string to be used to annotate the given class when it gets marshalled, or null", "labels": ["Other"]}, {"id": 4409, "text": "an object of the same type with the specified period added, not null", "labels": ["Other"]}, {"id": 4410, "text": "a CLASS_0 based on this date-time with the requested nanosecond, not null", "labels": ["Other"]}, {"id": 4411, "text": "The non-null string representation of this address.", "labels": ["Other"]}, {"id": 4412, "text": "true if there are more events, false otherwise", "labels": ["Other"]}, {"id": 4413, "text": "true if this attribute has an \"is\" getter.", "labels": ["Other"]}, {"id": 4414, "text": "the head of this queue, or null if the specified waiting time elapses before an element is present", "labels": ["Other"]}, {"id": 4415, "text": "the closest matching supported cursor size, or a dimension of 0,0 if the Toolkit implementation doesn't support custom cursors.", "labels": ["Other"]}, {"id": 4416, "text": "the new object or null. Always returns null if GraphicsEnvironment.isHeadless() returns true.", "labels": ["Other"]}, {"id": 4417, "text": "the component after", "labels": ["Other"]}, {"id": 4418, "text": "The PasswordAuthentication collected from the user, or null if none is provided.", "labels": ["Other"]}, {"id": 4419, "text": "true if grouping is used; false otherwise", "labels": ["Other"]}, {"id": 4420, "text": "true if there is at least one waiting consumer", "labels": ["Other"]}, {"id": 4421, "text": "true if the specified Object is equal to this Map", "labels": ["Other"]}, {"id": 4422, "text": "true if the line is open, otherwise false", "labels": ["Other"]}, {"id": 4423, "text": "the fully-qualified name of the class in the Java programming language that would be used by the method CLASS_3 to retrieve the value in the specified column. This is the class name used for custom mapping when there is a custom mapping.", "labels": ["Other"]}, {"id": 4424, "text": "the amount of virtual memory that is guaranteed to be available to the running process in bytes, or -1 if this operation is not supported.", "labels": ["Other"]}, {"id": 4425, "text": "a CLASS_0 based on this date with the days added, not null", "labels": ["Other"]}, {"id": 4426, "text": "true if the tree root is visible", "labels": ["Other"]}, {"id": 4427, "text": "a Java input stream that delivers the database column value as a stream of one-byte ASCII characters; if the value is SQL FIELD_1, the value returned is null", "labels": ["Other"]}, {"id": 4428, "text": "the AccessibleText, or null", "labels": ["Other"]}, {"id": 4429, "text": "true if the method is a constructor; false otherwise.", "labels": ["Other"]}, {"id": 4430, "text": "true if the given access mode is supported, otherwise false.", "labels": ["Other"]}, {"id": 4431, "text": "true if the specified permission is implied by this object, false if not.", "labels": ["Other"]}, {"id": 4432, "text": "an object that uniquely identifies the given file, or null", "labels": ["Other"]}, {"id": 4433, "text": "The \"unit\" increment for scrolling in the specified direction. This value should always be positive.", "labels": ["Other"]}, {"id": 4434, "text": "the axis along which views should be flowed", "labels": ["Other"]}, {"id": 4435, "text": "whether to update the selection on a sort", "labels": ["Other"]}, {"id": 4436, "text": "a CLASS_1 of names (or null)", "labels": ["Other"]}, {"id": 4437, "text": "the other file (can be null)", "labels": ["Other"]}, {"id": 4438, "text": "true if the duration represented by this object is longer than the given duration. false otherwise.", "labels": ["Other"]}, {"id": 4439, "text": "a CLASS_0 object representing the type that this type is a member of. If this type is a top-level type, null is returned", "labels": ["Other"]}, {"id": 4440, "text": "the screen coordinates of the character's bounding box, if index is invalid return an empty rectangle.", "labels": ["Other"]}, {"id": 4441, "text": "the package elements, or an empty set if no package with the name can be found", "labels": ["Other"]}, {"id": 4442, "text": "the value to which the key had previously been mapped in this CLASS_0 object, or null if the key did not have a mapping.", "labels": ["Other"]}, {"id": 4443, "text": "the unknown type, or null if unavailable", "labels": ["Other"]}, {"id": 4444, "text": "true if this object is now in a fully released state, so that any waiting threads may attempt to acquire; and false otherwise.", "labels": ["Other"]}, {"id": 4445, "text": "the chronology, not null", "labels": ["Other"]}, {"id": 4446, "text": "true if this is a Java frame, false otherwise", "labels": ["Other"]}, {"id": 4447, "text": "true if the current value being edited is valid.", "labels": ["Other"]}, {"id": 4448, "text": "the index of the first occurrence of the specified element in this vector, or -1 if this vector does not contain the element", "labels": ["Other"]}, {"id": 4449, "text": "an array of all objects registered as CLASS_0s on this checkbox, or an empty array if no such listeners have been added", "labels": ["Other"]}, {"id": 4450, "text": "true if this database uses a local file for each table; false otherwise", "labels": ["Other"]}, {"id": 4451, "text": "the full-screen window, or null if the device is not in full-screen mode.", "labels": ["Other"]}, {"id": 4452, "text": "true if scroll mode is a FIELD_0.", "labels": ["Other"]}, {"id": 4453, "text": "True if the propertyEditor can provide a custom editor.", "labels": ["Other"]}, {"id": 4454, "text": "true if and only if this parameter is a synthetic construct as defined by The Java™ Language Specification.", "labels": ["Other"]}, {"id": 4455, "text": "a CLASS_0 containing the node dimensions, or null if node has no dimension", "labels": ["Other"]}, {"id": 4456, "text": "whether this ClassDesc describes an array type", "labels": ["Other"]}, {"id": 4457, "text": "the parsed duration, not null", "labels": ["Other"]}, {"id": 4458, "text": "the Tab instance after PARAMETER_0", "labels": ["Other"]}, {"id": 4459, "text": "the parsed temporal object, not null", "labels": ["Other"]}, {"id": 4460, "text": "false if no remaining elements existed upon entry to this method, else true.", "labels": ["Other"]}, {"id": 4461, "text": "true if this is a ligature glyph; false otherwise.", "labels": ["Other"]}, {"id": 4462, "text": "true if the role is readable.", "labels": ["Other"]}, {"id": 4463, "text": "the URI bound to this elements prefix, the default namespace, or null", "labels": ["Other"]}, {"id": 4464, "text": "the response code, if available. -1 if not available yet.", "labels": ["Other"]}, {"id": 4465, "text": "true if the service is newly registered; false otherwise", "labels": ["Other"]}, {"id": 4466, "text": "an CLASS_0 based on this time with the addition made, not null", "labels": ["Other"]}, {"id": 4467, "text": "true if integrity services are available, false otherwise.", "labels": ["Other"]}, {"id": 4468, "text": "true if the content model could match an empty input stream", "labels": ["Other"]}, {"id": 4469, "text": "true if the specified object is equal to this control type; false otherwise", "labels": ["Other"]}, {"id": 4470, "text": "The new node, or null if the current node has no next node in the CLASS_0's logical view.", "labels": ["Other"]}, {"id": 4471, "text": "whether or not a volatile image is subject to losing its surfaces at the whim of the operating system.", "labels": ["Other"]}, {"id": 4472, "text": "returns the leaf before this node", "labels": ["Other"]}, {"id": 4473, "text": "the maximum CRL number accepted (or null)", "labels": ["Other"]}, {"id": 4474, "text": "a CLASS_0 or null if this CLASS_1 has no alpha channel associated with its CLASS_2.", "labels": ["Other"]}, {"id": 4475, "text": "the value of this variable if this is a METHOD_0 field initialized to a compile-time constant, or null otherwise", "labels": ["Other"]}, {"id": 4476, "text": "a read-only iterator over the set of mappings", "labels": ["Other"]}, {"id": 4477, "text": "true if the given date is in Daylight Saving Time, false, otherwise.", "labels": ["Other"]}, {"id": 4478, "text": "a formatter based on this formatter with the requested override chronology, not null", "labels": ["Other"]}, {"id": 4479, "text": "true if this type component was declared final; false otherwise.", "labels": ["Other"]}, {"id": 4480, "text": "a list containing a CLASS_0 object for each argument to this frame, in the order in which the arguments were declared. If the method corresponding to this frame has no arguments, an empty list is returned.", "labels": ["Other"]}, {"id": 4481, "text": "number of units to scroll, or an undefined value if METHOD_0 returns FIELD_1", "labels": ["Other"]}, {"id": 4482, "text": "true if the data can be inserted into the component, false otherwise", "labels": ["Other"]}, {"id": 4483, "text": "a CLASS_0 based on this duration with the time truncated, not null", "labels": ["Other"]}, {"id": 4484, "text": "if the keytab is bound to a principal", "labels": ["Other"]}, {"id": 4485, "text": "the CLASS_0 CLASS_1 for this entry, or null if none", "labels": ["Other"]}, {"id": 4486, "text": "an array of CLASS_0s of length at least 1 containing names of CLASS_1, or null.", "labels": ["Other"]}, {"id": 4487, "text": "an CLASS_0 that is the union of the given descriptors. The returned object may be identical to one of the input descriptors if it is an ImmutableDescriptor that contains all of the required fields.", "labels": ["Other"]}, {"id": 4488, "text": "true if the arc contains the angle, false if the arc doesn't contain the angle.", "labels": ["Other"]}, {"id": 4489, "text": "true if the factory is configured to produce parsers which validate the XML content during parse; false otherwise.", "labels": ["Other"]}, {"id": 4490, "text": "true if there is a maximum value.", "labels": ["Other"]}, {"id": 4491, "text": "the TIFFDirectory instance or null.", "labels": ["Other"]}, {"id": 4492, "text": "The module with the given name or an empty CLASS_0 if there isn't a module with this name in this layer or any parent layer", "labels": ["Other"]}, {"id": 4493, "text": "The non-null object representing PARAMETER_2's state for binding. It could be the object (PARAMETER_2) itself.", "labels": ["Other"]}, {"id": 4494, "text": "true if inserts made by others are visible for the given result set type; false otherwise", "labels": ["Other"]}, {"id": 4495, "text": "true if both Permission objects are equivalent.", "labels": ["Other"]}, {"id": 4496, "text": "true if this VM option is writeable; false otherwise.", "labels": ["Other"]}, {"id": 4497, "text": "true if visible else false", "labels": ["Other"]}, {"id": 4498, "text": "true if this CLASS_0 instance contains the specified row value.", "labels": ["Other"]}, {"id": 4499, "text": "the minimum recorded value, FIELD_0 if any recorded value was NaN or FIELD_1 if no values were recorded", "labels": ["Other"]}, {"id": 4500, "text": "true if thread CPU time measurement is enabled; false otherwise.", "labels": ["Other"]}, {"id": 4501, "text": "true if the soundbank is supported, otherwise false", "labels": ["Other"]}, {"id": 4502, "text": "true if this JarFile is a multi-release jar file", "labels": ["Other"]}, {"id": 4503, "text": "the parsed local time, not null", "labels": ["Other"]}, {"id": 4504, "text": "an immutable list of fully defined transitions, not null", "labels": ["Other"]}, {"id": 4505, "text": "a CLASS_0 based on this period with the requested period subtracted, not null", "labels": ["Other"]}, {"id": 4506, "text": "The non-null context at which to continue the method.", "labels": ["Other"]}, {"id": 4507, "text": "true if it is a dynamic method, false otherwise.", "labels": ["Other"]}, {"id": 4508, "text": "whether or not an enclosing viewport should force the list's height to match its own", "labels": ["Other"]}, {"id": 4509, "text": "true if the specified FIELD_1 intersects the interior of this FIELD_0; false otherwise.", "labels": ["Other"]}, {"id": 4510, "text": "the name of the given country code for the specified locale, or null if it's not available.", "labels": ["Other"]}, {"id": 4511, "text": "The CLASS_1, null if this channel is in non-blocking mode and no messages are immediately available or the notification handler returns FIELD_2 after handling a notification", "labels": ["Other"]}, {"id": 4512, "text": "true if the specified CLASS_0 equals this CLASS_1; false otherwise.", "labels": ["Other"]}, {"id": 4513, "text": "the result of executing the tool. A return value of 0 means the tool did not encounter any errors; any other value indicates that at least one error occurred during execution.", "labels": ["Other"]}, {"id": 4514, "text": "true if the date-time can be queried for this field, false if not", "labels": ["Other"]}, {"id": 4515, "text": "the double value represented by the string associated with PARAMETER_0 in this preference node, or PARAMETER_1 if the associated value does not exist or cannot be interpreted as a double.", "labels": ["Other"]}, {"id": 4516, "text": "true if there are one or more listeners for the given property", "labels": ["Other"]}, {"id": 4517, "text": "true if PARAMETER_0 is equivalent to this resolution attribute, false otherwise", "labels": ["Other"]}, {"id": 4518, "text": "a method handle which delegates to the target after performing any necessary argument conversions, and arranges for any necessary return value conversions", "labels": ["Other"]}, {"id": 4519, "text": "the system load average; or a negative value if not available.", "labels": ["Other"]}, {"id": 4520, "text": "whether the row is selected", "labels": ["Other"]}, {"id": 4521, "text": "true if this date is equal to the specified date", "labels": ["Other"]}, {"id": 4522, "text": "unmodifiable set of printing attributes for this doc, or null to obtain all attribute values from the job's attribute set", "labels": ["Other"]}, {"id": 4523, "text": "true if the time-zone is fixed and the offset never changes", "labels": ["Other"]}, {"id": 4524, "text": "true if the base direction of this CLASS_0 is left-to-right; false otherwise.", "labels": ["Other"]}, {"id": 4525, "text": "true if thread contention monitoring is enabled; false otherwise.", "labels": ["Other"]}, {"id": 4526, "text": "true if the cursor points to character data, false otherwise", "labels": ["Other"]}, {"id": 4527, "text": "true if a CLASS_0 should be created when the model changes", "labels": ["Other"]}, {"id": 4528, "text": "true if this is a duplicate, false otherwise.", "labels": ["Other"]}, {"id": 4529, "text": "true if the provider was previously registered in the same category category, false otherwise.", "labels": ["Other"]}, {"id": 4530, "text": "True if the name is a property value pattern, otherwise false.", "labels": ["Other"]}, {"id": 4531, "text": "true if PARAMETER_0 is equivalent to this job media sheets completed attribute, false otherwise", "labels": ["Other"]}, {"id": 4532, "text": "true if the field is supported on this day-of-week, false if not", "labels": ["Other"]}, {"id": 4533, "text": "an array containing the accessible icon or a null array if none", "labels": ["Other"]}, {"id": 4534, "text": "true if this object is destroyed", "labels": ["Other"]}, {"id": 4535, "text": "true if the field exists, false otherwise.", "labels": ["Other"]}, {"id": 4536, "text": "an CLASS_0 based on this date-time with the addition made, not null", "labels": ["Other"]}, {"id": 4537, "text": "whether the two display modes are equal", "labels": ["Other"]}, {"id": 4538, "text": "true if a previously unset ordering was established.", "labels": ["Other"]}, {"id": 4539, "text": "a CLASS_0, or null if PARAMETER_0 is null", "labels": ["Other"]}, {"id": 4540, "text": "the index of the previous set bit, or -1 if there is no such bit", "labels": ["Other"]}, {"id": 4541, "text": "illegal characters.", "labels": ["Other"]}, {"id": 4542, "text": "the next byte of data, or -1 if the end of the stream is reached", "labels": []}, {"id": 4543, "text": "true if object contains CLASS_0; otherwise false", "labels": ["Other"]}, {"id": 4544, "text": "true if case is ignored; false otherwise.", "labels": ["Other"]}, {"id": 4545, "text": "1 before EOF and 0 after EOF has reached for current entry.", "labels": ["Other"]}, {"id": 4546, "text": "true if columns can be selected, otherwise false", "labels": ["Other"]}, {"id": 4547, "text": "The non-null buffer containing this address's contents.", "labels": ["Other"]}, {"id": 4548, "text": "true if the specified CLASS_0 is an instance of CLASS_1 and equals this CLASS_1; false otherwise.", "labels": ["Other"]}, {"id": 4549, "text": "the caret (a.k.a. insertion point). Null if there's no caret within current composed text.", "labels": ["Other"]}, {"id": 4550, "text": "true if an element was removed as a result of this call", "labels": ["Other"]}, {"id": 4551, "text": "whether the result blob of the same key has been generated successfully by this exemption mechanism; false if PARAMETER_0 is null.", "labels": ["Other"]}, {"id": 4552, "text": "true if the named file does not exist and was successfully created; false if the named file already exists", "labels": ["Other"]}, {"id": 4553, "text": "the total number of characters read into the buffer, or -1 if there is no more data because the end of the stream has been reached.", "labels": ["Other"]}, {"id": 4554, "text": "true if purges are immediate.", "labels": ["Other"]}, {"id": 4555, "text": "true if this date is in a leap year, false otherwise", "labels": ["Other"]}, {"id": 4556, "text": "true if the CLASS_0 specified represents a Serialized Object", "labels": ["Other"]}, {"id": 4557, "text": "true if the specified CLASS_0 contains the specified rectangular area; false otherwise.", "labels": ["Other"]}, {"id": 4558, "text": "true if PARAMETER_0 is a valid index and the column at that index is selected (where 0 is the first column)", "labels": ["Other"]}, {"id": 4559, "text": "whether or not the regular expression matches on the input", "labels": ["Other"]}, {"id": 4560, "text": "a string containing the generic signature, or null if there is no generic signature.", "labels": ["Other"]}, {"id": 4561, "text": "array of matching CLASS_1. If no services match, the array is zero-length.", "labels": ["Other"]}, {"id": 4562, "text": "true if this list contains all of the elements of the specified collection", "labels": ["Other"]}, {"id": 4563, "text": "true if PARAMETER_0 is equivalent to this text attribute, false otherwise", "labels": ["Other"]}, {"id": 4564, "text": "the first element of this deque, or null if this deque is empty", "labels": ["Other"]}, {"id": 4565, "text": "the fully qualified name of this class or interface, or an empty name if none", "labels": ["Other"]}, {"id": 4566, "text": "whether client authentication should be required.", "labels": ["Other"]}, {"id": 4567, "text": "true if, and only if, this decoder has detected a specific charset", "labels": ["Other"]}, {"id": 4568, "text": "whether the selection is currently empty", "labels": ["Other"]}, {"id": 4569, "text": "a set of permissions granted to the specified CodeSource. If this operation is supported, the returned set of permissions must be a new mutable instance and it must support heterogeneous Permission types. If this operation is not supported, Policy.UNSUPPORTED_EMPTY_COLLECTION is returned.", "labels": ["Other"]}, {"id": 4570, "text": "a graphics context for this component, or null if it has none", "labels": ["Other"]}, {"id": 4571, "text": "A Source object, or null if the href cannot be resolved, and the processor should try to resolve the URI itself.", "labels": ["Other"]}, {"id": 4572, "text": "false if the focus change request is guaranteed to fail; true if it is likely to succeed", "labels": ["Other"]}, {"id": 4573, "text": "a CLASS_0 to perform the GUI update; or null.", "labels": ["Other"]}, {"id": 4574, "text": "the index of the next set bit, or -1 if there is no such bit", "labels": ["Other"]}, {"id": 4575, "text": "true if and only if this CardPermission object implies the specified permission.", "labels": ["Other"]}, {"id": 4576, "text": "a CLASS_0 object that the property name describes, or null if no such property exists.", "labels": ["Other"]}, {"id": 4577, "text": "the name of the exception", "labels": ["Other"]}, {"id": 4578, "text": "true if the specified CLASS_0 and the interior of the specified FIELD_0 intersect each other; false otherwise.", "labels": ["Other"]}, {"id": 4579, "text": "true if the CLASS_0 is used", "labels": ["Other"]}, {"id": 4580, "text": "the new local-control value, or false if local control is not supported", "labels": ["Other"]}, {"id": 4581, "text": "The column number. Returns -1 if a column number is unavailable.", "labels": ["Other"]}, {"id": 4582, "text": "the attribute at the head of the stream as an CLASS_0 in the Java programming language;null if the attribute is SQL FIELD_0", "labels": ["Other"]}, {"id": 4583, "text": "this element's annotation for the specified annotation type if directly present on this element, else null", "labels": ["Other"]}, {"id": 4584, "text": "The raw authority component of this URI, or null if the authority is undefined", "labels": ["Other"]}, {"id": 4585, "text": "true if obj is a value for this open type, false otherwise.", "labels": ["Other"]}, {"id": 4586, "text": "this Container's focus traversal policy, or null if this Container is not a focus cycle root.", "labels": ["Other"]}, {"id": 4587, "text": "an array containing the values comprising the enum class represented by this Class object in the order they're declared, or null if this Class object does not represent an enum type", "labels": ["Other"]}, {"id": 4588, "text": "true if closed", "labels": ["Other"]}, {"id": 4589, "text": "A string representing the priority (e.g. \"important\") if the property has been explicitly set in this declaration block and has a priority specified. The empty string otherwise.", "labels": ["Other"]}, {"id": 4590, "text": "An CLASS_2, containing the CLASS_3 and the Java class name of the newly instantiated MBean. If the contained CLASS_3 is METHOD_2, the contained Java class name is METHOD_3.", "labels": ["Other"]}, {"id": 4591, "text": "true if the action should be performed with the sender object, must be false if the action is disabled.", "labels": ["Other"]}, {"id": 4592, "text": "a field providing access to the week-of-week-based-year, not null", "labels": ["Other"]}, {"id": 4593, "text": "true if this CLASS_1 represents the same sequence of char values as the specified sequence, false otherwise", "labels": ["Other"]}, {"id": 4594, "text": "the last child, as a CLASS_0, or null.", "labels": ["Other"]}, {"id": 4595, "text": "true if this CLASS_0 has been disposed; false otherwise", "labels": ["Other"]}, {"id": 4596, "text": "the year-month, not null", "labels": ["Other"]}, {"id": 4597, "text": "true if the event did not already exist in the track and was added, otherwise false", "labels": ["Other"]}, {"id": 4598, "text": "a ScheduledFuture representing pending completion of the series of repeated tasks. The future's METHOD_4 method will never return normally, and will throw an exception upon task cancellation or abnormal termination of a task execution.", "labels": ["Other"]}, {"id": 4599, "text": "A URL context for PARAMETER_0 or the cached initial context. The result cannot be null.", "labels": ["Other"]}, {"id": 4600, "text": "the password, which may be null", "labels": ["Other"]}, {"id": 4601, "text": "true if the editor allows the editing session to stop", "labels": ["Other"]}, {"id": 4602, "text": "The byte stream, or null if none was supplied.", "labels": ["Other"]}, {"id": 4603, "text": "true if the CLASS_0 will not consume anymore network data (and by implication, will not produce any more application data.)", "labels": ["Other"]}, {"id": 4604, "text": "true if this CLASS_0 indexes a row value with the specified key.", "labels": ["Other"]}, {"id": 4605, "text": "the Component that should receive the focus before aComponent, or null if no suitable Component can be found", "labels": ["Other"]}, {"id": 4606, "text": "true if the cursor has been explicitly set for this Component; false otherwise.", "labels": ["Other"]}, {"id": 4607, "text": "true if the METHOD_0 is lenient; false otherwise.", "labels": ["Other"]}, {"id": 4608, "text": "Returns true if the nodes are equal, false otherwise.", "labels": ["Other"]}, {"id": 4609, "text": "true if state is added to the state set; false if the state set is unchanged", "labels": ["Other"]}, {"id": 4610, "text": "true if this is an open module and false otherwise", "labels": ["Other"]}, {"id": 4611, "text": "true if this CLASS_0 can be executed; otherwise false", "labels": ["Other"]}, {"id": 4612, "text": "true if this LDAP name is empty, false otherwise.", "labels": ["Other"]}, {"id": 4613, "text": "an unmodifiable CLASS_0 of names (or null)", "labels": ["Other"]}, {"id": 4614, "text": "the expression for the case, or null", "labels": ["Other"]}, {"id": 4615, "text": "the name for this media size, or null if no name was associated with this size (an anonymous size)", "labels": ["Other"]}, {"id": 4616, "text": "the signature of the primary functional interface method after type variable processing", "labels": ["Other"]}, {"id": 4617, "text": "true if the socket successfully connected to a server", "labels": ["Other"]}, {"id": 4618, "text": "the first selected index or -1 if the selection is empty.", "labels": ["Other"]}, {"id": 4619, "text": "the stop time of recording, or null if recording hasn't been stopped.", "labels": ["Other"]}, {"id": 4620, "text": "true if this CLASS_0 object can be used to create surfaces that support the indicated features; false if the CLASS_0 can not be used to create a drawing surface usable by this Java(tm) API.", "labels": ["Other"]}, {"id": 4621, "text": "the non-negative number of array elements when deserializing an array of the class, otherwise -1", "labels": ["Other"]}, {"id": 4622, "text": "the recording copy, not null", "labels": ["Other"]}, {"id": 4623, "text": "true if this is a valid markup declaration; otherwise false", "labels": ["Other"]}, {"id": 4624, "text": "The matching element or null if there is none.", "labels": ["Other"]}, {"id": 4625, "text": "the CLASS_0 at the specified location, if it exists; otherwise null", "labels": ["Other"]}, {"id": 4626, "text": "the value or null.", "labels": ["Other"]}, {"id": 4627, "text": "true if the gap should be filled", "labels": ["Other"]}, {"id": 4628, "text": "a query that can obtain the time of a temporal, not null", "labels": ["Other"]}, {"id": 4629, "text": "true if, and only if, this encoder can encode the given character without throwing any exceptions and without performing any replacements", "labels": ["Other"]}, {"id": 4630, "text": "one of the values from 0 to METHOD_0 if support for the extended mouse buttons is METHOD_2 by Java. That range includes FIELD_0, CLASS_0, CLASS_1, CLASS_2; FIELD_0, CLASS_0, CLASS_1 or CLASS_2 if support for the extended mouse buttons is METHOD_1 by Java", "labels": ["Other"]}, {"id": 4631, "text": "The encapsulated exception, or null if there is none.", "labels": ["Other"]}, {"id": 4632, "text": "the value associated with PARAMETER_0, or PARAMETER_1 if no value is associated with PARAMETER_0.", "labels": ["Other"]}, {"id": 4633, "text": "true if the current JVM configuration supports setting a native method prefix, false if not.", "labels": ["Other"]}, {"id": 4634, "text": "a CLASS_0 based on this date-time with the weeks added, not null", "labels": ["Other"]}, {"id": 4635, "text": "The new, read-only float buffer", "labels": ["Other"]}, {"id": 4636, "text": "a CLASS_0 based on this date with the requested month, not null", "labels": ["Other"]}, {"id": 4637, "text": "true if the specified object is equal to this attribute set", "labels": ["Other"]}, {"id": 4638, "text": "Return the node that is the result of the parse operation. If the result is more than one top-level node, the first one is returned.", "labels": ["Other"]}, {"id": 4639, "text": "an CLASS_0 based on this time with the requested nanosecond, not null", "labels": ["Other"]}, {"id": 4640, "text": "the width of this image, or -1 if the width is not yet known.", "labels": ["Other"]}, {"id": 4641, "text": "true if this attribute set contains an attribute value for the specified category", "labels": ["Other"]}, {"id": 4642, "text": "true if an expected per-message token was not received, false otherwise.", "labels": ["Other"]}, {"id": 4643, "text": "the \"recent cpu usage\" for the Java Virtual Machine process; a negative value if not available.", "labels": ["Other"]}, {"id": 4644, "text": "a CLASS_0 based on this time with the addition made, not null", "labels": ["Other"]}, {"id": 4645, "text": "a new array containing the specified range from the original array, truncated or padded with null characters to obtain the required length", "labels": ["Other"]}, {"id": 4646, "text": "the system selection as a CLASS_0, or null if the native platform does not support a system selection CLASS_0", "labels": ["Other"]}, {"id": 4647, "text": "true if an empty image may be inserted at the given index.", "labels": ["Other"]}, {"id": 4648, "text": "the user principal name or null", "labels": ["Other"]}, {"id": 4649, "text": "the inner highlight CLASS_0 or null if no highlight color was specified", "labels": ["Other"]}, {"id": 4650, "text": "a CLASS_0 containing the tab bounds at PARAMETER_0, or null if tab at PARAMETER_0 is not currently visible in the UI, or if there is no UI set on this METHOD_0", "labels": ["Other"]}, {"id": 4651, "text": "true if this pool has been shut down", "labels": ["Other"]}, {"id": 4652, "text": "the total CPU time for a thread of the specified ID if the thread of the specified ID exists, the thread is alive, and CPU time measurement is enabled; -1 otherwise.", "labels": ["Other"]}, {"id": 4653, "text": "true if PARAMETER_0 is an instance of FIELD_0 and has the same values; false otherwise.", "labels": ["Other"]}, {"id": 4654, "text": "the value of the represented field in object PARAMETER_0; primitive values are wrapped in an appropriate object before being returned", "labels": ["Other"]}, {"id": 4655, "text": "True if the attribute can be written to, false otherwise.", "labels": ["Other"]}, {"id": 4656, "text": "the rules, not null", "labels": ["Other"]}, {"id": 4657, "text": "true if this is a qualified opens", "labels": ["Other"]}, {"id": 4658, "text": "true if the interior of the CLASS_0 entirely contains the FIELD_0; false otherwise or, if the CLASS_0 contains the FIELD_0 and the METHOD_3 method returns true and the containment calculations would be too expensive to perform.", "labels": ["Other"]}, {"id": 4659, "text": "the value, if present, otherwise PARAMETER_0", "labels": ["Other"]}, {"id": 4660, "text": "the minimum CRL number accepted (or null)", "labels": ["Other"]}, {"id": 4661, "text": "the required issuer distinguished name in RFC 2253 format (or null)", "labels": ["Other"]}, {"id": 4662, "text": "true if the argument is not null and it represents an equivalent CLASS_0 ignoring case; false otherwise", "labels": ["Other"]}, {"id": 4663, "text": "true if the component is valid, false otherwise", "labels": ["Other"]}, {"id": 4664, "text": "the head of this queue, or null if this queue has no elements with an expired delay", "labels": ["Other"]}, {"id": 4665, "text": "the time-zone unique ID, not null", "labels": ["Other"]}, {"id": 4666, "text": "true if the character sequence represented by the argument is a prefix of the character sequence represented by this string; false otherwise. Note also that true will be returned if the argument is an empty string or is equal to this CLASS_0 object as determined by the METHOD_0 method.", "labels": ["Other"]}, {"id": 4667, "text": "true if one or more parties broke out of this barrier due to interruption or timeout since construction or the last reset, or a barrier action failed due to an exception; false otherwise.", "labels": ["Other"]}, {"id": 4668, "text": "true if propagated, false if not", "labels": ["Other"]}, {"id": 4669, "text": "the server-socket channel associated with this socket, or null if this socket was not created for a channel", "labels": ["Other"]}, {"id": 4670, "text": "true if and only if this scanner's next token is a valid short value in the default radix", "labels": ["Other"]}, {"id": 4671, "text": "the CLASS_0 used to tile the border or null if a solid color is used to fill the border", "labels": ["Other"]}, {"id": 4672, "text": "The host component of this URI, or null if the host is undefined", "labels": ["Other"]}, {"id": 4673, "text": "the first tab which matches this component, or -1 if there is no tab for this component", "labels": ["Other"]}, {"id": 4674, "text": "the numeric value represented by this object after conversion to type PRIMITIVE_0.", "labels": ["Other"]}, {"id": 4675, "text": "this construct's annotations for the specified annotation type if present on this construct, else an empty array", "labels": ["Other"]}, {"id": 4676, "text": "the cause, or null if unknown", "labels": ["Other"]}, {"id": 4677, "text": "true if the state is in the state set; false if the state set will be unchanged", "labels": ["Other"]}, {"id": 4678, "text": "true if the writing of complete image stream with contents to be defined later is supported.", "labels": ["Other"]}, {"id": 4679, "text": "true if the Java virtual machine supports CPU time measurement for any thread; false otherwise.", "labels": ["Other"]}, {"id": 4680, "text": "false if the waiting time detectably elapsed before return from the method, else true", "labels": ["Other"]}, {"id": 4681, "text": "True if PARAMETER_0 matches this ObjectName.", "labels": ["Other"]}, {"id": 4682, "text": "the \"unit\" increment for scrolling in the specified direction; always positive", "labels": ["Other"]}, {"id": 4683, "text": "the exception that terminated the operation (the cause), which may be null.", "labels": ["Other"]}, {"id": 4684, "text": "true if this Print Service supports specifying PARAMETER_2 as a doc-level or job-level attribute in a Print Request, false if it doesn't", "labels": ["Other"]}, {"id": 4685, "text": "true if object contains point; otherwise false", "labels": ["Other"]}, {"id": 4686, "text": "all the installed providers that satisfy the selection criteria, or null if no such providers have been installed.", "labels": ["Other"]}, {"id": 4687, "text": "A CLASS_3 containing the object's state for binding and the corresponding attributes to be bound; null if the object don't use this factory.", "labels": ["Other"]}, {"id": 4688, "text": "Always return a non-null valid object.", "labels": ["Other"]}, {"id": 4689, "text": "true if there are any queued submissions", "labels": ["Other"]}, {"id": 4690, "text": "the calendar system type, null if the calendar is not defined by CLDR/LDML", "labels": ["Other"]}, {"id": 4691, "text": "true if thread memory allocation measurement is enabled; false otherwise.", "labels": ["Other"]}, {"id": 4692, "text": "a PRIMITIVE_0 indicating if the InetAddress is an IP multicast address", "labels": ["Other"]}, {"id": 4693, "text": "true if this is equal to the other year-month", "labels": ["Other"]}, {"id": 4694, "text": "int the GSS-API level major error code causing this exception", "labels": ["Other"]}, {"id": 4695, "text": "true if the cursor is on a row; false otherwise", "labels": ["Other"]}, {"id": 4696, "text": "true if this database supports batch updates; false otherwise", "labels": ["Other"]}, {"id": 4697, "text": "true if the character is a Unicode ideograph character, false otherwise.", "labels": ["Other"]}, {"id": 4698, "text": "the current CLASS_0 of CLASS_1 thumbnails, or null.", "labels": ["Other"]}, {"id": 4699, "text": "true if this publisher has any subscribers", "labels": ["Other"]}, {"id": 4700, "text": "the cause of this exception, or null if the cause is nonexistent or unknown.", "labels": ["Other"]}, {"id": 4701, "text": "true if the component has been iconized; otherwise returns false", "labels": ["Other"]}, {"id": 4702, "text": "a possibly null or empty List of KeyEventDispatchers", "labels": ["Other"]}, {"id": 4703, "text": "true if the class is a proxy class and false otherwise", "labels": ["Other"]}, {"id": 4704, "text": "an PRIMITIVE_0 value with a single one-bit, in the position of the highest-order one-bit in the specified value, or zero if the specified value is itself equal to zero.", "labels": ["Other"]}, {"id": 4705, "text": "true if the input data buffer is empty and setInput() should be called in order to provide more input", "labels": ["Other"]}, {"id": 4706, "text": "the class object representing the wrapper type, or null if the passed class is not a primitive.", "labels": ["Other"]}, {"id": 4707, "text": "a BigInteger whose i-th bit corresponds to the i-th coefficient of the reduction polynomial for polynomial basis or null for normal basis.", "labels": ["Other"]}, {"id": 4708, "text": "the cause of this CLASS_0 or null if the cause is nonexistent or unknown.", "labels": ["Other"]}, {"id": 4709, "text": "true if this is equal to the other range", "labels": ["Other"]}, {"id": 4710, "text": "the elements annotated with one or more of the given annotation types, or an empty set if there are none", "labels": ["Other"]}, {"id": 4711, "text": "the algorithm name, or null if none was set", "labels": ["Other"]}, {"id": 4712, "text": "true if the caller is successfully registered as parallel capable and false if otherwise.", "labels": ["Other"]}, {"id": 4713, "text": "true if a value in the designated column is a cash value; false otherwise", "labels": ["Other"]}, {"id": 4714, "text": "an ordered array of certificates, with the client's own certificate first followed by any certificate authorities. If no certificates were sent, then null is returned.", "labels": ["Other"]}, {"id": 4715, "text": "the localized name of the object -- can be null if this object does not have a name", "labels": ["Other"]}, {"id": 4716, "text": "the name of the nearest existing parent logger; an empty string if the specified logger is the root logger. If the specified logger does not exist, null is returned.", "labels": ["Other"]}, {"id": 4717, "text": "the port number of the peer host, or -1 if no information is available.", "labels": ["Other"]}, {"id": 4718, "text": "The possibly null binding of the object after the change.", "labels": ["Other"]}, {"id": 4719, "text": "the value, if present", "labels": ["Other"]}, {"id": 4720, "text": "the name of this unit, not null", "labels": ["Other"]}, {"id": 4721, "text": "true if PARAMETER_0 parameter is shorter than this CLASS_0, else false.", "labels": ["Other"]}, {"id": 4722, "text": "the index of the last occurrence of the specified substring, or -1 if there is no such occurrence.", "labels": ["Other"]}, {"id": 4723, "text": "the menu item at the specified position; or null if the item as the specified position is not a menu item", "labels": ["Other"]}, {"id": 4724, "text": "true if gaps between the container and components that border the container are automatically created", "labels": ["Other"]}, {"id": 4725, "text": "the memory usage of the memory pool when this notification was constructed.", "labels": ["Other"]}, {"id": 4726, "text": "string representation of this CLASS_0, using engineering notation if an exponent is needed.", "labels": ["Other"]}, {"id": 4727, "text": "a boolean array in the same format as the boolean array returned by METHOD_0. Or null.", "labels": ["Other"]}, {"id": 4728, "text": "true if policy mapping is inhibited, false otherwise", "labels": ["Other"]}, {"id": 4729, "text": "true if this CLASS_0 is vertical; false otherwise.", "labels": ["Other"]}, {"id": 4730, "text": "true if obj is equal to this composite name, false otherwise.", "labels": ["Other"]}, {"id": 4731, "text": "The new, read-only long buffer", "labels": ["Other"]}, {"id": 4732, "text": "the first CLASS_1 object reported or null if there are none", "labels": ["Other"]}, {"id": 4733, "text": "an array of all objects registered as CLASS_0s on this textfield, or an empty array if no such listeners have been added", "labels": ["Other"]}, {"id": 4734, "text": "the string value of the system property, or null if there is no property with that key.", "labels": ["Other"]}, {"id": 4735, "text": "true if the cursor points to all whitespace, false otherwise", "labels": ["Other"]}, {"id": 4736, "text": "parent thread group, or null if it doesn't exist.", "labels": ["Other"]}, {"id": 4737, "text": "true if the current contents of this clipboard can be provided in the specified CLASS_0; false otherwise", "labels": ["Other"]}, {"id": 4738, "text": "a currently registered service provider object with the desired CLASS_0 type, or null is none is present.", "labels": ["Other"]}, {"id": 4739, "text": "int the mechanism error code; 0 indicates that it has not been set.", "labels": ["Other"]}, {"id": 4740, "text": "true if the bean is currently avoiding use of the Gui. e.g. due to a call on dontUseGui().", "labels": ["Other"]}, {"id": 4741, "text": "all of the CLASS_0s registered on this toolkit for the specified event types, or an empty array if no such listeners are currently registered", "labels": ["Other"]}, {"id": 4742, "text": "true if track is painted, else false", "labels": ["Other"]}, {"id": 4743, "text": "true if the transformer was found and removed, false if the transformer was not found", "labels": ["Other"]}, {"id": 4744, "text": "true if this method handle accepts more than one arity of plain, inexact METHOD_1 calls", "labels": ["Other"]}, {"id": 4745, "text": "true if a value in the designated column can be used in a FIELD_0 clause; false otherwise", "labels": ["Other"]}, {"id": 4746, "text": "true if this instant is before the specified instant", "labels": ["Other"]}, {"id": 4747, "text": "true if, and only if, this buffer is direct", "labels": ["Other"]}, {"id": 4748, "text": "an immutable CLASS_1 of subject alternative names (or null)", "labels": ["Other"]}, {"id": 4749, "text": "a CLASS_1 based on this date-time with the later offset, not null", "labels": ["Other"]}, {"id": 4750, "text": "true if this tag causes a line break to the flow of data, otherwise returns false", "labels": ["Other"]}, {"id": 4751, "text": "the names of the annotation types supported by this processor, or an empty set if none", "labels": ["Other"]}, {"id": 4752, "text": "true is the INNER_JOIN is supported; false otherwise", "labels": ["Other"]}, {"id": 4753, "text": "true if the call site is considered unstable.", "labels": ["Other"]}, {"id": 4754, "text": "True if literal characters in mask should be returned in stringToValue", "labels": ["Other"]}, {"id": 4755, "text": "true iff the encoded forms of the two CRLs match, false otherwise.", "labels": ["Other"]}, {"id": 4756, "text": "true if this Map contains the specified attribute name", "labels": ["Other"]}, {"id": 4757, "text": "the parsed date-time, not null", "labels": ["Other"]}, {"id": 4758, "text": "CLASS_0 object of the given name defined in the given module; null if not found.", "labels": ["Other"]}]