{"id":47789,"text":"The class of the source, or null.","labels":["ambiguous"]}
{"id":47790,"text":"true if output is to be sent to the logger's parent.","labels":["ambiguous"]}
{"id":47791,"text":"a schema name pattern; must match the schema name as it is stored in the database; \"\" retrieves those without a schema; null means that the schema name should not be used to narrow the search","labels":["ambiguous"]}
{"id":47792,"text":"element to be added to this list, if absent","labels":["ambiguous"]}
{"id":47793,"text":"A non-null enumeration of the components to add.","labels":["not null"]}
{"id":47794,"text":"the unit that the amount is measured in, must have an exact duration, not null","labels":["not null"]}
{"id":47795,"text":"For example, put a special border on the cell, if the cell can be edited, render in the color used to indicate editing","labels":["ambiguous"]}
{"id":47796,"text":"The possibly null object bound to name.","labels":["ambiguous"]}
{"id":47797,"text":"Specifying null is equivalent to specifying Locale.getDefault().","labels":["ambiguous"]}
{"id":47798,"text":"the X and Y of the large cursor's hot spot; the hotSpot values must be less than the Dimension returned by getBestCursorSize","labels":["ambiguous"]}
{"id":47799,"text":"true if add and setLayout are forwarded, false if they should operate directly on the JInternalFrame.","labels":["ambiguous"]}
{"id":47800,"text":"If false, this rule selects the last dayOfWeek on or before dayOfMonth.","labels":["ambiguous"]}
{"id":47801,"text":"The exception to be encapsulated in a FactoryConfigurationError","labels":["ambiguous"]}
{"id":47802,"text":"The non-null fully-qualified host name of the server to authenticate to.","labels":["not null"]}
{"id":47803,"text":"Setting a null value will clear the predicate, allowing all rows to become visible.","labels":["ambiguous"]}
{"id":47804,"text":"the thread to unpark, or null, in which case this operation has no effect","labels":["ambiguous"]}
{"id":47805,"text":"If false, hides this Window, its subcomponents, and all of its owned children.","labels":["ambiguous"]}
{"id":47806,"text":"additively modifies the HSB saturation component of the color returned (ignored if default color is returned).","labels":["ambiguous"]}
{"id":47807,"text":"the number of threads that must invoke await() before the barrier is tripped","labels":["ambiguous"]}
{"id":47808,"text":"The name of the property (may not be null)","labels":["not null"]}
{"id":47809,"text":"indicates if a simple SQL identifier should be returned as a quoted identifier","labels":["ambiguous"]}
{"id":47810,"text":"the namespace context to use for this writer, may not be null","labels":["not null"]}
{"id":47811,"text":"The possibly null object for which to create an object.","labels":["ambiguous"]}
{"id":47812,"text":"Must not be null.","labels":["not null"]}
{"id":47813,"text":"A null value indicates that the cause is nonexistent or unknown.","labels":["ambiguous"]}
{"id":47814,"text":"a non-null handle to return the start value of the loop counter, which must be int.","labels":["not null"]}
{"id":47815,"text":"Any other value will throw IllegalArgumentException.","labels":["ambiguous"]}
{"id":47816,"text":"a Collection of X500Principals (or null)","labels":["ambiguous"]}
{"id":47817,"text":"the first column is 1, the second is 2, and so on; must be between 1 and the number of columns in the rowset, inclusive","labels":["range limitation"]}
{"id":47818,"text":"May be null","labels":["ambiguous"]}
{"id":47819,"text":"The maximum number of bytes to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":["range limitation"]}
{"id":47820,"text":"The other Window involved in the focus or activation change, or null","labels":["ambiguous"]}
{"id":47821,"text":"a filter that can be used to inspect each header-name-and-value pair in the given map to determine if it should, or should not, be added to the to the HTTP headers","labels":["ambiguous"]}
{"id":47822,"text":"For an SctpMultiChannel the address is used to determine the association, or if no association exists with a peer of that address then one is setup.","labels":["ambiguous"]}
{"id":47823,"text":"the horizontal offset of the first subsample within the region, or within the image if no region is set.","labels":["ambiguous"]}
{"id":47824,"text":"the maximum amount that the control points for a given curve can vary from colinear before a subdivided curve is replaced by a straight line connecting the end points","labels":["ambiguous"]}
{"id":47825,"text":"If this is specified as null, any namespace prefix within the expression will result in DOMException being thrown with the code NAMESPACE_ERR.","labels":["ambiguous"]}
{"id":47826,"text":"A non-null String that specifies an output property name, which may be namespace qualified.","labels":["not null"]}
{"id":47827,"text":"if true, replace the existing attributes first","labels":["ambiguous"]}
{"id":47828,"text":"whether the rules are being queried for caching, true if the returned rules will be cached by ZoneId, false if they will be returned to the user without being cached in ZoneId","labels":["ambiguous"]}
{"id":47829,"text":"Either extended _DOWN_MASK or old _MASK values should be used, but both those models should not be mixed.","labels":["ambiguous"]}
{"id":47830,"text":"of the input document type - null means match all types","labels":["ambiguous"]}
{"id":47831,"text":"The source buffer from which chars are to be read; must not be this buffer","labels":["ambiguous"]}
{"id":47832,"text":"true if add and setLayout are forwarded, false if they should operate directly on the JDialog.","labels":["ambiguous"]}
{"id":47833,"text":"the unit to check, null returns false","labels":["ambiguous"]}
{"id":47834,"text":"the index of the certificate in the certification path that caused the error (or -1 if not applicable).","labels":["ambiguous"]}
{"id":47835,"text":"the transition date-time at the transition, which never actually occurs, expressed local to the before offset, not null","labels":["not null"]}
{"id":47836,"text":"the title to be displayed in the window's title bar, if there is such a title bar.","labels":["ambiguous"]}
{"id":47837,"text":"The wrapped Exception.","labels":["ambiguous"]}
{"id":47838,"text":"a boolean to control whether or not to turn an initial moveTo segment into a lineTo segment to connect the new geometry to the existing path","labels":["ambiguous"]}
{"id":47839,"text":"A non-null byte array containing the encoded bytes from the client.","labels":["not null"]}
{"id":47840,"text":"the specified AffineTransform to be wrapped, or null.","labels":["ambiguous"]}
{"id":47841,"text":"True if GUI interaction is available.","labels":["ambiguous"]}
{"id":47842,"text":"the number of threads to keep in the pool, even if they are idle, unless allowCoreThreadTimeOut is set","labels":["ambiguous"]}
{"id":47843,"text":"the number of existing child views to remove This should be a value >= 0 and <= (getViewCount() - offset).","labels":["range limitation"]}
{"id":47844,"text":"the class loader used for instantiating objects, or null to use the default class loader","labels":["ambiguous"]}
{"id":47845,"text":"the value to describe, which must be non-null","labels":["not null"]}
{"id":47846,"text":"the exception to be added to the list of suppressed exceptions","labels":["ambiguous"]}
{"id":47847,"text":"If the context node is a Text or a CDATASection, then the context is interpreted as the whole logical text node as seen by XPath, unless the node is empty in which case it may not serve as the XPath context.","labels":["ambiguous"]}
{"id":47848,"text":"If the XPathEvaluator was obtained by casting the Document then this must be owned by the same document and must be a Document, Element, Attribute, Text, CDATASection, Comment, ProcessingInstruction, or XPathNamespace node.","labels":["ambiguous"]}
{"id":47849,"text":"the new query time-out limit in seconds; zero means that there is no limit; must not be less than zero","labels":["range limitation"]}
{"id":47850,"text":"If true, this rule selects the first endDayOfWeek on or after endDay.","labels":["ambiguous"]}
{"id":47851,"text":"the text to be displayed; if text is null, the empty string \"\" will be displayed","labels":["ambiguous"]}
{"id":47852,"text":"The index of the first character to be used; must be non-negative and no larger than csq.length().","labels":["range limitation"]}
{"id":47853,"text":"dataArray must have at least offset + size elements.","labels":["range limitation"]}
{"id":47854,"text":"It must respect the constraints spelt out in the description of the MBeanServerPermission class.","labels":["ambiguous"]}
{"id":47855,"text":"Must be positive.","labels":["range limitation"]}
{"id":47856,"text":"the array into which the elements of the list are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":["ambiguous"]}
{"id":47857,"text":"the array into which the elements of the Vector are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":["ambiguous"]}
{"id":47858,"text":"This has no effect if the path does not break or bend sharply at the advance.","labels":["ambiguous"]}
{"id":47859,"text":"The entity's public identifier, or null if none was given.","labels":["ambiguous"]}
{"id":47860,"text":"the error type","labels":["ambiguous"]}
{"id":47861,"text":"the text storage to use; if this is null, a default will be provided by calling the createDefaultModel method","labels":["ambiguous"]}
{"id":47862,"text":"This should be a dot-separated name and should normally be based on the package name or class name of the subsystem, such as java.net or javax.swing","labels":["ambiguous"]}
{"id":47863,"text":"This should be a value >= 0 and <= getViewCount","labels":["range limitation"]}
{"id":47864,"text":"true if the transparency of a color can be selected","labels":["ambiguous"]}
{"id":47865,"text":"whether or not a RowSorter should be automatically created","labels":["ambiguous"]}
{"id":47866,"text":"The public identifier of the entity that generated the error or warning.","labels":["ambiguous"]}
{"id":47867,"text":"true if end should be omitted","labels":["ambiguous"]}
{"id":47868,"text":"An array of floats to be used as the first and only bank of this DataBuffer.","labels":["ambiguous"]}
{"id":47869,"text":"If null, an empty attribute set is constructed.","labels":["ambiguous"]}
{"id":47870,"text":"A typical case where the lookup might be needed is when the converter creates a Java adapter class on the fly (e.g.","labels":["ambiguous"]}
{"id":47871,"text":"The qualified name of the document element to be created or null.","labels":["ambiguous"]}
{"id":47872,"text":"This value is always the one passed to an acquire method, or is the value saved on entry to a condition wait.","labels":["ambiguous"]}
{"id":47873,"text":"Note that if this method is not invoked explicitly or is passed null, then the factory will create an instance of BeansLinker to serve as the default fallback linker.","labels":["ambiguous"]}
{"id":47874,"text":"if true, all parents of @{code path} and path are marked as expanded.","labels":["ambiguous"]}
{"id":47875,"text":"JComponent that will display the Icon, may be null","labels":["ambiguous"]}
{"id":47876,"text":"the detail message (or null if none)","labels":["ambiguous"]}
{"id":47877,"text":"the text of the paragraph after performing the deletion.","labels":["ambiguous"]}
{"id":47878,"text":"the tab index where the tooltip text should be set","labels":["ambiguous"]}
{"id":47879,"text":"true if the consumers should be sent a SINGLEFRAMEDONE notification","labels":["ambiguous"]}
{"id":47880,"text":"the Frame to act as owner or null if this window has no owner","labels":["ambiguous"]}
{"id":47881,"text":"A SourceLocator object, or null to clear the location.","labels":["ambiguous"]}
{"id":47882,"text":"true if the height preference has changed","labels":["ambiguous"]}
{"id":47883,"text":"if true, marks this thread as a daemon thread","labels":["ambiguous"]}
{"id":47884,"text":"The descriptions, in the same order as itemNames, of the items contained in the composite data values described by this CompositeType instance; should be of the same size as itemNames; no element can be null or an empty string.","labels":["not null"]}
{"id":47885,"text":"a reference to a GraphicsConfiguration object or null","labels":["ambiguous"]}
{"id":47886,"text":"true if the alpha is premultiplied; false otherwise","labels":["ambiguous"]}
{"id":47887,"text":"the map whose values are to be added as new rows to this TabularData instance; if t is null or empty, this method returns without doing anything.","labels":["ambiguous"]}
{"id":47888,"text":"only visible as part of an HTTP request.","labels":["ambiguous"]}
{"id":47889,"text":"If it and the switch point and the exception are all null, this represents an unconditional invocation.","labels":["ambiguous"]}
{"id":47890,"text":"an additional parameter, may be null","labels":["ambiguous"]}
{"id":47891,"text":"This value can be null","labels":["ambiguous"]}
{"id":47892,"text":"indicates whether this Container is the root of a focus traversal cycle","labels":["ambiguous"]}
{"id":47893,"text":"the Icon to display when the component is disabled","labels":["ambiguous"]}
{"id":47894,"text":"Whether to read fields of unrecognized tags","labels":["ambiguous"]}
{"id":47895,"text":"true if the image is a multi-frame animation","labels":["ambiguous"]}
{"id":47896,"text":"the Runnable whose run method should be executed synchronously in the event dispatch thread of the system EventQueue","labels":["ambiguous"]}
{"id":47897,"text":"If false and if the notification is periodic, the notification is scheduled with a fixed-delay execution scheme.","labels":["ambiguous"]}
{"id":47898,"text":"Can be null, in which case requests will be performed on behalf of the authenticated Subject, if any.","labels":["ambiguous"]}
{"id":47899,"text":"whether to enable or disable the","labels":["ambiguous"]}
{"id":47900,"text":"a long value that gives the time when the event occurred","labels":["ambiguous"]}
{"id":47901,"text":"a default Font to return if property nm is not defined","labels":["ambiguous"]}
{"id":47902,"text":"true if the any policy OID is to be inhibited, false otherwise","labels":["ambiguous"]}
{"id":47903,"text":"If obj is also null, getClassName() will return null.","labels":["ambiguous"]}
{"id":47904,"text":"The initial Cursor for this drag operation or null for the default cursor handling; see DragSourceContext class for more details on the cursor handling mechanism during drag and drop","labels":["ambiguous"]}
{"id":47905,"text":"the list object to select or null to clear the selection","labels":["ambiguous"]}
{"id":47906,"text":"The handler to associate to that key, or null.","labels":["ambiguous"]}
{"id":47907,"text":"If null is specified, all available attributes will be used.","labels":["ambiguous"]}
{"id":47908,"text":"the Component the error occurred in, may be null indicating the error condition is not directly associated with a Component","labels":["ambiguous"]}
{"id":47909,"text":"the filtered output stream to set as this object's outputstream, or null if no change.","labels":["ambiguous"]}
{"id":47910,"text":"the detailed message for the exception","labels":["ambiguous"]}
{"id":47911,"text":"the number of ElementSpec.EndTagTypes to generate before inserting","labels":["ambiguous"]}
{"id":47912,"text":"the certification path that was in the process of being validated when the error was encountered","labels":["ambiguous"]}
{"id":47913,"text":"True if, when a class is not found in either the parent ClassLoader or the URLs, the MLet should delegate to its containing MBeanServer's ClassLoaderRepository.","labels":["ambiguous"]}
{"id":47914,"text":"the text after the deletion","labels":["ambiguous"]}
{"id":47915,"text":"Ignored if the notification is not periodic.","labels":["ambiguous"]}
{"id":47916,"text":"True if we're in an application builder tool.","labels":["ambiguous"]}
{"id":47917,"text":"The possibly null name to set resolved name to.","labels":["ambiguous"]}
{"id":47918,"text":"If there are more arguments than format specifiers, the extra arguments are ignored.","labels":["ambiguous"]}
{"id":47919,"text":"The offset within the array of the first double to be written; must be non-negative and no larger than dst.length","labels":["range limitation"]}
{"id":47920,"text":"Note that the list of certificates in a CertPath is zero based.","labels":["ambiguous"]}
{"id":47921,"text":"true if the user can resize this dialog; false otherwise.","labels":["ambiguous"]}
{"id":47922,"text":"The exception to be encapsulated in a FactoryConfigurationError.","labels":["ambiguous"]}
{"id":47923,"text":"If null then there is no default handler.","labels":["ambiguous"]}
{"id":47924,"text":"The FlavorMap to use, or null for the default FlavorMap","labels":["ambiguous"]}
{"id":47925,"text":"the month-day to validate, null returns false","labels":["ambiguous"]}
{"id":47926,"text":"If null is specified, a mapping of all supported String natives to their most preferred DataFlavors will be returned.","labels":["ambiguous"]}
{"id":47927,"text":"the handler that is called when the application is asked to quit","labels":["ambiguous"]}
{"id":47928,"text":"maximum time in milliseconds before update","labels":["ambiguous"]}
{"id":47929,"text":"This parameter is ignored as the method never blocks","labels":["ambiguous"]}
{"id":47930,"text":"A configuration listener that will be invoked after the configuration changed.","labels":["ambiguous"]}
{"id":47931,"text":"the name of this SQLPermission object, which must be either setLog, callAbort, setSyncFactory, deregisterDriver, or setNetworkTimeout","labels":["ambiguous"]}
{"id":47932,"text":"The qualified (prefixed) name, or the empty string if qualified names are not available.","labels":["ambiguous"]}
{"id":47933,"text":"the string to get the advance width of, may be null","labels":["ambiguous"]}
{"id":47934,"text":"The index of the character following the last character to be used; must be no smaller than start and no larger than csq.length().","labels":["range limitation"]}
{"id":47935,"text":"It can be null.","labels":["ambiguous"]}
{"id":47936,"text":"true for success, false if not","labels":["ambiguous"]}
{"id":47937,"text":"When true, the remainder of the program is inactive until the dialog is closed.","labels":["ambiguous"]}
{"id":47938,"text":"If null, it sets the remaining name field to null.","labels":["ambiguous"]}
{"id":47939,"text":"the uri of the event, may be null","labels":["ambiguous"]}
{"id":47940,"text":"the File from which the Sequence should be constructed","labels":["ambiguous"]}
{"id":47941,"text":"the day of the month-day of the cutover week, positive if the week is that day or later, negative if the week is that day or earlier, counting from the last day of the month, from -28 to 31 excluding 0","labels":["ambiguous"]}
{"id":47942,"text":"If location is not the same object as point, location will remain unmodified by this call.","labels":["ambiguous"]}
{"id":47943,"text":"the Action for the AbstractButton, or null","labels":["ambiguous"]}
{"id":47944,"text":"A direct method handle describing the implementation method which should be called (with suitable adaptation of argument types, return types, and with captured arguments prepended to the invocation arguments) at invocation time.","labels":["ambiguous"]}
{"id":47945,"text":"true if the button is selected, otherwise false","labels":["ambiguous"]}
{"id":47946,"text":"whether a gap between components is automatically created","labels":["ambiguous"]}
{"id":47947,"text":"If true, sets the access permission to allow read operations; if false to disallow read operations","labels":["ambiguous"]}
{"id":47948,"text":"the unknown element, may be null","labels":["ambiguous"]}
{"id":47949,"text":"if true, images and metadata may only be read in ascending order from this input source.","labels":["ambiguous"]}
{"id":47950,"text":"The standard string name of the endpoint identification algorithm (or null).","labels":["ambiguous"]}
{"id":47951,"text":"Possibly null additional detail about this exception","labels":["ambiguous"]}
{"id":47952,"text":"Use default GregorianCalendar locale if value is null.","labels":["ambiguous"]}
{"id":47953,"text":"The arguments, null is a valid value.","labels":["ambiguous"]}
{"id":47954,"text":"An array of doubles to be used as the first and only bank of this DataBuffer.","labels":["ambiguous"]}
{"id":47955,"text":"for an object of java.math.BigDecimal , this is the number of digits after the decimal point.","labels":["ambiguous"]}
{"id":47956,"text":"the fully qualified name of an SQL user-defined type, which is ignored if the parameter is not a user-defined type or REF value","labels":["ambiguous"]}
{"id":47957,"text":"the underlying reason for this SQLException(which is saved for later retrieval by the getCause() method); may be null indicating the cause is non-existent or unknown.","labels":["ambiguous"]}
{"id":47958,"text":"an interface this address must be associated with.","labels":["ambiguous"]}
{"id":47959,"text":"The name of the level to set on the specified logger, or null if setting the level to inherit from its nearest ancestor.","labels":["ambiguous"]}
{"id":47960,"text":"The offset within the array of the first int to be read; must be non-negative and no larger than array.length","labels":["range limitation"]}
{"id":47961,"text":"the desired maximum number of zones to be actively loaded, must be greater than 0","labels":["range limitation"]}
{"id":47962,"text":"If positive, block for up to timeout milliseconds, more or less, while waiting for a channel to become ready; if zero, block indefinitely; must not be negative","labels":["range limitation"]}
{"id":47963,"text":"true if, and only if, the message is complete","labels":["ambiguous"]}
{"id":47964,"text":"String describing the exception.","labels":["ambiguous"]}
{"id":47965,"text":"the OutputStream that should be used to write the transformed data to","labels":["ambiguous"]}
{"id":47966,"text":"the value to pass to the constructor, or null if this type of service does not use a constructorParameter.","labels":["ambiguous"]}
{"id":47967,"text":"the factory to use when the executor creates a new thread","labels":["ambiguous"]}
{"id":47968,"text":"This should not be null if this method gets called","labels":["not null"]}
{"id":47969,"text":"A possibly null environment property set.","labels":["ambiguous"]}
{"id":47970,"text":"For best results, it should not be too different from the current advance of the line.","labels":["ambiguous"]}
{"id":47971,"text":"upon return from the method, this object will contain the applied QOP and supplementary information stating if the token was a duplicate, old, out of sequence or arriving after a gap.","labels":["ambiguous"]}
{"id":47972,"text":"the underlying reason for this SQLException (which is saved for later retrieval by the getCause() method); may be null indicating the cause is non-existent or unknown.","labels":["ambiguous"]}
{"id":47973,"text":"if null, the returned value is true.","labels":["ambiguous"]}
{"id":47974,"text":"the non-null key","labels":["not null"]}
{"id":47975,"text":"the localName of the event, may be null","labels":["ambiguous"]}
{"id":47976,"text":"The non-null string to be unescaped.","labels":["not null"]}
{"id":47977,"text":"the cause, may be null.","labels":["ambiguous"]}
{"id":47978,"text":"the permission that caused the exception.","labels":["ambiguous"]}
{"id":47979,"text":"Must be in the range [0,size()].","labels":["range limitation"]}
{"id":47980,"text":"If null, this thread's run method is invoked.","labels":["ambiguous"]}
{"id":47981,"text":"if true, recursively clone the subtree under the specified node; if false, clone only the node itself.","labels":["ambiguous"]}
{"id":47982,"text":"the module to test if it can be modified","labels":["ambiguous"]}
{"id":47983,"text":"a map that contains the options that controls the amount of data and how it is read, or null to get all data for the recording with the default block size","labels":["ambiguous"]}
{"id":47984,"text":"The open type instances, in the same order as itemNames, describing the items contained in the composite data values described by this CompositeType instance; should be of the same size as itemNames; no element can be null.","labels":["ambiguous"]}
{"id":47985,"text":"the Image to drag (or null)","labels":["ambiguous"]}
{"id":47986,"text":"If null this constraint is not used.","labels":["ambiguous"]}
{"id":47987,"text":"a resource bundle to localize format; can be null.","labels":["ambiguous"]}
{"id":47988,"text":"the DocTreePath of item where the error occurs","labels":["ambiguous"]}
{"id":47989,"text":"true if the focus change is temporary, such as when the window loses the focus; for more information on temporary focus changes see the Focus Specification","labels":["ambiguous"]}
{"id":47990,"text":"the column label to be used in printouts and displays; if the column label is null, an empty String is set","labels":["ambiguous"]}
{"id":47991,"text":"the object to be returned as the value if the system value is null","labels":["ambiguous"]}
{"id":47992,"text":"must be true","labels":["ambiguous"]}
{"id":47993,"text":"the new check box group, or null to remove this check box from any check box group","labels":["ambiguous"]}
{"id":47994,"text":"the detail message; may be null","labels":["ambiguous"]}
{"id":47995,"text":"the string to display as an error detail message","labels":["ambiguous"]}
{"id":47996,"text":"Null indicates an empty environment.","labels":["ambiguous"]}
{"id":47997,"text":"the text to parse such as \"2007-12-03T10:15:30+01:00[Europe\/Paris]\", not null","labels":["not null"]}
{"id":47998,"text":"This value is conveyed to tryReleaseShared(int) but is otherwise uninterpreted and can represent anything you like.","labels":["ambiguous"]}
{"id":47999,"text":"A stream metadata object, or null.","labels":["ambiguous"]}
{"id":48000,"text":"A possibly null object whose state is to be retrieved.","labels":["ambiguous"]}
{"id":48001,"text":"options specifying how the copy should be done","labels":["ambiguous"]}
{"id":48002,"text":"the ActionListener invoked when \"Cancel\" is pressed","labels":["ambiguous"]}
{"id":48003,"text":"the position (zero-based index) in the argument list at which spreading should start.","labels":["ambiguous"]}
{"id":48004,"text":"An object to be invoked when a PropertyChange event is fired.","labels":["ambiguous"]}
{"id":48005,"text":"whether or not the JComboBox has focus","labels":["ambiguous"]}
{"id":48006,"text":"a Throwable associated with the log message; can be null.","labels":["ambiguous"]}
{"id":48007,"text":"the password used to check the integrity of the keystore, the password used to unlock the keystore, or null","labels":["ambiguous"]}
{"id":48008,"text":"The context relative to which the name parameter is specified, or null if name is relative to the default initial context.","labels":["ambiguous"]}
{"id":48009,"text":"the text of the paragraph after performing the insertion.","labels":["ambiguous"]}
{"id":48010,"text":"The possibly null environment to be used in the creation of the object's state.","labels":["ambiguous"]}
{"id":48011,"text":"the Date to check against to see if this certificate is valid at that date\/time.","labels":["ambiguous"]}
{"id":48012,"text":"must be valid for the openType specified for this parameter; can be null, in which case it means that no maximal value is set.","labels":["ambiguous"]}
{"id":48013,"text":"whether to print in an interactive mode","labels":["ambiguous"]}
{"id":48014,"text":"the Element for which the error occurs","labels":["ambiguous"]}
{"id":48015,"text":"Implementations of the Paint interface are allowed to throw NullPointerException for a null hints.","labels":["ambiguous"]}
{"id":48016,"text":"whether or not to enable automatic drag handling","labels":["ambiguous"]}
{"id":48017,"text":"the name of the method in the listener interface that should trigger the action","labels":["ambiguous"]}
{"id":48018,"text":"Action to perform when the Status changes.","labels":["ambiguous"]}
{"id":48019,"text":"the algorithm parameters, or null if no additional parameters","labels":["ambiguous"]}
{"id":48020,"text":"If true, alpha is premultiplied.","labels":["ambiguous"]}
{"id":48021,"text":"whether or not to linger on.","labels":["ambiguous"]}
{"id":48022,"text":"true if maxValue is inclusive.","labels":["ambiguous"]}
{"id":48023,"text":"The possibly null context in which the control is being created.","labels":["ambiguous"]}
{"id":48024,"text":"the value of U to return as the body, may be null","labels":["ambiguous"]}
{"id":48025,"text":"the base clock to base the ticking clock on, not null","labels":["ambiguous"]}
{"id":48026,"text":"This must not be null.","labels":["ambiguous"]}
{"id":48027,"text":"true if the associated thread should run as a daemon.","labels":["ambiguous"]}
{"id":48028,"text":"the raw message string (may be null)","labels":["ambiguous"]}
{"id":48029,"text":"the (non-null) item to publish","labels":["ambiguous"]}
{"id":48030,"text":"The number of floats to be read from the given array; must be non-negative and no larger than array.length - offset","labels":["range limitation"]}
{"id":48031,"text":"The parameter types represent the types of concatenation arguments; the return type is always assignable from String.","labels":["ambiguous"]}
{"id":48032,"text":"If non-null, specifies legal characters.","labels":["ambiguous"]}
{"id":48033,"text":"a class providing the necessary methods required of a doclet; a value of null means to use the standard doclet.","labels":["ambiguous"]}
{"id":48034,"text":"If it is a parameter entity, the name will begin with '%', and if it is the external DTD subset, it will be \"[dtd]\".","labels":["ambiguous"]}
{"id":48035,"text":"the first date in the sequence or null","labels":["ambiguous"]}
{"id":48036,"text":"If this value is less than or equal to zero, then a system default value is used.","labels":["ambiguous"]}
{"id":48037,"text":"String used when formatting if the value does not completely fill the mask","labels":["ambiguous"]}
{"id":48038,"text":"The new limit value; must be non-negative and no larger than this buffer's capacity","labels":["range limitation"]}
{"id":48039,"text":"the algorithm constraints (or null)","labels":["ambiguous"]}
{"id":48040,"text":"the text to use when the offset is zero, not null","labels":["ambiguous"]}
{"id":48041,"text":"the identity value for the reduction (also, the value that is returned when there are no input elements)","labels":["ambiguous"]}
{"id":48042,"text":"The notation's public identifier, or null if none was given.","labels":["ambiguous"]}
{"id":48043,"text":"If false, the layout will be validated after resizing is completed.","labels":["ambiguous"]}
{"id":48044,"text":"the RowSorter; null turns sorting off","labels":["ambiguous"]}
{"id":48045,"text":"the expression for which the type should be inferred","labels":["ambiguous"]}
{"id":48046,"text":"the method handle to invoke after arguments are filtered","labels":["ambiguous"]}
{"id":48047,"text":"an offset associated with the character after the offset","labels":["ambiguous"]}
{"id":48048,"text":"A non-null byte array containing the bytes to encode.","labels":["ambiguous"]}
{"id":48049,"text":"true if the event request is to be enabled; false otherwise.","labels":["ambiguous"]}
{"id":48050,"text":"The name of this object relative to nameCtx, or null if no name is specified.","labels":["ambiguous"]}
{"id":48051,"text":"the temporal object to format, not null","labels":["not null"]}
{"id":48052,"text":"how to wait before giving up, in units of unit","labels":["ambiguous"]}
{"id":48053,"text":"This can be null, in which case it is assumed that there is no external embedding information.","labels":["ambiguous"]}
{"id":48054,"text":"the new standard error destination","labels":["ambiguous"]}
{"id":48055,"text":"Other types of resources are outside the scope of this specification and therefore should recommend an absolute URI in order to use this method.","labels":["ambiguous"]}
{"id":48056,"text":"whether visibility of this component should be considered for sizing and positioning","labels":["ambiguous"]}
{"id":48057,"text":"true if add and setLayout are forwarded, false if they should operate directly on the JFrame.","labels":["ambiguous"]}
{"id":48058,"text":"An array containing the parameters to be set when the operation is invoked","labels":["ambiguous"]}
{"id":48059,"text":"the nested error","labels":["ambiguous"]}
{"id":48060,"text":"the URLStreamHandlerFactory to use when creating URLs","labels":["ambiguous"]}
{"id":48061,"text":"the String that contains a detailed message (can be null)","labels":["ambiguous"]}
{"id":48062,"text":"the array into which the elements of the queue are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":["ambiguous"]}
{"id":48063,"text":"the preferred ColorModel which represents the most convenient format for the caller to receive the pixel data, or null if there is no preference.","labels":["ambiguous"]}
{"id":48064,"text":"must be one of SpringLayout.NORTH, SpringLayout.SOUTH, SpringLayout.EAST, SpringLayout.WEST, SpringLayout.VERTICAL_CENTER, SpringLayout.HORIZONTAL_CENTER or SpringLayout.BASELINE","labels":["ambiguous"]}
{"id":48065,"text":"whether this ContainerOrderFocusTraversalPolicy transfers focus down-cycle implicitly","labels":["ambiguous"]}
{"id":48066,"text":"changes to the element this view is responsible for (may be null if there were no changes)","labels":["ambiguous"]}
{"id":48067,"text":"This value will be null if the view has not yet been displayed.","labels":["ambiguous"]}
{"id":48068,"text":"the locale for which text input is supported, or null","labels":["ambiguous"]}
{"id":48069,"text":"This should be a dot-separated name and should normally be based on the package name or class name of the subsystem, such as java.net or javax.swing.","labels":["ambiguous"]}
{"id":48070,"text":"if true, dump all locked monitors.","labels":["ambiguous"]}
{"id":48071,"text":"the duration, or null if no duration is set","labels":["ambiguous"]}
{"id":48072,"text":"if true, objects will be returned; if false, objects will not be returned.","labels":["ambiguous"]}
{"id":48073,"text":"The system identifier of the entity that generated the error or warning.","labels":["ambiguous"]}
{"id":48074,"text":"May be null.","labels":["ambiguous"]}
{"id":48075,"text":"possibly null detail about this exception.","labels":["ambiguous"]}
{"id":48076,"text":"the local date, not null","labels":["not null"]}
{"id":48077,"text":"the initialization parameters (may be null).","labels":["ambiguous"]}
{"id":48078,"text":"The maximum number of buffers to be accessed; it must be non-negative and no larger than dsts.length - offset.","labels":["range limitation"]}
{"id":48079,"text":"true if the path is leaf","labels":["ambiguous"]}
{"id":48080,"text":"the LayoutStyle, or null","labels":["ambiguous"]}
{"id":48081,"text":"the unit that the duration is measured in, must have an exact duration, not null","labels":["not null"]}
{"id":48082,"text":"If the context is null, then no additional restriction is applied.","labels":["ambiguous"]}
{"id":48083,"text":"If null or empty, the server derives an authorization ID from the client's authentication credentials.","labels":["ambiguous"]}
{"id":48084,"text":"If the object factory requires more attributes, it needs to get it, either using obj, or name and nameCtx.","labels":["ambiguous"]}
{"id":48085,"text":"the settings for the event, not null","labels":["not null"]}
{"id":48086,"text":"the text to parse such as \"2007-12-03T10:15:30+01:00\", not null","labels":["not null"]}
{"id":48087,"text":"interface extending java.lang.annotation.Annotation, not null","labels":["not null"]}
{"id":48088,"text":"For XML Schema [XML Schema Part 1] , applications must use the value \"http:\/\/www.w3.org\/2001\/XMLSchema\".","labels":["ambiguous"]}
{"id":48089,"text":"This mode may be more appropriate than default locally stack-based mode in applications in which worker threads only process event-style asynchronous tasks.","labels":["ambiguous"]}
{"id":48090,"text":"true if the root node of the tree is to be displayed","labels":["ambiguous"]}
{"id":48091,"text":"true if the javadoc for the given input should be computed in addition to the signature","labels":["ambiguous"]}
{"id":48092,"text":"return objects only of these kinds","labels":["ambiguous"]}
{"id":48093,"text":"specifies the local interface or null to defer to the interface set by setInterface(InetAddress) or setNetworkInterface(NetworkInterface)","labels":["ambiguous"]}
{"id":48094,"text":"how long to wait before completing exceptionally with a TimeoutException, in units of unit","labels":["ambiguous"]}
{"id":48095,"text":"The error code identifying the exception.","labels":["ambiguous"]}
{"id":48096,"text":"the index of the previous rollover column or -1 if the mouse was not over a column","labels":["ambiguous"]}
{"id":48097,"text":"The JAR file to be searched when the system class loader unsuccessfully searches for a class.","labels":["ambiguous"]}
{"id":48098,"text":"The non-null context in which the exception was thrown.","labels":["not null"]}
{"id":48099,"text":"the number of milliseconds to wait for the image pixels to arrive before timing out","labels":["ambiguous"]}
{"id":48100,"text":"the cutover time in the 'before' offset, not null","labels":["not null"]}
{"id":48101,"text":"On input, the position at which to start parsing; on output, the position at which parsing terminated, or the start position if the parse failed.","labels":["ambiguous"]}
{"id":48102,"text":"the random bit source to use to generate key bits; can be null.","labels":["ambiguous"]}
{"id":48103,"text":"a string containing the error detail message","labels":["ambiguous"]}
{"id":48104,"text":"The object attached to the receive operation when it was initiated.","labels":["ambiguous"]}
{"id":48105,"text":"If null current Thread's context classLoader is used to load the factory class.","labels":["ambiguous"]}
{"id":48106,"text":"(Note that Connection.TRANSACTION_NONE cannot be used because it specifies that transactions are not supported.)","labels":["ambiguous"]}
{"id":48107,"text":"The base URI against which the href attribute will be made absolute if the absolute URI is required","labels":["ambiguous"]}
{"id":48108,"text":"If true, caught exceptions will be reported.","labels":["ambiguous"]}
{"id":48109,"text":"the SQL query that will be used to get the data for this RowSet object; may be null","labels":["ambiguous"]}
{"id":48110,"text":"(A null value is permitted, and indicates that the cause is nonexistent or unknown.)","labels":["ambiguous"]}
{"id":48111,"text":"the non-null value to be merged with the existing value associated with the key or, if no existing value or a null value is associated with the key, to be associated with the key","labels":["not null"]}
{"id":48112,"text":"If the flag is false, the filled Shape is tested.","labels":["ambiguous"]}
{"id":48113,"text":"if true, then replace the existing attributes first","labels":["ambiguous"]}
{"id":48114,"text":"This value must be greater than 0.","labels":["range limitation"]}
{"id":48115,"text":"The possibly null compound name to check.","labels":["ambiguous"]}
{"id":48116,"text":"the RenderingHints object used to control the color conversion, or null","labels":["ambiguous"]}
{"id":48117,"text":"Each argument may be null.","labels":["ambiguous"]}
{"id":48118,"text":"the Component to which the event should be dispatched","labels":["ambiguous"]}
{"id":48119,"text":"It is also strongly recommended that third parties adding their own events use their own prefix to avoid confusion and lessen the probability of conflicts with other new events.","labels":["ambiguous"]}
{"id":48120,"text":"The offset within the array of the first char to be written; must be non-negative and no larger than dst.length","labels":["range limitation"]}
{"id":48121,"text":"true to display a print dialog, false otherwise","labels":["ambiguous"]}
{"id":48122,"text":"a schema name; must match the schema name as it is stored in the database; \"\" retrieves those without a schema; null means that the schema name should not be used to narrow the search","labels":["ambiguous"]}
{"id":48123,"text":"the set of elements that must not occur inside the element","labels":["ambiguous"]}
{"id":48124,"text":"the zone ID as defined by ZoneId, not null","labels":["not null"]}
{"id":48125,"text":"Implementations of the Paint interface are allowed to throw NullPointerException for a null xform.","labels":[]}
{"id":48126,"text":"the unit of the amount to subtract, not null","labels":[]}
{"id":48127,"text":"null indicates that all attributes are to be returned; an empty array indicates that none are to be returned.","labels":[]}
{"id":48128,"text":"If null then this thread has no explicit handler.","labels":[]}
{"id":48129,"text":"the object which must be the current instance in order to pass this filter.","labels":[]}
{"id":48130,"text":"This parameter may not be null.","labels":[]}
{"id":48131,"text":"to be used for the background if the node is selected","labels":[]}
{"id":48132,"text":"the detail message (can be null)","labels":[]}
{"id":48133,"text":"true for rollover toolbar buttons; otherwise false","labels":[]}
{"id":48134,"text":"the signature provider's name (or null)","labels":[]}
{"id":48135,"text":"XML requires a system identifier on all external entities, so this value is always specified.","labels":[]}
{"id":48136,"text":"If null or no domain and key properties are specified, all the MBeans registered will be retrieved.","labels":[]}
{"id":48137,"text":"if the newly created clone is stopped before returning.","labels":[]}
{"id":48138,"text":"The position within the file at which the mapped region is to start; must be non-negative","labels":[]}
{"id":48139,"text":"an access control context representing the restriction to be applied to the caller's domain's privileges before performing the specified action.","labels":[]}
{"id":48140,"text":"the Component that will be the basis for a focus traversal operation if the specified event represents a focus traversal key for the Component","labels":[]}
{"id":48141,"text":"if true then the returned stream is a parallel stream; if false the returned stream is a sequential stream.","labels":[]}
{"id":48142,"text":"the port on which the object is exported (an anonymous port is used if port=0)","labels":[]}
{"id":48143,"text":"the required output format, or null to mean any format.","labels":[]}
{"id":48144,"text":"the input stream from which the Sequence should be constructed","labels":[]}
{"id":48145,"text":"the event the editor should use to start editing","labels":[]}
{"id":48146,"text":"The chain must be ordered and contain a Certificate at index 0 corresponding to the private key.","labels":[]}
{"id":48147,"text":"a merge function, used to resolve collisions between values associated with the same key, as supplied to Map.merge(Object, Object, BiFunction), must be non-null","labels":[]}
{"id":48148,"text":"The String object containing the exception message.","labels":[]}
{"id":48149,"text":"the Component this DragGestureRecognizer should \"observe\" the event stream to, in order to detect a drag initiating gesture.","labels":[]}
{"id":48150,"text":"If null, remove the attribute value that is null.","labels":[]}
{"id":48151,"text":"If null is specified, all natives currently known to the data transfer subsystem are returned in a non-deterministic order.","labels":[]}
{"id":48152,"text":"null is a legal value.","labels":[]}
{"id":48153,"text":"If null, the default search controls are used (equivalent to (new SearchControls())).","labels":[]}
{"id":48154,"text":"class loader name; or null if not named","labels":[]}
{"id":48155,"text":"the Object containing the input parameter value; must be an Object type","labels":[]}
{"id":48156,"text":"The maximum number of buffers to be accessed; it must be non-negative and no larger than srcs.length - offset","labels":[]}
{"id":48157,"text":"The detail message; can be null","labels":[]}
{"id":48158,"text":"the Unicode Extension type, not null.","labels":[]}
{"id":48159,"text":"Window to repaint, null results in nothing happening.","labels":[]}
{"id":48160,"text":"the detail message, which should include the name of the file attempting to be opened; may be null","labels":[]}
{"id":48161,"text":"If true then this method is required to force changes to both the file's content and metadata to be written to storage; otherwise, it need only force content changes to be written","labels":[]}
{"id":48162,"text":"true if deleted rows should be shown; false otherwise","labels":[]}
{"id":48163,"text":"The new position value; must be non-negative and no larger than the current limit","labels":[]}
{"id":48164,"text":"the expression whose value was inappropriate.","labels":[]}
{"id":48165,"text":"If false, it can be sent over any protocol.","labels":[]}
{"id":48166,"text":"a List of CertStores (or null)","labels":[]}
{"id":48167,"text":"the title of the dialog; a null value will be accepted without causing a NullPointerException to be thrown","labels":[]}
{"id":48168,"text":"the Kerberos principal, must not be null.","labels":[]}
{"id":48169,"text":"The non-null string name of the protocol for which the authentication is being performed (e.g., \"ldap\").","labels":[]}
{"id":48170,"text":"May be null, implying a default initial value.","labels":[]}
{"id":48171,"text":"the message to generate when a PrinterException is thrown","labels":[]}
{"id":48172,"text":"whether to enable the input method for composition","labels":[]}
{"id":48173,"text":"if <= -1, then no response body length is specified and no response body may be written.","labels":[]}
{"id":48174,"text":"The attribute's Namespace URI, or the empty string if none is available.","labels":[]}
{"id":48175,"text":"supplier of the detail message to be used in the event that a NullPointerException is thrown","labels":[]}
{"id":48176,"text":"a component that has implemented the RowSetListener interface and wants to be notified when events occur on this RowSet object","labels":[]}
{"id":48177,"text":"Applications should invoke Document.normalizeDocument() with the parameter \" namespaces\" set to true in order to ensure that the entity name is namespace well-formed.","labels":[]}
{"id":48178,"text":"a catalog name; must match the catalog name as it is stored in the database; \"\" retrieves those without a catalog; null means that the catalog name should not be used to narrow the search","labels":[]}
{"id":48179,"text":"May be null or \"-\", which represents a class name that is implied by any class name but does not imply any other class name.","labels":[]}
{"id":48180,"text":"color to be used for text when the node isn't selected","labels":[]}
{"id":48181,"text":"The errorType for which we want to get the original type.","labels":[]}
{"id":48182,"text":"If it is a parameter entity, the name will begin with '%'.","labels":[]}
{"id":48183,"text":"Text to insert, null indicates no text to insert","labels":[]}
{"id":48184,"text":"identifies the portion of the component being asked to paint, may be null","labels":[]}
{"id":48185,"text":"the desired Locale, or null.","labels":[]}
{"id":48186,"text":"a nested exception","labels":[]}
{"id":48187,"text":"true if this component should be enabled, false otherwise","labels":[]}
{"id":48188,"text":"for a horizontal progress bar, this should be the inside height of the progress bar; this value might be used to constrain or determine the return value","labels":[]}
{"id":48189,"text":"the non-null attributes","labels":[]}
{"id":48190,"text":"the end date, exclusive, which is converted to a LocalDateTime, not null","labels":[]}
{"id":48191,"text":"Parameters to the message (optional, may be none).","labels":[]}
{"id":48192,"text":"the input byte buffer in class file format - must not be modified","labels":[]}
{"id":48193,"text":"The following rules are applied to this parameter: If support for the extended mouse buttons is disabled by Java then it is allowed to create MouseEvent objects only with the standard buttons: NOBUTTON, BUTTON1, BUTTON2, and BUTTON3.","labels":[]}
{"id":48194,"text":"The data that was transferred or possibly null if the action is NONE.","labels":[]}
{"id":48195,"text":"an array of the names of the columns in the inserted row that should be made available for retrieval by a call to the method getGeneratedKeys","labels":[]}
{"id":48196,"text":"the parent component of the dialog, can be null; see showDialog for details","labels":[]}
{"id":48197,"text":"the type whose class value must be computed","labels":[]}
{"id":48198,"text":"The factory must not modify attrs.","labels":[]}
{"id":48199,"text":"a CertSelector specifying the constraints on the target certificate (or null)","labels":[]}
{"id":48200,"text":"the DataFlavor whose corresponding natives should be returned.","labels":[]}
{"id":48201,"text":"true if the node is a leaf node","labels":[]}
{"id":48202,"text":"the non-null object key","labels":[]}
{"id":48203,"text":"an array of column indexes indicating the columns that should be returned from the inserted row","labels":[]}
{"id":48204,"text":"Rectangle within graphics object into which we should paint.","labels":[]}
{"id":48205,"text":"The position within the file at which the transfer is to begin; must be non-negative","labels":[]}
{"id":48206,"text":"the unit to truncate to, not null","labels":[]}
{"id":48207,"text":"a boolean, true if this event is a trigger for a popup-menu","labels":[]}
{"id":48208,"text":"stream to which the file data should be written","labels":[]}
{"id":48209,"text":"a list of Transforms that are to be applied when generating the signature.","labels":[]}
{"id":48210,"text":"If non-null, returns the primitive array in this object","labels":[]}
{"id":48211,"text":"the component whose preferred size is being queried; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":48212,"text":"the prefix to bind to the uri, may not be null","labels":[]}
{"id":48213,"text":"a diagnostic listener; if null use the compiler's default method for reporting diagnostics","labels":[]}
{"id":48214,"text":"a String object that must match the SQL name of a column in this RowSet, ignoring case.","labels":[]}
{"id":48215,"text":"the modifiers, if any, that modify how the object is registered","labels":[]}
{"id":48216,"text":"The reference node, i.e., the node before which the new node must be inserted.","labels":[]}
{"id":48217,"text":"true to indicate that a column value can be used in a WHERE clause; false otherwise","labels":[]}
{"id":48218,"text":"The absolute base URI of the resource being parsed, or null if there is no base URI.","labels":[]}
{"id":48219,"text":"The error handler.","labels":[]}
{"id":48220,"text":"If null, an array of appropriate type and size will be allocated.","labels":[]}
{"id":48221,"text":"The stratum to retrieve information from or null for the declaring type's default stratum.","labels":[]}
{"id":48222,"text":"The possibly null ASN.1 BER encoded value of the response control.","labels":[]}
{"id":48223,"text":"The non-null (but possibly empty) response sent by the client.","labels":[]}
{"id":48224,"text":"true if the previous attributes should be replaced before setting the new attributes","labels":[]}
{"id":48225,"text":"the array into which the elements of this set are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":[]}
{"id":48226,"text":"Characteristics of this spliterator's source or elements (SIZED and SUBSIZED, if supplied, are ignored and are not reported.)","labels":[]}
{"id":48227,"text":"the BEFORE_ROC\/ROC value to represent, from 0 (BEFORE_ROC) to 1 (ROC)","labels":[]}
{"id":48228,"text":"The other Component involved in the focus change, or null","labels":[]}
{"id":48229,"text":"In case the support for extended mouse buttons is enabled by Java, then in addition to the standard buttons, MouseEvent objects can be created using buttons from the range starting from 4 to MouseInfo.getNumberOfButtons() if the mouse has more than three buttons.","labels":[]}
{"id":48230,"text":"The fully qualified host name of the server to authenticate to, or null if the server is not bound to any specific host name.","labels":[]}
{"id":48231,"text":"the time, in milliseconds, before the call aborts","labels":[]}
{"id":48232,"text":"If null, no environment properties will be used.","labels":[]}
{"id":48233,"text":"a Filter object (may be null)","labels":[]}
{"id":48234,"text":"the zone offset, not null","labels":[]}
{"id":48235,"text":"the time-zone to change to, not null","labels":[]}
{"id":48236,"text":"if not null, the rgb pixels are written here","labels":[]}
{"id":48237,"text":"The source buffer from which ints are to be read; must not be this buffer","labels":[]}
{"id":48238,"text":"the tab index where the icon should be set","labels":[]}
{"id":48239,"text":"the dimension of arrays described by this ArrayType instance; must be greater than or equal to 1.","labels":[]}
{"id":48240,"text":"If launched, the Process object for the target VM.","labels":[]}
{"id":48241,"text":"May be null, in which case the prefered templates will be used (i.e.","labels":[]}
{"id":48242,"text":"the base clock to add the duration to, not null","labels":[]}
{"id":48243,"text":"The new replacement; must not be null, must have non-zero length, and must not be longer than the value returned by the maxCharsPerByte method","labels":[]}
{"id":48244,"text":"A null value is permitted, and indicates that the cause is nonexistent or unknown.","labels":[]}
{"id":48245,"text":"element to be removed from this list, if present","labels":[]}
{"id":48246,"text":"the wrapped error.","labels":[]}
{"id":48247,"text":"one of the following constants, listed in ascending order: Connection.TRANSACTION_NONE, Connection.TRANSACTION_READ_UNCOMMITTED, Connection.TRANSACTION_READ_COMMITTED, Connection.TRANSACTION_REPEATABLE_READ, or Connection.TRANSACTION_SERIALIZABLE","labels":[]}
{"id":48248,"text":"the class loader to be used to load provider-configuration files and instantiate provider classes, or null if the system class loader (or, failing that the bootstrap class loader) is to be used.","labels":[]}
{"id":48249,"text":"a component, usually the connection pool manager, that has implemented the ConnectionEventListener interface and wants to be notified when the connection is closed or has an error","labels":[]}
{"id":48250,"text":"the composite data value whose index in this TabularData instance is to be calculated; must be of the same composite type as this instance's row type; must not be null.","labels":[]}
{"id":48251,"text":"true if children should be taken into account","labels":[]}
{"id":48252,"text":"a MessageFormat specifying the text to be used in printing a header, or null for none","labels":[]}
{"id":48253,"text":"The index to query for alignment offset, must be non-negative, no upper bounds check is performed","labels":[]}
{"id":48254,"text":"if true, set this component to be double buffered","labels":[]}
{"id":48255,"text":"the string for the tooltip; if the value is null no tooltip is shown","labels":[]}
{"id":48256,"text":"the period to add, not null","labels":[]}
{"id":48257,"text":"the date-time to check, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":48258,"text":"whether the data are written in top-down order.","labels":[]}
{"id":48259,"text":"any options to use when opening\/creating the file","labels":[]}
{"id":48260,"text":"a mapping function to produce values, must be non-null","labels":[]}
{"id":48261,"text":"true if an object value must be present.","labels":[]}
{"id":48262,"text":"true if the thread executing this task should be interrupted; otherwise, in-progress tasks are allowed to complete","labels":[]}
{"id":48263,"text":"Range starts after refNode","labels":[]}
{"id":48264,"text":"true if a read was truncated","labels":[]}
{"id":48265,"text":"close the underlying socket when this socket is closed","labels":[]}
{"id":48266,"text":"the URL for which the Sequence should be constructed","labels":[]}
{"id":48267,"text":"a measure of the uncertainty that the caller is willing to tolerate: if the call returns true the probability that this BigInteger is prime exceeds (1 - 1\/2certainty).","labels":[]}
{"id":48268,"text":"one of ByteOrder.BIG_ENDIAN or java.nio.ByteOrder.LITTLE_ENDIAN, indicating whether network byte order or its reverse will be used for future reads.","labels":[]}
{"id":48269,"text":"A possibly null string containing additional detail about this exception.","labels":[]}
{"id":48270,"text":"non-null The id of the attribute to add.","labels":[]}
{"id":48271,"text":"a description of the exception.","labels":[]}
{"id":48272,"text":"an ImageWriteParam, or null to use a default ImageWriteParam.","labels":[]}
{"id":48273,"text":"The handback that was specified when the listener was added.","labels":[]}
{"id":48274,"text":"a Set of certificate policy OIDs in string format (or null).","labels":[]}
{"id":48275,"text":"the Date to check (or null)","labels":[]}
{"id":48276,"text":"When the length of the duration is zero, this parameter will be ignored.","labels":[]}
{"id":48277,"text":"Specifies whether or not alt key was depressed during the Event.","labels":[]}
{"id":48278,"text":"false if control buttons should not be shown; otherwise, true","labels":[]}
{"id":48279,"text":"the end date, exclusive, which is converted to a ChronoLocalDate in the same chronology, not null","labels":[]}
{"id":48280,"text":"the GSS error code for the problem causing this exception to be thrown.","labels":[]}
{"id":48281,"text":"a function name pattern; must match the function name as it is stored in the database","labels":[]}
{"id":48282,"text":"the string value, not null","labels":[]}
{"id":48283,"text":"the non-null String to display in the title bar","labels":[]}
{"id":48284,"text":"For example, if value is the string \"true\", it could be rendered as a string or it could be rendered as a check box that is checked.","labels":[]}
{"id":48285,"text":"The possibly null environment that is used in creating the object.","labels":[]}
{"id":48286,"text":"when the number of threads is greater than the core, this is the maximum time that excess idle threads will wait for new tasks before terminating.","labels":[]}
{"id":48287,"text":"if this point lies within a column, the index of that column will be returned; otherwise it is out of bounds and -1 is returned","labels":[]}
{"id":48288,"text":"Indicates whether or not the m-let has been successfully registered in the MBean server.","labels":[]}
{"id":48289,"text":"the pattern to use, not null","labels":[]}
{"id":48290,"text":"The parent (if any) of this raster","labels":[]}
{"id":48291,"text":"The non-null name of the object.","labels":[]}
{"id":48292,"text":"The possibly null class name of the object bound to name.","labels":[]}
{"id":48293,"text":"the node to determinate whether it is a child","labels":[]}
{"id":48294,"text":"if true, getAllowsChildren() is messaged, otherwise isLeaf() is messaged","labels":[]}
{"id":48295,"text":"This should be a value less than or equal to the elements end offset and greater than the elements starting offset.","labels":[]}
{"id":48296,"text":"A possibly null message explaining the problem.","labels":[]}
{"id":48297,"text":"if true, the menu is a tear-off menu.","labels":[]}
{"id":48298,"text":"the time when bundle was loaded and put in the cache","labels":[]}
{"id":48299,"text":"true if the upcoming changes to the value property are part of a series","labels":[]}
{"id":48300,"text":"the 2nd error message argument","labels":[]}
{"id":48301,"text":"an optional list of attributes to set atomically when creating the file","labels":[]}
{"id":48302,"text":"JFormattedTextField to format for, may be null indicating uninstall from current JFormattedTextField.","labels":[]}
{"id":48303,"text":"of the field to get, not null","labels":[]}
{"id":48304,"text":"the URL for which the AudioInputStream should be constructed","labels":[]}
{"id":48305,"text":"This value can be null to indicate no children are being added (useful to remove).","labels":[]}
{"id":48306,"text":"if true, establishes local first-in-first-out scheduling mode for forked tasks that are never joined.","labels":[]}
{"id":48307,"text":"This must be an instance of class PrinterStateReason","labels":[]}
{"id":48308,"text":"the method handle to invoke after filtering the subsequence of arguments","labels":[]}
{"id":48309,"text":"a reason message with additional information or null","labels":[]}
{"id":48310,"text":"the unit to measure the amount in, not null","labels":[]}
{"id":48311,"text":"If null and there is a security manager, the group is determined by SecurityManager.getThreadGroup().","labels":[]}
{"id":48312,"text":"If true then resolve the class","labels":[]}
{"id":48313,"text":"If false, the reader may return -1 without performing the search.","labels":[]}
{"id":48314,"text":"If non-null, returns the samples in this array.","labels":[]}
{"id":48315,"text":"whether the text range is selected","labels":[]}
{"id":48316,"text":"The node to check to see if it passes the filter or not.","labels":[]}
{"id":48317,"text":"the Runnable whose run method should be executed asynchronously in the event dispatch thread of the system EventQueue","labels":[]}
{"id":48318,"text":"true implies the track should be solo'd, false implies the track should not be solo'd.","labels":[]}
{"id":48319,"text":"the parsed text, should not be null","labels":[]}
{"id":48320,"text":"the character set to use when converting bytes to characters","labels":[]}
{"id":48321,"text":"true if this invocation completes the message, false otherwise","labels":[]}
{"id":48322,"text":"if true include \"subpackages\"","labels":[]}
{"id":48323,"text":"the specification class in which the key material should be returned.","labels":[]}
{"id":48324,"text":"the number of bytes in the stream; lengths of 0 or less are are undefined but will cause an invalid length exception to be thrown in the underlying JDBC driver.","labels":[]}
{"id":48325,"text":"the number of rows; if rows is less than 0, rows is set to 0","labels":[]}
{"id":48326,"text":"Value to return if the property has not been specified, or is not a Number","labels":[]}
{"id":48327,"text":"If the Window is already visible, this will bring the Window to the front.","labels":[]}
{"id":48328,"text":"if true, marks this thread group as a daemon thread group; otherwise, marks this thread group as normal.","labels":[]}
{"id":48329,"text":"the other date-time to compare to, not null","labels":[]}
{"id":48330,"text":"documentation tool options and doclet options, null means no options","labels":[]}
{"id":48331,"text":"May be null or empty.","labels":[]}
{"id":48332,"text":"Not currently used so it can be null.","labels":[]}
{"id":48333,"text":"an array of Strings indicating additional formats supported by this object, or null if there are none.","labels":[]}
{"id":48334,"text":"If null, the natural ordering of the elements will be used.","labels":[]}
{"id":48335,"text":"Action to perform when the state terminates.","labels":[]}
{"id":48336,"text":"an event object describing the source of the event, the statement that is invalid and the exception the driver is about to throw.","labels":[]}
{"id":48337,"text":"the modifier keys down during event (shift, ctrl, alt, meta) Either extended _DOWN_MASK or old _MASK modifiers should be used, but both models should not be mixed in one event.","labels":[]}
{"id":48338,"text":"This parameter is ignored if its value is greater than or equal to the actual signature length.","labels":[]}
{"id":48339,"text":"the retrieved password, which may be null.","labels":[]}
{"id":48340,"text":"new Dictionary of labels, or null to remove all labels","labels":[]}
{"id":48341,"text":"a diagnostic listener; if null use the tool's default method for reporting diagnostics","labels":[]}
{"id":48342,"text":"the non-null URL for the new splash screen image","labels":[]}
{"id":48343,"text":"the unit of the amount to add, not null","labels":[]}
{"id":48344,"text":"if true, then multiple selections are allowed; otherwise, only one item can be selected at a time.","labels":[]}
{"id":48345,"text":"an array of Objects, a Vector, or a Hashtable used to create the child nodes; if any other object is specified, or if the value is null, then the node is not allowed to have children","labels":[]}
{"id":48346,"text":"If true, certificates are presented from target to most-trusted CA (forward); if false, from most-trusted CA to target (reverse).","labels":[]}
{"id":48347,"text":"The expected binary name of the class, or null if not known","labels":[]}
{"id":48348,"text":"the other date to compare to, not null","labels":[]}
{"id":48349,"text":"a list of table types, which must be from the list of table types returned from getTableTypes(),to include; null returns all types","labels":[]}
{"id":48350,"text":"the maximum number of integer digits to be shown; if less than zero, then zero is used.","labels":[]}
{"id":48351,"text":"It may be null.","labels":[]}
{"id":48352,"text":"True if this is a bound property.","labels":[]}
{"id":48353,"text":"the adjuster to use, not null","labels":[]}
{"id":48354,"text":"whether or not to verify the jar file if it is signed.","labels":[]}
{"id":48355,"text":"the other instant to compare to, not null","labels":[]}
{"id":48356,"text":"a java.util.Calendar object to use when when constructing the date","labels":[]}
{"id":48357,"text":"the annotations on the value descriptors, not null","labels":[]}
{"id":48358,"text":"In that case, this method must return a non-null ObjectName for the new MBean.","labels":[]}
{"id":48359,"text":"the output stream, non-null","labels":[]}
{"id":48360,"text":"Note that the order in which the item names are given is not important to differentiate a CompositeType instance from another; the item names are internally stored sorted in ascending alphanumeric order.","labels":[]}
{"id":48361,"text":"true if the path has been expanded","labels":[]}
{"id":48362,"text":"A boolean that equals true if this event is a trigger for a popup menu","labels":[]}
{"id":48363,"text":"The possibly null name containing ordered components to add.","labels":[]}
{"id":48364,"text":"the Instrument object to be used in place of the old instrument, it should be loaded into the synthesizer","labels":[]}
{"id":48365,"text":"the subject public key to check for (or null)","labels":[]}
{"id":48366,"text":"the File for which the AudioInputStream should be constructed","labels":[]}
{"id":48367,"text":"the Action for the JComboBox, or null.","labels":[]}
{"id":48368,"text":"a int object that must match the SQL index of a column in this RowSet object.","labels":[]}
{"id":48369,"text":"the value of the property to add; may not be null","labels":[]}
{"id":48370,"text":"The public identifier of the external entity being referenced (normalized as required by the XML specification), or null if none was supplied.","labels":[]}
{"id":48371,"text":"true if table view should draw horizontal lines","labels":[]}
{"id":48372,"text":"A possibly null object containing information about the change.","labels":[]}
{"id":48373,"text":"The new error event handler.","labels":[]}
{"id":48374,"text":"the local time, not null","labels":[]}
{"id":48375,"text":"the attributes to assign to the new Font, or null","labels":[]}
{"id":48376,"text":"the ProtectionDomains inherited from the parent Thread, or the ProtectionDomains from the privileged context, if a call to AccessController.doPrivileged(..., context) had occurred This parameter may be null if there were no ProtectionDomains inherited from the parent Thread, or from the privileged context.","labels":[]}
{"id":48377,"text":"the other duration, null returns false","labels":[]}
{"id":48378,"text":"true if newly accepted connections should use SSL client mode.","labels":[]}
{"id":48379,"text":"If support for extended mouse buttons is enabled by Java then it is allowed to use the standard button masks and masks for existing extended mouse buttons, if the mouse has more then three buttons.","labels":[]}
{"id":48380,"text":"the CallbackHandler used by this provider to obtain authentication information from the caller, which may be null","labels":[]}
{"id":48381,"text":"The name of the MBean on which the listener should be removed.","labels":[]}
{"id":48382,"text":"the operator to apply after this operator is applied","labels":[]}
{"id":48383,"text":"A function, which when called, produces the desired log message","labels":[]}
{"id":48384,"text":"the event class, not null","labels":[]}
{"id":48385,"text":"initial PrintService, or null for the default","labels":[]}
{"id":48386,"text":"The non-null scheme-id of the URLs supported by the context.","labels":[]}
{"id":48387,"text":"an offset associated with the character before the offset","labels":[]}
{"id":48388,"text":"if true, the flag is enabled; if false, the flag is disabled.","labels":[]}
{"id":48389,"text":"true if the editor should get the focus when keystrokes cause the editor to be activated","labels":[]}
{"id":48390,"text":"the factory to use when creating new threads","labels":[]}
{"id":48391,"text":"This can be 0 to indicate that the method should not wait if there are no notifications, but should return at once.","labels":[]}
{"id":48392,"text":"The parameter types represent the types of dynamic concatenation arguments; the return type is always assignable from String.","labels":[]}
{"id":48393,"text":"the detail message of this exception.","labels":[]}
{"id":48394,"text":"Describes the reason for the exception.","labels":[]}
{"id":48395,"text":"the queue with which the reference is to be registered, or null if registration is not required","labels":[]}
{"id":48396,"text":"Both this default implementation and the SUN provider do not return partial digests.","labels":[]}
{"id":48397,"text":"The offset within the array of the first short to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":48398,"text":"a boolean indicating if the drop was successful","labels":[]}
{"id":48399,"text":"a boolean value, true if the tree is editable","labels":[]}
{"id":48400,"text":"An object representing value of the attribute after the change.","labels":[]}
{"id":48401,"text":"A non-null enumeration containing the components for the new composite name.","labels":[]}
{"id":48402,"text":"the Locale for which the color is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":48403,"text":"A null value for o or n indicates that no value was present for k in the corresponding configuration.","labels":[]}
{"id":48404,"text":"If the timeout period expires before the operation completes, this method returns false.","labels":[]}
{"id":48405,"text":"true if the button's text property should not reflect that of the Action; the default is false","labels":[]}
{"id":48406,"text":"Passing negative value is not recommended","labels":[]}
{"id":48407,"text":"The error object that describes the error.","labels":[]}
{"id":48408,"text":"true if the paint messages from the OS should be ignored; otherwise false","labels":[]}
{"id":48409,"text":"The source buffer from which longs are to be read; must not be this buffer","labels":[]}
{"id":48410,"text":"True if the source is in the same JVM as the target","labels":[]}
{"id":48411,"text":"the public identifier of the external entity being referenced, or null if no public identifier was supplied or if the resource is not an entity.","labels":[]}
{"id":48412,"text":"true if unknown tags should be saved in the model, otherwise tags are dropped","labels":[]}
{"id":48413,"text":"The first element must be greater than 0.","labels":[]}
{"id":48414,"text":"true to indicate that the column name is case sensitive; false otherwise","labels":[]}
{"id":48415,"text":"The cause; can be null","labels":[]}
{"id":48416,"text":"The possibly null attribute value to use.","labels":[]}
{"id":48417,"text":"a constant indicating whether auto-generated keys should be made available for retrieval using the method getGeneratedKeys; one of the following constants: Statement.RETURN_GENERATED_KEYS or Statement.NO_GENERATED_KEYS","labels":[]}
{"id":48418,"text":"Otherwise, the package is not sealed.","labels":[]}
{"id":48419,"text":"if true, return the daylight saving name.","labels":[]}
{"id":48420,"text":"the non-null text to insert","labels":[]}
{"id":48421,"text":"if true, enables this menu item; if false, disables it.","labels":[]}
{"id":48422,"text":"If zero, block indefinitely.","labels":[]}
{"id":48423,"text":"the method handle to invoke before filtering the return value","labels":[]}
{"id":48424,"text":"If the descriptor does not contain all the following fields, the missing ones are added with their default values: displayName, name, role, descriptorType.","labels":[]}
{"id":48425,"text":"the requested type of resolve, not null","labels":[]}
{"id":48426,"text":"the request to open a list of files, and the search term used to find them, if any.","labels":[]}
{"id":48427,"text":"The maximum number of ints to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":48428,"text":"The non-null name for which to get the context.","labels":[]}
{"id":48429,"text":"the possibly null object to compare against.","labels":[]}
{"id":48430,"text":"The map may be empty but never null.","labels":[]}
{"id":48431,"text":"additional contextual class loader to use, or null","labels":[]}
{"id":48432,"text":"the SizeRequirements object; if null one will be created","labels":[]}
{"id":48433,"text":"The human readable description of the composite type this instance represents; cannot be a null or empty string.","labels":[]}
{"id":48434,"text":"a boolean value that determines whether the rectangle appears to be raised above the surface or etched into the surface.","labels":[]}
{"id":48435,"text":"how to expand the tabs when encountered.","labels":[]}
{"id":48436,"text":"Passing negative or zero value is not recommended","labels":[]}
{"id":48437,"text":"null value and unsupported modality types are equivalent to MODELESS","labels":[]}
{"id":48438,"text":"an array of objects containing the values of the arguments passed in the method invocation on the proxy instance, or null if interface method takes no arguments.","labels":[]}
{"id":48439,"text":"event to pass into shouldSelectCell; note that as of Java 2 platform v1.2, the call to shouldSelectCell is no longer made","labels":[]}
{"id":48440,"text":"The non-null challenge sent from the server.","labels":[]}
{"id":48441,"text":"the position in this SerialClob object at which to begin the search; the first position is 1; must not be less than 1 nor greater than the length of this SerialClob object","labels":[]}
{"id":48442,"text":"the exception causing this thread to abort due to an unrecoverable error, or null if completed normally","labels":[]}
{"id":48443,"text":"the algorithm parameters (may be null if not required or optional)","labels":[]}
{"id":48444,"text":"This is never null when invoked by a SAX2 parser; only declared entities, and any external subset, are resolved by such parsers.","labels":[]}
{"id":48445,"text":"one of the following values : UPDATE_WHEN_ON_EDT, NEVER_UPDATE, ALWAYS_UPDATE","labels":[]}
{"id":48446,"text":"A null value is treated as an empty string, \"\".","labels":[]}
{"id":48447,"text":"a description of the exception","labels":[]}
{"id":48448,"text":"If null, the default search controls are used.","labels":[]}
{"id":48449,"text":"The non-null object for which to get state to bind.","labels":[]}
{"id":48450,"text":"the name of the exception","labels":[]}
{"id":48451,"text":"the possibly-null value to describe","labels":[]}
{"id":48452,"text":"the I\/O exception that prevented the file from being visited","labels":[]}
{"id":48453,"text":"a type name pattern; must match the type name as it is stored in the database","labels":[]}
{"id":48454,"text":"If null, equivalent to an empty array.","labels":[]}
{"id":48455,"text":"the bound service principal, must not be null","labels":[]}
{"id":48456,"text":"true if this node is allowed to have children","labels":[]}
{"id":48457,"text":"whether node is a lead node","labels":[]}
{"id":48458,"text":"a table name; must match the table name as it is stored in the database","labels":[]}
{"id":48459,"text":"when true, parsing is lenient","labels":[]}
{"id":48460,"text":"the first column is 1, the second is 2, and so on; must be between 1 and the number of columns, inclusive","labels":[]}
{"id":48461,"text":"The possibly null array of arguments for the filter.","labels":[]}
{"id":48462,"text":"if true, interval inserts before the index, otherwise, interval inserts after the index","labels":[]}
{"id":48463,"text":"a byte array that will contain the requested input data when this method returns","labels":[]}
{"id":48464,"text":"If false, this rule selects the last endDayOfWeek on or before endDay of the month.","labels":[]}
{"id":48465,"text":"the object to check, null returns false","labels":[]}
{"id":48466,"text":"true if the cell is to be rendered with the selection highlighted; otherwise false","labels":[]}
{"id":48467,"text":"indicates if the value of the specified time field is to be rolled up or rolled down.","labels":[]}
{"id":48468,"text":"Can be null if that is a valid value for the field.","labels":[]}
{"id":48469,"text":"If the mechanism does not allow an unbound server, a SaslException will be thrown.","labels":[]}
{"id":48470,"text":"an IIOMetadata object, or null.","labels":[]}
{"id":48471,"text":"true if the attribute's getter is of the form isXXX.","labels":[]}
{"id":48472,"text":"the queries defining the types to attempt to parse to, must implement TemporalAccessor, not null","labels":[]}
{"id":48473,"text":"the modal exclusion type for this window; a null value is equivalent to NO_EXCLUDE","labels":[]}
{"id":48474,"text":"the child node to look for next child after it","labels":[]}
{"id":48475,"text":"the ImageObserver to be notified as more of the Image is converted","labels":[]}
{"id":48476,"text":"The node to add.If it is a DocumentFragment object, the entire contents of the document fragment are moved into the child list of this node","labels":[]}
{"id":48477,"text":"The possibly null attributes containing some of obj's attributes.","labels":[]}
{"id":48478,"text":"This can be null.","labels":[]}
{"id":48479,"text":"the specification class in which the parameters should be returned.","labels":[]}
{"id":48480,"text":"May not be null.","labels":[]}
{"id":48481,"text":"a map of key\/value pairs to initialize the hints or null if the object should be empty","labels":[]}
{"id":48482,"text":"the X509Certificate to match (or null)","labels":[]}
{"id":48483,"text":"Resource bundle to localize msg, can be null.","labels":[]}
{"id":48484,"text":"If the underlying file system can not distinguish the owner's execute permission from that of others, then the permission will apply to everybody, regardless of this value.","labels":[]}
{"id":48485,"text":"the new ErrorManager","labels":[]}
{"id":48486,"text":"Cannot be null or empty.","labels":[]}
{"id":48487,"text":"the starting offset into b of where the data should be placed.","labels":[]}
{"id":48488,"text":"the new last modified time, or null to not change the value","labels":[]}
{"id":48489,"text":"if true, retrieves all locked monitors.","labels":[]}
{"id":48490,"text":"The preferred peer address of the association to send the message to, or null to use the peer primary address","labels":[]}
{"id":48491,"text":"an integer designating the kind of message this is; primarily used to determine the icon from the pluggable Look and Feel: ERROR_MESSAGE, INFORMATION_MESSAGE, WARNING_MESSAGE, QUESTION_MESSAGE, or PLAIN_MESSAGE","labels":[]}
{"id":48492,"text":"specifies whether dialog blocks user input to other top-level windows when shown.","labels":[]}
{"id":48493,"text":"A null value indicates the unnamed package that is \"current\" (see section 7.4.2 of The Java™ Language Specification.)","labels":[]}
{"id":48494,"text":"This name is null if the name parameter to one of the createMBean or registerMBean methods in the MBeanServer interface is null.","labels":[]}
{"id":48495,"text":"Flight Recorder instance, not null","labels":[]}
{"id":48496,"text":"the kind of file, must be one of SOURCE or CLASS","labels":[]}
{"id":48497,"text":"the FormatStyle for the time, null for date-only pattern","labels":[]}
{"id":48498,"text":"true if the value is a cash value; false otherwise.","labels":[]}
{"id":48499,"text":"detail message to be used in the event that a NullPointerException is thrown","labels":[]}
{"id":48500,"text":"Its result type must be boolean.","labels":[]}
{"id":48501,"text":"the position where the error is found while parsing.","labels":[]}
{"id":48502,"text":"WindowEvent types, because the opposite Window of other event types will always be null.","labels":[]}
{"id":48503,"text":"the object to be compared for equality with this TabularType instance; if obj is null, equals returns false.","labels":[]}
{"id":48504,"text":"Specifies whether or not control key was depressed during the Event.","labels":[]}
{"id":48505,"text":"The value of this object after startElement returns is undefined","labels":[]}
{"id":48506,"text":"For example, user snippet System.err.println(\"Oops\") when executed Oops goes to userErr.","labels":[]}
{"id":48507,"text":"the rectangle where the result should be placed","labels":[]}
{"id":48508,"text":"the optional exception type that is when thrown by the invocation also invalidates it.","labels":[]}
{"id":48509,"text":"the exception to convert","labels":[]}
{"id":48510,"text":"the Date to match against (or null)","labels":[]}
{"id":48511,"text":"If direct connection is desired, Proxy.NO_PROXY should be specified.","labels":[]}
{"id":48512,"text":"The new possibly null value to add.","labels":[]}
{"id":48513,"text":"May be null, which represents an object name that is implied by any object name but does not imply any other object name.","labels":[]}
{"id":48514,"text":"a List of BufferedImage thumbnails, or null.","labels":[]}
{"id":48515,"text":"true if the complete pixel buffer should always be sent","labels":[]}
{"id":48516,"text":"the current (non null) Date for this sequence","labels":[]}
{"id":48517,"text":"the controlling options for executing the VM in another process (or null).","labels":[]}
{"id":48518,"text":"Specifies whether or not the event's default action can be prevented.","labels":[]}
{"id":48519,"text":"If null no query expression will be applied for selecting MBeans.","labels":[]}
{"id":48520,"text":"if true then only icon is painted","labels":[]}
{"id":48521,"text":"The non-null control object containing the OID and BER data.","labels":[]}
{"id":48522,"text":"the duration to add, not null","labels":[]}
{"id":48523,"text":"the Locale for which the icon is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":48524,"text":"The offset within the string of the first char to be read; must be non-negative and no larger than string.length()","labels":[]}
{"id":48525,"text":"the nested error.","labels":[]}
{"id":48526,"text":"whether or not components should be vertically aligned on their baseline","labels":[]}
{"id":48527,"text":"The JAR file to be searched when the bootstrap class loader unsuccessfully searches for a class.","labels":[]}
{"id":48528,"text":"the Clob object from which this SerialClob object is to be constructed; cannot be null","labels":[]}
{"id":48529,"text":"the action to be performed, if a value is present","labels":[]}
{"id":48530,"text":"A new error handler to be set.","labels":[]}
{"id":48531,"text":"string to return if the first argument is null","labels":[]}
{"id":48532,"text":"If of zero length, the returns result will be a default instance of SizeRequirements.","labels":[]}
{"id":48533,"text":"When the SASL authentication completes successfully, the specified entity is granted access.","labels":[]}
{"id":48534,"text":"true means this attribute set will ignore the case of its attribute identifiers when retrieving or adding attributes; false means case is respected.","labels":[]}
{"id":48535,"text":"the other year to compare to, not null","labels":[]}
{"id":48536,"text":"The color to return if no color was obtained from the component.","labels":[]}
{"id":48537,"text":"This value is conveyed to tryReleaseShared(long) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":48538,"text":"the class that the hook should run for, not null","labels":[]}
{"id":48539,"text":"the Executor to set, or null for default implementation","labels":[]}
{"id":48540,"text":"a catalog name; must match the catalog name as it is stored in the database; \"\" retrieves those without a catalog; null means drop catalog name from the selection criteria","labels":[]}
{"id":48541,"text":"If the underlying file system can not distinguish the owner's write permission from that of others, then the permission will apply to everybody, regardless of this value.","labels":[]}
{"id":48542,"text":"Indicates whether or not the MBean has been successfully registered in the MBean server.","labels":[]}
{"id":48543,"text":"It is allowed to use only a combination of valid values as a buttons parameter.","labels":[]}
{"id":48544,"text":"the text, in MessageFormat, to be used as the header, or null for no header","labels":[]}
{"id":48545,"text":"the message type (INFORMATION, WARNING or ERROR).","labels":[]}
{"id":48546,"text":"If empty or null, all objects in the target context are returned.","labels":[]}
{"id":48547,"text":"the MBean server to which the new connector server is attached, or null if it will be attached by being registered as an MBean in the MBean server.","labels":[]}
{"id":48548,"text":"the ActionListener invoked when \"OK\" is pressed","labels":[]}
{"id":48549,"text":"boolean if true, then data will be written to the end of the file rather than the beginning.","labels":[]}
{"id":48550,"text":"if true, html form submission is processed automatically.","labels":[]}
{"id":48551,"text":"a schema name; must match the schema name as it is stored in the database; \"\" retrieves those without a schema; null means drop schema name from the selection criteria","labels":[]}
{"id":48552,"text":"the localdate, not null","labels":[]}
{"id":48553,"text":"true if this AWTKeyStroke corresponds to a key release; false otherwise","labels":[]}
{"id":48554,"text":"the temporal object to subtract the amount from, not null","labels":[]}
{"id":48555,"text":"if true, synthetic mouse dragged events are generated when the mouse is dragged outside of a component's bounds and the mouse button continues to be held down; otherwise false","labels":[]}
{"id":48556,"text":"a description of the error","labels":[]}
{"id":48557,"text":"the non-null key of the attribute binding","labels":[]}
{"id":48558,"text":"the amount to add, not null","labels":[]}
{"id":48559,"text":"the new client property value; if null this method will remove the property","labels":[]}
{"id":48560,"text":"For default value, use null.","labels":[]}
{"id":48561,"text":"For example, if props contains the Sasl.POLICY_NOPLAINTEXT property with the value \"true\", then the selected SASL mechanism must not be susceptible to simple plain passive attacks.","labels":[]}
{"id":48562,"text":"Must be an XML document or XML element and must not be null.","labels":[]}
{"id":48563,"text":"the text to parse such as \"2007-12\", not null","labels":[]}
{"id":48564,"text":"the offset to use for the conversion, not null","labels":[]}
{"id":48565,"text":"the open type of element values contained in the arrays described by this ArrayType instance; must be an instance of either SimpleType, CompositeType, TabularType or another ArrayType with a SimpleType, CompositeType or TabularType as its elementType.","labels":[]}
{"id":48566,"text":"a schema pattern name; must match the schema name as it is stored in the database; \"\" retrieves those without a schema; null means that the schema name should not be used to narrow the search","labels":[]}
{"id":48567,"text":"true for invoking sync on relink, false otherwise.","labels":[]}
{"id":48568,"text":"destination of tool start-up and fatal errors","labels":[]}
{"id":48569,"text":"Must not be less than the start of newParagraph, and must be less than the end of newParagraph.","labels":[]}
{"id":48570,"text":"If host is a numeric IPv6 address, it can optionally be enclosed in square brackets [].","labels":[]}
{"id":48571,"text":"the events for which this object should be registered","labels":[]}
{"id":48572,"text":"The possibly null object identifier of the response control.","labels":[]}
{"id":48573,"text":"True if the specified cell has the focus.","labels":[]}
{"id":48574,"text":"the local name of the attribute, cannot be null","labels":[]}
{"id":48575,"text":"the type of exception which the handler will catch","labels":[]}
{"id":48576,"text":"if true dump only live objects i.e.","labels":[]}
{"id":48577,"text":"the ImageWriteParam that will be used for writing, or null.","labels":[]}
{"id":48578,"text":"if true, makes the Window visible, otherwise hides the Window.","labels":[]}
{"id":48579,"text":"The declared public identifier for the external DTD subset, or null if none was declared.","labels":[]}
{"id":48580,"text":"the source of randomness for this generator or null","labels":[]}
{"id":48581,"text":"true if the key is pressed","labels":[]}
{"id":48582,"text":"The possibly null callback handler to used by the SASL mechanisms to get further information from the application\/library to complete the authentication.","labels":[]}
{"id":48583,"text":"the new HijrahChonology, non-null","labels":[]}
{"id":48584,"text":"whether local cipher suites order in #getCipherSuites should be honored during SSL\/TLS\/DTLS handshaking.","labels":[]}
{"id":48585,"text":"a distinguished name in RFC 2253 format (or null)","labels":[]}
{"id":48586,"text":"a WritableRaster to hold the returned part of the image, or null","labels":[]}
{"id":48587,"text":"The other window involved in the focus or activation change, or null","labels":[]}
{"id":48588,"text":"the name of the native metadata format, as a String, or null if there is no native format.","labels":[]}
{"id":48589,"text":"the stream to which the file data should be written","labels":[]}
{"id":48590,"text":"options specifying how the move should be done","labels":[]}
{"id":48591,"text":"whether component visibility is considered when sizing and positioning components","labels":[]}
{"id":48592,"text":"This may not be null.","labels":[]}
{"id":48593,"text":"true if compact numbers should be parsed as integers only; false otherwise","labels":[]}
{"id":48594,"text":"a catalog name; must match the catalog name as it is stored in this database; \"\" retrieves those without a catalog; null means that the catalog name should not be used to narrow the search","labels":[]}
{"id":48595,"text":"the time-zone to use, not null","labels":[]}
{"id":48596,"text":"the Supplier to generate the temporary variable name string or null","labels":[]}
{"id":48597,"text":"The names of the items contained in the composite data values described by this CompositeType instance; cannot be null and should contain at least one element; no element can be a null or empty string.","labels":[]}
{"id":48598,"text":"Its value must be \"1.3.6.1.4.1.1466.20037\" or null.","labels":[]}
{"id":48599,"text":"The combo box value or null for no selection.","labels":[]}
{"id":48600,"text":"the object to be compared for equality with this ArrayType instance; if obj is null or is not an instance of the class ArrayType this method returns false.","labels":[]}
{"id":48601,"text":"an ImageReadParam to be used to get the destination image or image type, or null.","labels":[]}
{"id":48602,"text":"This is always an absolute URI, unless it is null because the XMLReader was given an InputSource without one.","labels":[]}
{"id":48603,"text":"if true, the content should be filled; if false the content area is not filled","labels":[]}
{"id":48604,"text":"the month-of-year to set in the returned month-day, not null","labels":[]}
{"id":48605,"text":"additively modifies the ARGB alpha component of the color returned (ignored if default color is returned).","labels":[]}
{"id":48606,"text":"the Chronology, non-null","labels":[]}
{"id":48607,"text":"the space between icon and text if these properties are set.","labels":[]}
{"id":48608,"text":"If true, recursively clone the subtree under the specified node; if false, clone only the node itself (and its attributes, if it is an Element).","labels":[]}
{"id":48609,"text":"the component from which this UI delegate is being removed; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":48610,"text":"a boolean indicating whether a cache file should be used, in cases where it is optional.","labels":[]}
{"id":48611,"text":"the new Object to which the event should be dispatched","labels":[]}
{"id":48612,"text":"insertion point); null if there's no caret within current composed text","labels":[]}
{"id":48613,"text":"the other comparator to be used when this comparator compares two objects that are equal.","labels":[]}
{"id":48614,"text":"the minimum number of fraction digits to be shown; if less than zero, then zero is used.","labels":[]}
{"id":48615,"text":"This parameter can be null, which is equivalent to an empty map.","labels":[]}
{"id":48616,"text":"the input stream from which file format information should be extracted","labels":[]}
{"id":48617,"text":"the schema name for the table from which a value in the designated column was derived; may be an empty String or null","labels":[]}
{"id":48618,"text":"If not null, then this package is sealed with respect to the given code source URL object.","labels":[]}
{"id":48619,"text":"one of the following Statement constants indicating what should happen to current ResultSet objects obtained using the method getResultSet: Statement.CLOSE_CURRENT_RESULT, Statement.KEEP_CURRENT_RESULT, or Statement.CLOSE_ALL_RESULTS","labels":[]}
{"id":48620,"text":"the locale to use to obtain the calendar system, not null","labels":[]}
{"id":48621,"text":"The parent (if any) of this raster.","labels":[]}
{"id":48622,"text":"The prefix to lookup, may not be null","labels":[]}
{"id":48623,"text":"the host name, or null for the loopback address.","labels":[]}
{"id":48624,"text":"the first list, may be empty but not null","labels":[]}
{"id":48625,"text":"the event the editor should use to consider whether to begin editing or not","labels":[]}
{"id":48626,"text":"the desired type of the value to be returned, which must be compatible with the return type of the method handle","labels":[]}
{"id":48627,"text":"specifies whether dialog blocks input to other windows when shown; calling to setModal(true) is equivalent to setModalityType(Dialog.DEFAULT_MODALITY_TYPE), and calling to setModal(false) is equivalent to setModalityType(Dialog.ModalityType.MODELESS)","labels":[]}
{"id":48628,"text":"the maximum distance that the control points for a subdivided curve can be with respect to a line connecting the end points of this curve before this curve is replaced by a straight line connecting the end points.","labels":[]}
{"id":48629,"text":"The realm is requested by using a RealmChoiceCallback if there is a list of realms to choose from, and by using a RealmCallback if the realm must be entered.","labels":[]}
{"id":48630,"text":"the index in the parsed string that was invalid, should be a valid index","labels":[]}
{"id":48631,"text":"The possibly null environment to be used in the creation of the state factory and the object's state.","labels":[]}
{"id":48632,"text":"If the array is empty (zero-length), protocol indications will not be used.","labels":[]}
{"id":48633,"text":"the location of the error","labels":[]}
{"id":48634,"text":"the URL from which file format information should be extracted","labels":[]}
{"id":48635,"text":"true if no dialog decorations are to be enabled; false if dialog decorations are to be enabled","labels":[]}
{"id":48636,"text":"a Set of initial policy OIDs in String format (or null)","labels":[]}
{"id":48637,"text":"The fieldValue must be valid for the fieldName (as defined in method isValid) Note: array sizes of parameters should match.","labels":[]}
{"id":48638,"text":"a Throwable associated with log message; can be null.","labels":[]}
{"id":48639,"text":"It must be a flavor supported by this PrintJob.","labels":[]}
{"id":48640,"text":"The prefix to apply to wrapped native methods when retrying a failed native method resolution.","labels":[]}
{"id":48641,"text":"the public identifier of the external entity being referenced, or null if none was supplied","labels":[]}
{"id":48642,"text":"the object reference with which to compare for equality, which may be null","labels":[]}
{"id":48643,"text":"All changes made after s was set will be made permanent.","labels":[]}
{"id":48644,"text":"the SQLException about to be thrown to the application","labels":[]}
{"id":48645,"text":"the new set of resolver fields, null if no fields","labels":[]}
{"id":48646,"text":"a Rectangle specifying the source region of interest, or null.","labels":[]}
{"id":48647,"text":"The possibly null value to check.","labels":[]}
{"id":48648,"text":"whether or not this table is always made large enough to fill the height of an enclosing viewport","labels":[]}
{"id":48649,"text":"how long to wait before giving up, in units of unit","labels":[]}
{"id":48650,"text":"This parameter may be null.","labels":[]}
{"id":48651,"text":"a Writer for additional output from the compiler; use System.err if null","labels":[]}
{"id":48652,"text":"the object to be sealed; can be null.","labels":[]}
{"id":48653,"text":"the arguments to pass to the method handle, as if with MethodHandle.invokeWithArguments(java.lang.Object...).","labels":[]}
{"id":48654,"text":"the queue to use for holding tasks before they are executed.","labels":[]}
{"id":48655,"text":"A possibly null root exception that caused this exception.","labels":[]}
{"id":48656,"text":"method handle to call if test passes","labels":[]}
{"id":48657,"text":"the current (non null) value of the model","labels":[]}
{"id":48658,"text":"The kind of method handle to be described; must be one of SPECIAL, VIRTUAL, STATIC, INTERFACE_SPECIAL, INTERFACE_VIRTUAL, INTERFACE_STATIC, CONSTRUCTOR","labels":[]}
{"id":48659,"text":"the combined committed and composed text, committed text first; must be null when the event type is CARET_POSITION_CHANGED; may be null for INPUT_METHOD_TEXT_CHANGED if there's no committed or composed text","labels":[]}
{"id":48660,"text":"the wrapped exception.","labels":[]}
{"id":48661,"text":"Component mouse coordinates are relative to, may be null","labels":[]}
{"id":48662,"text":"If the class is null, a vendor specific Source implementation will be returned.","labels":[]}
{"id":48663,"text":"If the SQL AS clause was not specified, then the label is the name of the column","labels":[]}
{"id":48664,"text":"Must be in the range [0,size()).","labels":[]}
{"id":48665,"text":"The new MBeanServer must register this MBean in its MBean repository.","labels":[]}
{"id":48666,"text":"whether or not to print in an interactive mode","labels":[]}
{"id":48667,"text":"The new replacement; must not be null, must have non-zero length, must not be longer than the value returned by the maxBytesPerChar method, and must be legal","labels":[]}
{"id":48668,"text":"a resource bundle to localize msg; can be null.","labels":[]}
{"id":48669,"text":"whether or not the returned Sequencer is connected to the default Synthesizer","labels":[]}
{"id":48670,"text":"the Locale for which the int is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":48671,"text":"The date when the notification occurs.","labels":[]}
{"id":48672,"text":"names of classes to be processed by annotation processing, null means no class names","labels":[]}
{"id":48673,"text":"true means do not initialize the initial context; false is equivalent to calling new InitialContext()","labels":[]}
{"id":48674,"text":"a stream to which any error messages should be written","labels":[]}
{"id":48675,"text":"specify false to make the timer stop after sending its first action event","labels":[]}
{"id":48676,"text":"the Throwable (Error or Exception) that caused this exception to occur, or null.","labels":[]}
{"id":48677,"text":"the certificate serial number to match (or null)","labels":[]}
{"id":48678,"text":"module and\/or package relative to which the file should be searched for, or the empty string if none","labels":[]}
{"id":48679,"text":"the last date in the sequence or null","labels":[]}
{"id":48680,"text":"Only the value of the extension is included, not the OID or criticality flag.","labels":[]}
{"id":48681,"text":"the message to generate when a RasterFormatException is thrown","labels":[]}
{"id":48682,"text":"true if the given column is automatically incremented; false otherwise","labels":[]}
{"id":48683,"text":"true if, and only if, the I\/O operation completed successfully, that is, had some effect that would be visible to the operation's invoker","labels":[]}
{"id":48684,"text":"true if the attribute has a setter exposed for management.","labels":[]}
{"id":48685,"text":"If csq is null, then the four characters \"null\" are appended to this Appendable.","labels":[]}
{"id":48686,"text":"Whether or not this is a subregion.","labels":[]}
{"id":48687,"text":"the port number on which the remote object receives calls (if port is zero, an anonymous port is chosen)","labels":[]}
{"id":48688,"text":"An opaque object which helps the listener to associate information regarding the MBean emitter (can be null).","labels":[]}
{"id":48689,"text":"if true, the object is restarted (reactivated) when either the activator is restarted or the object's activation group is restarted after an unexpected crash; if false, the object is only activated on demand.","labels":[]}
{"id":48690,"text":"set to true if client authentication is required, or false if no client authentication is desired.","labels":[]}
{"id":48691,"text":"If there is not a security manager or SecurityManager.getThreadGroup() returns null, the group is set to the current thread's thread group.","labels":[]}
{"id":48692,"text":"the temporal object to check, not null","labels":[]}
{"id":48693,"text":"the processing instruction data, or null if none was supplied.","labels":[]}
{"id":48694,"text":"the URIReference that was being dereferenced when the error was encountered","labels":[]}
{"id":48695,"text":"If csq is null, then characters will be appended as if csq contained the four characters \"null\".","labels":[]}
{"id":48696,"text":"a boolean value indicating whether confidentiality should be enabled or not.","labels":[]}
{"id":48697,"text":"The illegal Unicode code point","labels":[]}
{"id":48698,"text":"the The GSS error code for the problem causing this exception to be thrown.","labels":[]}
{"id":48699,"text":"the JTree that is asking the editor to edit; this parameter can be null","labels":[]}
{"id":48700,"text":"true if the window should always be above other windows","labels":[]}
{"id":48701,"text":"value to set, can be null","labels":[]}
{"id":48702,"text":"the last number in the sequence or null","labels":[]}
{"id":48703,"text":"The combiner function must fold the elements from the second result container into the first result container.","labels":[]}
{"id":48704,"text":"an error code defined in ErrorManager","labels":[]}
{"id":48705,"text":"The ClassLoaderRepository that will be used to search for the given class, if it is not found in this ClassLoader.","labels":[]}
{"id":48706,"text":"should be null","labels":[]}
{"id":48707,"text":"the filter to be applied to the image before rendering","labels":[]}
{"id":48708,"text":"the new standard error output stream.","labels":[]}
{"id":48709,"text":"if true, ignore case when comparing characters.","labels":[]}
{"id":48710,"text":"true if numbers should be parsed as integers only; false otherwise","labels":[]}
{"id":48711,"text":"the type of scrolling which should take place in response to this event; valid values are WHEEL_UNIT_SCROLL and WHEEL_BLOCK_SCROLL","labels":[]}
{"id":48712,"text":"the cause, may be null","labels":[]}
{"id":48713,"text":"the mechanism specific error code","labels":[]}
{"id":48714,"text":"the list of acceptable CA issuer subject names or null if it does not matter which issuers are used.","labels":[]}
{"id":48715,"text":"The possibly null name to check.","labels":[]}
{"id":48716,"text":"determines if the newly constructed object has anti-aliasing.","labels":[]}
{"id":48717,"text":"The possibly null value to remove from this attribute.","labels":[]}
{"id":48718,"text":"if true then multiple selections are allowed; otherwise, only one item from the list can be selected at once","labels":[]}
{"id":48719,"text":"the number of rows to fetch; 0 to let the driver decide what the best fetch size is; must not be less than 0 or more than the maximum number of rows allowed for this RowSet object (the number returned by a call to the method getMaxRows())","labels":[]}
{"id":48720,"text":"If null, name is relative to the default initial context.","labels":[]}
{"id":48721,"text":"If true, the cookie can only be sent over a secure protocol like HTTPS.","labels":[]}
{"id":48722,"text":"The non-null list of mechanism names to try.","labels":[]}
{"id":48723,"text":"the class name of the Permission class that will be created when this unresolved permission is resolved.","labels":[]}
{"id":48724,"text":"the locale to apply when formatting diagnostics; null means the default locale.","labels":[]}
{"id":48725,"text":"the offset within the composed text, if there is composed text; null otherwise","labels":[]}
{"id":48726,"text":"The object to attach to the receive operation; can be null","labels":[]}
{"id":48727,"text":"a File indicating where the cache file should be created, or null to use the system directory.","labels":[]}
{"id":48728,"text":"the local date-time to query for offset transition, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":48729,"text":"Or null.","labels":[]}
{"id":48730,"text":"the JTable that is asking the editor to edit; can be null","labels":[]}
{"id":48731,"text":"If null, no filtering will be performed before handling notifications.","labels":[]}
{"id":48732,"text":"true if the alpha has been premultiplied; false otherwise.","labels":[]}
{"id":48733,"text":"must not be null","labels":[]}
{"id":48734,"text":"The stratum to retrieve information from or null for the defaultStratum().","labels":[]}
{"id":48735,"text":"The type of document to be created or null.","labels":[]}
{"id":48736,"text":"the empty-based action to be performed, if no value is present","labels":[]}
{"id":48737,"text":"the end date, exclusive, which is converted to an Instant, not null","labels":[]}
{"id":48738,"text":"listener to remove, not null","labels":[]}
{"id":48739,"text":"the temporal to convert, not null","labels":[]}
{"id":48740,"text":"whether to reset the card after disconnecting.","labels":[]}
{"id":48741,"text":"If not specified then the ordering matching rule defined for the sort key attribute is used.","labels":[]}
{"id":48742,"text":"true if the parse method returns BigDecimal; false otherwise","labels":[]}
{"id":48743,"text":"If support for the extended mouse buttons is enabled by Java then it is allowed to create MouseEvent objects with the standard buttons.","labels":[]}
{"id":48744,"text":"an associative, non-interfering, stateless function that must fold an element into a result container.","labels":[]}
{"id":48745,"text":"the column's table's catalog name; if the catalogName is null, an empty String is set","labels":[]}
{"id":48746,"text":"the parent of the view, null if none","labels":[]}
{"id":48747,"text":"the privileged exception action to run","labels":[]}
{"id":48748,"text":"boolean indicating if the focus change is temporary","labels":[]}
{"id":48749,"text":"true if this menu is active, false if it is not","labels":[]}
{"id":48750,"text":"if true, continue after shutdown, else don't","labels":[]}
{"id":48751,"text":"The module name; or null to find a resource in the unnamed module for this class loader","labels":[]}
{"id":48752,"text":"If null, no connection request controls are used.","labels":[]}
{"id":48753,"text":"The maximum number of doubles to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":48754,"text":"May be null, in which case this method is equivalent to loadClass(className).","labels":[]}
{"id":48755,"text":"If true, the mbeanInterface parameter names an MXBean interface and the resultant MBean is an MXBean.","labels":[]}
{"id":48756,"text":"the Unicode Extension key, not null.","labels":[]}
{"id":48757,"text":"The non-null name of the search item.","labels":[]}
{"id":48758,"text":"the component, may be null","labels":[]}
{"id":48759,"text":"This parameter is ignored if its value is greater than or equal to the actual digest length.","labels":[]}
{"id":48760,"text":"The possibly null attribute value to add; if null, null is the value added.","labels":[]}
{"id":48761,"text":"Ignored if transferType is one of DataBuffer.TYPE_SHORT, DataBuffer.TYPE_FLOAT, or DataBuffer.TYPE_DOUBLE, in which case all bits of all component samples will be significant.","labels":[]}
{"id":48762,"text":"The non-null suffix Rdns to add.","labels":[]}
{"id":48763,"text":"The listener parameter takes an interface implemented by the user which contains the methods to be called when the event occurs.","labels":[]}
{"id":48764,"text":"the length, in characters, to which the CLOB value should be truncated","labels":[]}
{"id":48765,"text":"the logical style to assign to the paragraph, or null for no style","labels":[]}
{"id":48766,"text":"If null, the link resolved object field is set to null.","labels":[]}
{"id":48767,"text":"The exception that was caught.","labels":[]}
{"id":48768,"text":"Whether the text range is selected","labels":[]}
{"id":48769,"text":"If the parameter is of JDBC type NUMERIC or DECIMAL, the version of registerOutParameter that accepts a scale value should be used.","labels":[]}
{"id":48770,"text":"The possibly null set of properties used to select the SASL mechanism and to configure the authentication exchange of the selected mechanism.","labels":[]}
{"id":48771,"text":"a string identifying the other file or null if there isn't another file or if not known","labels":[]}
{"id":48772,"text":"The maximum number of chars to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":48773,"text":"a String object with the name that can be supplied to a naming service based on JNDI technology to retrieve the DataSource object that can be used to get a connection; may be null but must not be an empty string","labels":[]}
{"id":48774,"text":"This should be a value greater or equal to the element starting offset and less than the element ending offset.","labels":[]}
{"id":48775,"text":"the message to be generated when a PrinterAbortException is thrown","labels":[]}
{"id":48776,"text":"\"String, List\" instead of \"java.lang.String, java.util.List\" as long as they don't cause ambiguity in the specific parameter position.","labels":[]}
{"id":48777,"text":"If a bit is not set, the pixel at that index is considered invalid.","labels":[]}
{"id":48778,"text":"If a mouse has three enabled buttons(see MouseInfo.getNumberOfButtons()) then the values from the left column passed into the method will return corresponding values from the right column: button returned mask BUTTON1 BUTTON1_DOWN_MASK BUTTON2 BUTTON2_DOWN_MASK BUTTON3 BUTTON3_DOWN_MASK If a mouse has more than three enabled buttons then more values are admissible (4, 5, etc.).","labels":[]}
{"id":48779,"text":"the name of the table that imports the key; must match the table name as it is stored in the database","labels":[]}
{"id":48780,"text":"If null, the context is initialized with no environment properties.","labels":[]}
{"id":48781,"text":"a boolean value indicating whether the credentials should be delegated or not.","labels":[]}
{"id":48782,"text":"If this attribute set ignores the character case of its attribute ids, the case of attrID is ignored.","labels":[]}
{"id":48783,"text":"used to select screen, null means primary or default screen","labels":[]}
{"id":48784,"text":"If the flag is true, the Stroke outline is tested.","labels":[]}
{"id":48785,"text":"the number of columns to use to calculate the preferred width >= 0; if columns is set to zero, the preferred width will be whatever naturally results from the component implementation","labels":[]}
{"id":48786,"text":"the predicate to apply to a value, if present","labels":[]}
{"id":48787,"text":"the error","labels":[]}
{"id":48788,"text":"the SyncResolver object to be set; cannot be null","labels":[]}
{"id":48789,"text":"true if table view should allow resizing","labels":[]}
{"id":48790,"text":"the Subject which may contain principals\/credentials used for authentication, or may be populated with additional principals\/credentials after successful authentication has completed.","labels":[]}
{"id":48791,"text":"true if the return method handle should have variable arity behavior","labels":[]}
{"id":48792,"text":"must be valid for the openType specified for this attribute; can be null, in which case it means that no minimal value is set.","labels":[]}
{"id":48793,"text":"if true, render cell appropriately.","labels":[]}
{"id":48794,"text":"the human-readable string used to identify this flavor; if this parameter is null then the value of the MIME Content Type is used","labels":[]}
{"id":48795,"text":"a comparator who's ordering is to be reversed by the returned comparator or null","labels":[]}
{"id":48796,"text":"If the value of this parameter is less than the actual digest length, the method will throw a DigestException.","labels":[]}
{"id":48797,"text":"the other instant, null returns false","labels":[]}
{"id":48798,"text":"the name, not null","labels":[]}
{"id":48799,"text":"the style of the text required, not null","labels":[]}
{"id":48800,"text":"the destination BufferedImage, or null","labels":[]}
{"id":48801,"text":"the image to display when the cursor is activated","labels":[]}
{"id":48802,"text":"If null or no domain and key properties are specified, the name of all registered MBeans will be retrieved.","labels":[]}
{"id":48803,"text":"a Set of key purpose OIDs in string format (or null).","labels":[]}
{"id":48804,"text":"the name of the method (which must not be \"<init>\")","labels":[]}
{"id":48805,"text":"the start date, inclusive, not null","labels":[]}
{"id":48806,"text":"Specify null to return all CRLs (if supported).","labels":[]}
{"id":48807,"text":"the location of the error, if available","labels":[]}
{"id":48808,"text":"true means that stopCellEditing is invoked when editing is interrupted, and data is saved; false means that cancelCellEditing is invoked, and changes are lost","labels":[]}
{"id":48809,"text":"The value to which the attribute element should be set.","labels":[]}
{"id":48810,"text":"true to specify that this internal frame should be maximizable; false to specify that it should not be","labels":[]}
{"id":48811,"text":"If the value is null, the current value of the specified property is cleared.","labels":[]}
{"id":48812,"text":"It must be \"register\" or \"*\" for this permission.","labels":[]}
{"id":48813,"text":"a stream to which \"expected\" output should be written","labels":[]}
{"id":48814,"text":"an exception (may be null)","labels":[]}
{"id":48815,"text":"an integer designating the kind of message this is, primarily used to determine the icon from the pluggable Look and Feel: ERROR_MESSAGE, INFORMATION_MESSAGE, WARNING_MESSAGE, QUESTION_MESSAGE, or PLAIN_MESSAGE","labels":[]}
{"id":48816,"text":"must be null.","labels":[]}
{"id":48817,"text":"whether or not partial returns are valid.","labels":[]}
{"id":48818,"text":"the number of characters the zone may represent before attempting to break the zone into a smaller size.","labels":[]}
{"id":48819,"text":"The non-null ID of the attribute to be used as a sort key.","labels":[]}
{"id":48820,"text":"the location where recording data is written, not null","labels":[]}
{"id":48821,"text":"It must accept its own return type (if non-void) plus a T parameter (for the iterated values), and may accept any number of additional types.","labels":[]}
{"id":48822,"text":"a String object giving a description of the warning; if the String is null, this constructor behaves like the default (zero parameter) RowSetWarning constructor","labels":[]}
{"id":48823,"text":"the recording where the state change occurred, not null","labels":[]}
{"id":48824,"text":"the locale to use for formatting, not null","labels":[]}
{"id":48825,"text":"The object to associate to the given key, or null to remove any existing association to that key.","labels":[]}
{"id":48826,"text":"a String object that contains the JDBC URL that will be used to establish the connection to a database for this RowSet object; may be null but must not be an empty string","labels":[]}
{"id":48827,"text":"Another exception to embed in this one.","labels":[]}
{"id":48828,"text":"whether the time is midnight at the end of day","labels":[]}
{"id":48829,"text":"if null, this cookie will not be associated with an URI","labels":[]}
{"id":48830,"text":"the list of acceptable CA issuer subject names, or null if it does not matter which issuers are used.","labels":[]}
{"id":48831,"text":"the new cursor name, which must be unique within a connection","labels":[]}
{"id":48832,"text":"the component whose minimum size is being queried; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":48833,"text":"true if the row is leaf","labels":[]}
{"id":48834,"text":"The thread pool or null to associate the channel with the default thread pool","labels":[]}
{"id":48835,"text":"the non-null text to use as the replacement","labels":[]}
{"id":48836,"text":"true if column selection will be allowed, false otherwise","labels":[]}
{"id":48837,"text":"the ProtectionParameter used to protect the Entry, which may be null","labels":[]}
{"id":48838,"text":"the X509Certificate being checked (or null)","labels":[]}
{"id":48839,"text":"the array of composite data values to be added as new rows to this TabularData instance; if values is null or empty, this method returns without doing anything.","labels":[]}
{"id":48840,"text":"whether client authentication should be requested","labels":[]}
{"id":48841,"text":"The sharding key may be null","labels":[]}
{"id":48842,"text":"the index of the new rollover column or -1 if the mouse is not over a column","labels":[]}
{"id":48843,"text":"The non-null component to add.","labels":[]}
{"id":48844,"text":"the component to be used as the observer if this icon has no image observer","labels":[]}
{"id":48845,"text":"the message to use for this exception, may be null","labels":[]}
{"id":48846,"text":"the GraphicsConfiguration of the target screen device; if null, the default system GraphicsConfiguration is assumed","labels":[]}
{"id":48847,"text":"must be a valid value for the openType specified for this parameter; default value not supported for ArrayType and TabularType; can be null, in which case it means that no default value is set.","labels":[]}
{"id":48848,"text":"the illegal index.","labels":[]}
{"id":48849,"text":"the time-zone, not null","labels":[]}
{"id":48850,"text":"The locator object for the error or warning.","labels":[]}
{"id":48851,"text":"the new exception that will be added to the end of the SQLException chain","labels":[]}
{"id":48852,"text":"the supplying function that produces an exception to be thrown","labels":[]}
{"id":48853,"text":"This may be null.","labels":[]}
{"id":48854,"text":"the value to return if not completed","labels":[]}
{"id":48855,"text":"the system-dependent file name where data is written, not null","labels":[]}
{"id":48856,"text":"the maximum amount that the control points for a given curve can vary from colinear before a subdivided curve is replaced by a straight line connecting the end points.","labels":[]}
{"id":48857,"text":"the number of seconds that the credential element should remain valid for initiating of security contexts.","labels":[]}
{"id":48858,"text":"the Throwable (Error or Exception) that caused this exception to occur.","labels":[]}
{"id":48859,"text":"The nonnull event.","labels":[]}
{"id":48860,"text":"If less than or equal to zero, do not wait at all.","labels":[]}
{"id":48861,"text":"if false, write\/read field values in the same manner as writeObject\/readObject; if true, write\/read in the same manner as writeUnshared\/readUnshared","labels":[]}
{"id":48862,"text":"compiler options, null means no options","labels":[]}
{"id":48863,"text":"If the exit (equivalently, System.exit) method has already been invoked then this status code will override the status code passed to that method.","labels":[]}
{"id":48864,"text":"Note that in the case of painting the foreground, this value may differ from c.getHeight().","labels":[]}
{"id":48865,"text":"Component to repaint, null results in nothing happening.","labels":[]}
{"id":48866,"text":"The error as an exception.","labels":[]}
{"id":48867,"text":"A null title is equivalent to \"\".","labels":[]}
{"id":48868,"text":"position of child component (must be <= 0)","labels":[]}
{"id":48869,"text":"the exception to throw.","labels":[]}
{"id":48870,"text":"The possibly null environment to use when retrieving the referral context.","labels":[]}
{"id":48871,"text":"If name is null, this method does not do anything.","labels":[]}
{"id":48872,"text":"The new error handler.","labels":[]}
{"id":48873,"text":"The array and array elements cannot be null.","labels":[]}
{"id":48874,"text":"the other month-day to compare to, not null","labels":[]}
{"id":48875,"text":"an optional list of file attributes to set atomically when creating the directory","labels":[]}
{"id":48876,"text":"the Vector to use, with a new one created on null","labels":[]}
{"id":48877,"text":"a plug-in specific extension object, which may be null.","labels":[]}
{"id":48878,"text":"the WebSocket on which the error has occurred","labels":[]}
{"id":48879,"text":"This argument is optional and may be null.","labels":[]}
{"id":48880,"text":"the fallback method in case the exception handler triggers.","labels":[]}
{"id":48881,"text":"the new chronology, null if no override","labels":[]}
{"id":48882,"text":"the values of the items, listed in the same order as their respective names in itemNames; each item value can be null, but if it is non-null it must be a valid value for the open type defined in compositeType for the corresponding item; must be of the same size as itemNames; must not be null or empty.","labels":[]}
{"id":48883,"text":"whether or not to indicate the drop location","labels":[]}
{"id":48884,"text":"A handler to handle notifications from the SCTP stack, or null to ignore any notifications.","labels":[]}
{"id":48885,"text":"If non-null, specifies illegal characters.","labels":[]}
{"id":48886,"text":"the specified host, or null.","labels":[]}
{"id":48887,"text":"index after last element to be removed","labels":[]}
{"id":48888,"text":"true if pairwise orderings should be taken account in ordering the returned objects.","labels":[]}
{"id":48889,"text":"the number of line containing the error","labels":[]}
{"id":48890,"text":"Properties in this map override properties in the map specified when the JMXConnector was created, if any.","labels":[]}
{"id":48891,"text":"a BufferedImage that will be the destination image, or null.","labels":[]}
{"id":48892,"text":"the base temporal object, not null","labels":[]}
{"id":48893,"text":"Used to indicate if the edited value must always be valid","labels":[]}
{"id":48894,"text":"When used with invokedynamic, this is provided by the NameAndType of the InvokeDynamic structure and is stacked automatically by the VM.","labels":[]}
{"id":48895,"text":"name of the host with which to connect, or null for the loopback address.","labels":[]}
{"id":48896,"text":"The non-null string value of the output property.","labels":[]}
{"id":48897,"text":"true if no frame decorations are to be enabled; false if frame decorations are to be enabled","labels":[]}
{"id":48898,"text":"If null or the empty array means use no request controls.","labels":[]}
{"id":48899,"text":"a PrintRequestAttributeSet specifying any printing attributes, or null for none","labels":[]}
{"id":48900,"text":"Use (Oid) null to request the default mechanism.","labels":[]}
{"id":48901,"text":"The exception to be wrapped in a SAXException.","labels":[]}
{"id":48902,"text":"The indices must be in sorted order, from lowest to highest","labels":[]}
{"id":48903,"text":"One of the constants READ_ONLY, READ_WRITE, or PRIVATE defined in the FileChannel.MapMode class, according to whether the file is to be mapped read-only, read\/write, or privately (copy-on-write), respectively","labels":[]}
{"id":48904,"text":"mxbeanName must be in the format of ObjectName.","labels":[]}
{"id":48905,"text":"the string message format in MessageFormat format, (or a key in the message catalog if bundle is not null); can be null.","labels":[]}
{"id":48906,"text":"a non-null handle to return the end value of the loop counter (the loop will run to end-1).","labels":[]}
{"id":48907,"text":"If non-null, specifies that exceptions which are instances of refType will be reported.","labels":[]}
{"id":48908,"text":"The source buffer from which bytes are to be read; must not be this buffer","labels":[]}
{"id":48909,"text":"If null, defaults to jmxmp.","labels":[]}
{"id":48910,"text":"The possibly null object to check.","labels":[]}
{"id":48911,"text":"This is the end of the string or the position of the \"#\" character, if present.","labels":[]}
{"id":48912,"text":"indicates whether alpha values are contained in the cmap array","labels":[]}
{"id":48913,"text":"Otherwise, all parents of path are marked EXPANDED, but path itself is marked collapsed.","labels":[]}
{"id":48914,"text":"true if this object can return or accept a DOM tree using the standard metadata format.","labels":[]}
{"id":48915,"text":"the offset before the cutover, not null","labels":[]}
{"id":48916,"text":"the GraphicsConfiguration that is used to construct the new window with; if gc is null, the system default GraphicsConfiguration is assumed, unless owner is also null, in which case the GraphicsConfiguration from the shared owner frame will be used.","labels":[]}
{"id":48917,"text":"true to auto-size the image, false otherwise","labels":[]}
{"id":48918,"text":"the FormatStyle for the date, null for time-only pattern","labels":[]}
{"id":48919,"text":"the Unicode Extension key for this type, not null.","labels":[]}
{"id":48920,"text":"whether the relation is handled by the Relation Service.","labels":[]}
{"id":48921,"text":"a type name pattern; must match the type name as it is stored in the database; may be a fully qualified name","labels":[]}
{"id":48922,"text":"the graphics context, must not be null","labels":[]}
{"id":48923,"text":"the string to be used as tooltip text; if the value is null no tooltip is shown","labels":[]}
{"id":48924,"text":"The non-null IANA-registered name of a SASL mechanism.","labels":[]}
{"id":48925,"text":"The URLStreamHandlerFactory to use when creating URLs.","labels":[]}
{"id":48926,"text":"When a converter is requested as part of linking an invokedynamic instruction the supplier will return the lookup passed to the bootstrap method, otherwise if the method is invoked from within a LinkerServices.getWithLookup(Supplier, jdk.dynalink.SecureLookupSupplier) it will delegate to the secure lookup supplier.","labels":[]}
{"id":48927,"text":"the length of time that data is kept, or null if infinite","labels":[]}
{"id":48928,"text":"the context ClassLoader for this Thread, or null indicating the system class loader (or, failing that, the bootstrap class loader)","labels":[]}
{"id":48929,"text":"if true, sets palette icons","labels":[]}
{"id":48930,"text":"The directory in which the file is to be created, or null if the default temporary-file directory is to be used","labels":[]}
{"id":48931,"text":"The error information encapsulated in a transformer exception.","labels":[]}
{"id":48932,"text":"a mechanism-specific structure containing the parent node that the marshalled parameters should be appended to","labels":[]}
{"id":48933,"text":"the qualified XML name (with prefix), or the empty string if qualified names are not available","labels":[]}
{"id":48934,"text":"Ranges must be in ascending order and must not overlap.","labels":[]}
{"id":48935,"text":"This value is conveyed to tryAcquire(long) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":48936,"text":"If less than or equal to zero, then no tasks are processed.","labels":[]}
{"id":48937,"text":"a string value; may be null","labels":[]}
{"id":48938,"text":"the offset after the cutover, not null","labels":[]}
{"id":48939,"text":"If true, add information about the link resolved object.","labels":[]}
{"id":48940,"text":"The notation public identifier, or null if not available.","labels":[]}
{"id":48941,"text":"method handle to call if a matching exception is thrown","labels":[]}
{"id":48942,"text":"local socket address to bind, or null for an unbound socket.","labels":[]}
{"id":48943,"text":"If this parameter is null, the method will return the default namespace URI if any.","labels":[]}
{"id":48944,"text":"true if explicit policy is to be required, false otherwise","labels":[]}
{"id":48945,"text":"The local name, or the empty string if Namespace processing is not being performed.","labels":[]}
{"id":48946,"text":"whether to output the localized decimal point symbol","labels":[]}
{"id":48947,"text":"The ProtectionDomain of the class, or null.","labels":[]}
{"id":48948,"text":"the icon to be displayed in the tab when disabled","labels":[]}
{"id":48949,"text":"the class whose method should be invoked","labels":[]}
{"id":48950,"text":"the underlying reason for this DataTruncation (which is saved for later retrieval by the getCause() method); may be null indicating the cause is non-existent or unknown.","labels":[]}
{"id":48951,"text":"the initial Color set when the color-chooser is shown","labels":[]}
{"id":48952,"text":"the choice to be used as the default choice when the list of choices are displayed.","labels":[]}
{"id":48953,"text":"the listener to add, not null","labels":[]}
{"id":48954,"text":"an XOPEN code identifying the warning; if a non standard XOPEN SQLState is supplied, no exception is thrown.","labels":[]}
{"id":48955,"text":"if true, the node is allowed to have child nodes -- otherwise, it is always a leaf node","labels":[]}
{"id":48956,"text":"The possibly null environment of the context.","labels":[]}
{"id":48957,"text":"the other rules to compare to, null returns false","labels":[]}
{"id":48958,"text":"This value is conveyed to tryAcquireShared(long) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":48959,"text":"the ordinal position of the first byte in this SerialBlob object to be copied; numbering starts at 1; must not be less than 1 and must be less than or equal to the length of this SerialBlob object","labels":[]}
{"id":48960,"text":"the string message (or a key in the message catalog, if bundle is not null); can be null.","labels":[]}
{"id":48961,"text":"true if JTable should automatically create columns","labels":[]}
{"id":48962,"text":"true if the synchronization must be precisely maintained (i.e., the synchronization must be sample-accurate) at all times during operation of the lines, or false if precise synchronization is required only during start and stop operations","labels":[]}
{"id":48963,"text":"the value subtracted from the input values before indexing into the array","labels":[]}
{"id":48964,"text":"a flag indicating whether auto-generated keys should be made available for retrieval; one of the following constants: Statement.RETURN_GENERATED_KEYS Statement.NO_GENERATED_KEYS","labels":[]}
{"id":48965,"text":"element to be removed from this deque, if present","labels":[]}
{"id":48966,"text":"the parameters to pass to the TerminalFactorySpi implementation, or null if no parameters are needed","labels":[]}
{"id":48967,"text":"the name of the class of the native metadata format, or null if there is no native format.","labels":[]}
{"id":48968,"text":"the string to be parsed and inserted before elem","labels":[]}
{"id":48969,"text":"The exception to be encapsulated in a TransformerFactoryConfigurationError.","labels":[]}
{"id":48970,"text":"The property name, which is a non-null fully-qualified URI.","labels":[]}
{"id":48971,"text":"The possibly null object to compare against.","labels":[]}
{"id":48972,"text":"The name of the MBean on which the listener should be added.","labels":[]}
{"id":48973,"text":"itemNames must list, in any order, all the item names defined in compositeType; the order in which the names are listed, is used to match values in itemValues[]; must not be null or empty.","labels":[]}
{"id":48974,"text":"Must have be compatible with the invocation handle as per MethodHandles.guardWithTest(MethodHandle, MethodHandle, MethodHandle).","labels":[]}
{"id":48975,"text":"the text to be displayed, null if none","labels":[]}
{"id":48976,"text":"Some platforms expect the fullscreen window to be a top-level component (i.e., a Frame); therefore it is preferable to use a Frame here rather than a Window.","labels":[]}
{"id":48977,"text":"Any other value will throw IllegalArgumentException","labels":[]}
{"id":48978,"text":"The non-null UnsolicitedNotificationEvent","labels":[]}
{"id":48979,"text":"the type of message to be displayed: ERROR_MESSAGE, INFORMATION_MESSAGE, WARNING_MESSAGE, QUESTION_MESSAGE, or PLAIN_MESSAGE","labels":[]}
{"id":48980,"text":"true if a parameter value was truncated","labels":[]}
{"id":48981,"text":"The offset within the buffer array of the first buffer from which bytes are to be retrieved; it must be non-negative and no larger than srcs.length","labels":[]}
{"id":48982,"text":"the maximum number of fraction digits to be shown; if less than zero, then zero is used.","labels":[]}
{"id":48983,"text":"The maximum number of buffers to be accessed; must be non-negative and no larger than dsts.length - offset","labels":[]}
{"id":48984,"text":"The base URI against which the first argument will be made absolute if the absolute URI is required.","labels":[]}
{"id":48985,"text":"An appropriate IIOMetadataController, or null.","labels":[]}
{"id":48986,"text":"the number of times playback should loop back from the loop's end position to the loop's start position, or LOOP_CONTINUOUSLY to indicate that looping should continue until interrupted","labels":[]}
{"id":48987,"text":"A possibly null binding after the change.","labels":[]}
{"id":48988,"text":"The possibly null list of unexecuted modifications.","labels":[]}
{"id":48989,"text":"If null, the context is initialized with no request controls.","labels":[]}
{"id":48990,"text":"the array into which the elements of the queue are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose","labels":[]}
{"id":48991,"text":"whether the focus change is temporary","labels":[]}
{"id":48992,"text":"element to be removed from this collection, if present","labels":[]}
{"id":48993,"text":"if non-null, contains the returned kernel data","labels":[]}
{"id":48994,"text":"The non-null id of the attribute to remove.","labels":[]}
{"id":48995,"text":"If null, the default search controls is used.","labels":[]}
{"id":48996,"text":"a descriptive string (may be null)","labels":[]}
{"id":48997,"text":"if true, lightweight popups are desired","labels":[]}
{"id":48998,"text":"a list of files, if null use the default search path for this location","labels":[]}
{"id":48999,"text":"true if start should be omitted","labels":[]}
{"id":49000,"text":"an array of objects indicating the possible choices the user can make; if the objects are components, they are rendered properly; non-String objects are rendered using their toString methods; if this parameter is null, the options are determined by the Look and Feel","labels":[]}
{"id":49001,"text":"set of printing attributes for a supposed job (both job-level attributes and document-level attributes), or null","labels":[]}
{"id":49002,"text":"the method handle to invoke after the arguments are dropped","labels":[]}
{"id":49003,"text":"The address to bind the socket, or null to bind the socket to an automatically assigned socket address","labels":[]}
{"id":49004,"text":"a method descriptor string the lookup type, if the request is for a method invocation, or describing the invocation type, if the request is for a field or constructor","labels":[]}
{"id":49005,"text":"true if columns may be selected; otherwise false","labels":[]}
{"id":49006,"text":"the function to use to compute the value of the returned CompletionStage if this CompletionStage completed exceptionally","labels":[]}
{"id":49007,"text":"If a bit is set in the BigInteger, the pixel at that index is valid.","labels":[]}
{"id":49008,"text":"the provider instance that should be used whenever support is needed for mech.","labels":[]}
{"id":49009,"text":"the number of columns; if columns is less than 0, columns is set to 0","labels":[]}
{"id":49010,"text":"true if the attribute has a getter exposed for management.","labels":[]}
{"id":49011,"text":"Passing in a value of null will imply that the private credential set should be left empty.","labels":[]}
{"id":49012,"text":"the URL from which the Sequence should be constructed","labels":[]}
{"id":49013,"text":"the temporal object to adjust, not null","labels":[]}
{"id":49014,"text":"the hook, not null","labels":[]}
{"id":49015,"text":"Normally at least a \"user\" and \"password\" property should be included.","labels":[]}
{"id":49016,"text":"The non-null property name.","labels":[]}
{"id":49017,"text":"The header should start with \"set-cookie\", or \"set-cookie2\" token; or it should have no leading token at all.","labels":[]}
{"id":49018,"text":"true if the parser produced by this code will validate documents as they are parsed; false otherwise.","labels":[]}
{"id":49019,"text":"when true, result is allowed to reflect approximate or out of data values; when false, results are requested to be accurate","labels":[]}
{"id":49020,"text":"A negative number indicates the number of milliseconds before January 1, 1970, 00:00:00 GMT.","labels":[]}
{"id":49021,"text":"If null, then this object will use standard JMX design pattern to determine the management interface associated with the given implementation.","labels":[]}
{"id":49022,"text":"The module name; or null to find the class in the unnamed module for this class loader","labels":[]}
{"id":49023,"text":"Use null to act as the default initiator principal.","labels":[]}
{"id":49024,"text":"body of the loop, which may not be null.","labels":[]}
{"id":49025,"text":"Otherwise there are arranged in descending order.","labels":[]}
{"id":49026,"text":"the number of columns to use to calculate the preferred width; if columns is set to zero, the preferred width will be whatever naturally results from the component implementation","labels":[]}
{"id":49027,"text":"the locale for which a resource bundle should be loaded","labels":[]}
{"id":49028,"text":"true if the column is a cash value; false if it is not","labels":[]}
{"id":49029,"text":"whether to enable or disable the socket option","labels":[]}
{"id":49030,"text":"the factory to use to rebuild if the view has children","labels":[]}
{"id":49031,"text":"the time style to use, null means no time required","labels":[]}
{"id":49032,"text":"the (which is saved for later retrieval by the getCause() method); may be null indicating the cause is non-existent or unknown.","labels":[]}
{"id":49033,"text":"The specification only defines the URI DEFAULT_OBJECT_MODEL_URI,http:\/\/java.sun.com\/jaxp\/xpath\/dom for the W3C DOM, the org.w3c.dom package, and implementations are free to introduce other URIs for other object models.","labels":[]}
{"id":49034,"text":"If it is not the same object as location, point will remain unmodified by this call.","labels":[]}
{"id":49035,"text":"an IIOMetadata object representing image metadata, or null.","labels":[]}
{"id":49036,"text":"the specified IOException","labels":[]}
{"id":49037,"text":"an XOPEN or SQL:2003 code identifying the exception","labels":[]}
{"id":49038,"text":"the text to parse such as \"10:15:30+01:00\", not null","labels":[]}
{"id":49039,"text":"Can be null, which is equivalent to an empty array.","labels":[]}
{"id":49040,"text":"true if table view should draw grid lines","labels":[]}
{"id":49041,"text":"If l is null then no localization is applied.","labels":[]}
{"id":49042,"text":"a package element to associate with the given file object representing a legacy package.html, null otherwise","labels":[]}
{"id":49043,"text":"whether or not to display a print dialog","labels":[]}
{"id":49044,"text":"the partially complete temporal to query for zone and chronology; querying for other things is undefined and not recommended, not null","labels":[]}
{"id":49045,"text":"the new logging\/tracing PrintStream object; null to disable logging and tracing","labels":[]}
{"id":49046,"text":"Array of band indices, or null to use all bands.","labels":[]}
{"id":49047,"text":"the maximum CRL number accepted (or null)","labels":[]}
{"id":49048,"text":"The exception to be encapsulated in a TransformerConfigurationException","labels":[]}
{"id":49049,"text":"if true, the focus state should be painted","labels":[]}
{"id":49050,"text":"The size of the locked region; must be non-negative, and the sum position + size must be non-negative","labels":[]}
{"id":49051,"text":"the component where the x,y location is being queried; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":49052,"text":"AttributeSet indicating attributes of inserted text, null is legal.","labels":[]}
{"id":49053,"text":"if true, remove on cancellation, else don't","labels":[]}
{"id":49054,"text":"a Writer for additional output from the tool; use System.err if null","labels":[]}
{"id":49055,"text":"indicates if word boundaries should be used for line wrapping","labels":[]}
{"id":49056,"text":"A String, part of which should be parsed.","labels":[]}
{"id":49057,"text":"Note that any plus sign \"+\" prepended to the name of the feature will be ignored since it is not significant in the context of this method.","labels":[]}
{"id":49058,"text":"the provider from which the KeyStore is to be instantiated (or null)","labels":[]}
{"id":49059,"text":"true if the parser created must eliminate whitespace in the element content when parsing XML documents; false otherwise.","labels":[]}
{"id":49060,"text":"If null, 'null' replaces the old value.","labels":[]}
{"id":49061,"text":"the other year-month to compare to, not null","labels":[]}
{"id":49062,"text":"If null, null is added as an attribute value.","labels":[]}
{"id":49063,"text":"the end time, exclusive, which is converted to an OffsetTime, not null","labels":[]}
{"id":49064,"text":"the file's create time, or null to not change the value","labels":[]}
{"id":49065,"text":"the specified RenderingHints, or null","labels":[]}
{"id":49066,"text":"the event identifying when the SSL Handshake completed on a given SSL connection","labels":[]}
{"id":49067,"text":"how long to wait for resources for any subscriber before giving up, in units of unit","labels":[]}
{"id":49068,"text":"the formatter to add, not null","labels":[]}
{"id":49069,"text":"a byte array containing the distinguished name in ASN.1 DER format (or null)","labels":[]}
{"id":49070,"text":"Note that in the case of painting the foreground, this value may differ from c.getWidth().","labels":[]}
{"id":49071,"text":"true if the length is required for a leap year","labels":[]}
{"id":49072,"text":"A ParsePosition object with index and error index information as described above.","labels":[]}
{"id":49073,"text":"the transfer action requested; this should be a value of either COPY or MOVE; the operation performed is the intersection of the transfer capabilities given by getSourceActions and the requested action; the intersection may result in an action of NONE if the requested action isn't supported","labels":[]}
{"id":49074,"text":"the error message","labels":[]}
{"id":49075,"text":"true if the socket should start its handshaking in \"client\" mode","labels":[]}
{"id":49076,"text":"The non-null string name of the object.","labels":[]}
{"id":49077,"text":"If null is specified, all DataFlavors currently known to the data transfer subsystem are returned in a non-deterministic order.","labels":[]}
{"id":49078,"text":"open options used when opening the file","labels":[]}
{"id":49079,"text":"a table name; must match the table name as it is stored in this database","labels":[]}
{"id":49080,"text":"a boolean, true if a series of changes are in progress","labels":[]}
{"id":49081,"text":"the tab index where the disabled icon should be set","labels":[]}
{"id":49082,"text":"the end date, exclusive, in any chronology, not null","labels":[]}
{"id":49083,"text":"The Authenticator that should be used by this HttpURLConnection.","labels":[]}
{"id":49084,"text":"One of the constants defined by the Cursor class; if this parameter is null then this component will inherit the cursor of its parent","labels":[]}
{"id":49085,"text":"the current value, which may be null","labels":[]}
{"id":49086,"text":"an ImageWriteParam that will be used to encode the image, or null.","labels":[]}
{"id":49087,"text":"the first number in the sequence or null","labels":[]}
{"id":49088,"text":"whether or not to update the selection on sorting","labels":[]}
{"id":49089,"text":"an implementation defined error type","labels":[]}
{"id":49090,"text":"If non-null, a primitive array in which to return the pixel data.","labels":[]}
{"id":49091,"text":"an array of long, with each element indicating the update count, Statement.SUCCESS_NO_INFO or Statement.EXECUTE_FAILED for each SQL command in the batch for JDBC drivers that continue processing after a command failure; an update count or Statement.SUCCESS_NO_INFO for each SQL command in the batch prior to the failure for JDBC drivers that stop processing after a command failure","labels":[]}
{"id":49092,"text":"the TreeSelectionModel to use, or null to disable selections","labels":[]}
{"id":49093,"text":"the amount to subtract, not null","labels":[]}
{"id":49094,"text":"the rendering style attributes for the text range, or null","labels":[]}
{"id":49095,"text":"the method handle to invoke after the argument is inserted","labels":[]}
{"id":49096,"text":"a Clob object representing an SQL CLOB value; cannot be null","labels":[]}
{"id":49097,"text":"\"standard\" output; use System.out if null","labels":[]}
{"id":49098,"text":"The processing instruction data, or null if none is supplied.","labels":[]}
{"id":49099,"text":"The public identifier, or null if none is available.","labels":[]}
{"id":49100,"text":"the Method object for the annotation element, may be null","labels":[]}
{"id":49101,"text":"an optional list of parameters to the message (may be none).","labels":[]}
{"id":49102,"text":"If filter is null, no filtering will be performed before handling notifications.","labels":[]}
{"id":49103,"text":"true if this model will allow row selection","labels":[]}
{"id":49104,"text":"Equals true if the focus change is temporary; false otherwise","labels":[]}
{"id":49105,"text":"Can be null, in which case no name constraints check will be performed.","labels":[]}
{"id":49106,"text":"the field to default the value of, not null","labels":[]}
{"id":49107,"text":"the action to perform before completing the returned CompletionStage","labels":[]}
{"id":49108,"text":"true if the Subject is to be read-only, and false otherwise.","labels":[]}
{"id":49109,"text":"Must be non-negative.","labels":[]}
{"id":49110,"text":"the Locale for which localization will be attempted, or null.","labels":[]}
{"id":49111,"text":"whether client authentication should be required","labels":[]}
{"id":49112,"text":"type or package or module elements causally associated with the creation of this file, may be elided or null","labels":[]}
{"id":49113,"text":"a column name pattern; must match the column name as it is stored in the database","labels":[]}
{"id":49114,"text":"The source buffer from which shorts are to be read; must not be this buffer","labels":[]}
{"id":49115,"text":"a procedure name pattern; must match the procedure name as it is stored in the database","labels":[]}
{"id":49116,"text":"the number of seconds that the credential element should remain valid for accepting security contexts.","labels":[]}
{"id":49117,"text":"If null, the ColorModel of the source is used.","labels":[]}
{"id":49118,"text":"the number of the row to which the cursor should move.","labels":[]}
{"id":49119,"text":"A value of 0 means that this Image should never be accelerated.","labels":[]}
{"id":49120,"text":"the cause of the exception, may be null","labels":[]}
{"id":49121,"text":"The non-null object to be escaped.","labels":[]}
{"id":49122,"text":"If null is passed as this argument, the MenuSelectionManager.defaultManager is used.","labels":[]}
{"id":49123,"text":"false indicates that an existing session must be resumed","labels":[]}
{"id":49124,"text":"the sources of peer authentication trust decisions or null","labels":[]}
{"id":49125,"text":"This node must be a Document node, a DocumentFragment node, or a node of a type that is allowed as a child of an Element node, e.g.","labels":[]}
{"id":49126,"text":"If the Window and\/or its owner are not yet displayable, both are made displayable.","labels":[]}
{"id":49127,"text":"The characteristics must be equal to supplier.get().characteristics(), otherwise undefined behavior may occur when terminal operation commences.","labels":[]}
{"id":49128,"text":"the destination PrintService, or null to use the default printer","labels":[]}
{"id":49129,"text":"The exception to be encapsulated in a TransformerConfigurationException.","labels":[]}
{"id":49130,"text":"If null then any previously set authenticator is removed, and client authentication will no longer be required.","labels":[]}
{"id":49131,"text":"The child node where the result nodes should be inserted before.","labels":[]}
{"id":49132,"text":"true if the low endpoint is to be included in the returned view","labels":[]}
{"id":49133,"text":"Use (Oid[]) null for requesting a system specific default set of mechanisms.","labels":[]}
{"id":49134,"text":"the line number of the source line containing the execution point represented by this stack trace element, or a negative number if this information is unavailable.","labels":[]}
{"id":49135,"text":"After reading this many characters, attempting to reset the stream may fail.","labels":[]}
{"id":49136,"text":"The local address to bind the socket, or null to bind to an automatically assigned socket address","labels":[]}
{"id":49137,"text":"If a non-standard sqlType is supplied, this method will not throw a SQLException.","labels":[]}
{"id":49138,"text":"the cause (A null value is permitted, and indicates that the cause is nonexistent or unknown.)","labels":[]}
{"id":49139,"text":"If null it assumes all the rows were newly added","labels":[]}
{"id":49140,"text":"cannot be a null or empty string.","labels":[]}
{"id":49141,"text":"Used to indicate when edits are committed back to the JTextComponent","labels":[]}
{"id":49142,"text":"a distinguished name as X500Principal (or null)","labels":[]}
{"id":49143,"text":"Specify null to omit the parameter.","labels":[]}
{"id":49144,"text":"the GraphicsConfiguration of the target screen device; if gc is null, the system default GraphicsConfiguration is assumed","labels":[]}
{"id":49145,"text":"the logical name of the data source for this RowSet object; may be null","labels":[]}
{"id":49146,"text":"the associated CodeSource, or null if none","labels":[]}
{"id":49147,"text":"True if this feature should be hidden from human users.","labels":[]}
{"id":49148,"text":"Whether the attribute is a of type ID.","labels":[]}
{"id":49149,"text":"the era to represent, only 1 supported","labels":[]}
{"id":49150,"text":"If null, it sets the resolved name field to null.","labels":[]}
{"id":49151,"text":"The stratum to retrieve information from or null for the ReferenceType.defaultStratum()","labels":[]}
{"id":49152,"text":"the locale to apply; null means apply no locale","labels":[]}
{"id":49153,"text":"the index at which the error occurred, or -1 if the index is not known","labels":[]}
{"id":49154,"text":"A CRLSelector used to select which CRLs should be returned.","labels":[]}
{"id":49155,"text":"true if the cell is to be rendered with highlighting","labels":[]}
{"id":49156,"text":"condition for the loop, which may not be null.","labels":[]}
{"id":49157,"text":"true if this model will allow column selection","labels":[]}
{"id":49158,"text":"If true, sets the access permission to allow write operations; if false to disallow write operations","labels":[]}
{"id":49159,"text":"requests that the statement be pooled if true and that the statement not be pooled if false","labels":[]}
{"id":49160,"text":"If flags == IGNORE_ALL_BEANINFO then we ignore all BeanInfo associated with the specified beanClass or any of its parent classes.","labels":[]}
{"id":49161,"text":"if true, unexports the object even if there are pending or in-progress calls; if false, only unexports the object if there are no pending or in-progress calls","labels":[]}
{"id":49162,"text":"null value can be supplied to indicate that the application does not want to set this value.","labels":[]}
{"id":49163,"text":"the new parent, or null if the view is being removed from a parent it was previously added to","labels":[]}
{"id":49164,"text":"the operator to apply before this operator is applied","labels":[]}
{"id":49165,"text":"This parameter can be null, which indicates that implementations are free to select an alias applicable to any socket.","labels":[]}
{"id":49166,"text":"the zone offset, null if no preference","labels":[]}
{"id":49167,"text":"the stratum to use for comparing line number and source name, or null to use the default stratum","labels":[]}
{"id":49168,"text":"The unit code can only be a float unit type (i.e.","labels":[]}
{"id":49169,"text":"Only bits from 0 to the map size are considered.","labels":[]}
{"id":49170,"text":"A null value indicates that the elements' natural ordering should be used.","labels":[]}
{"id":49171,"text":"the initial string to display, or null","labels":[]}
{"id":49172,"text":"This can be null to indicate there is no visual location.","labels":[]}
{"id":49173,"text":"If null, this classes run method does nothing.","labels":[]}
{"id":49174,"text":"The possibly null name to set remaining name to.","labels":[]}
{"id":49175,"text":"true if name is a name relative to the target context (which is named by the first parameter of the list() method); false if name is a URL string.","labels":[]}
{"id":49176,"text":"The new preferred size, or null","labels":[]}
{"id":49177,"text":"method handle to call if test fails","labels":[]}
{"id":49178,"text":"The InetAddress of the site requesting authorization, or null if not known.","labels":[]}
{"id":49179,"text":"The offset within the buffer array of the first buffer from which bytes are to be retrieved; must be non-negative and no larger than srcs.length","labels":[]}
{"id":49180,"text":"null can be used to specify that a mechanism specific default printable syntax should be assumed by each mechanism that examines nameStr.","labels":[]}
{"id":49181,"text":"the non-null text to append","labels":[]}
{"id":49182,"text":"The possibly null name to set the \"remaining new name\" to.","labels":[]}
{"id":49183,"text":"a CallbackHandler for obtaining authentication information, which may be null","labels":[]}
{"id":49184,"text":"a non-null reference to the region of the component c","labels":[]}
{"id":49185,"text":"a management interface for a platform MXBean with one single instance in the Java virtual machine if implemented.","labels":[]}
{"id":49186,"text":"true if this recording is written to disk, false if in-memory","labels":[]}
{"id":49187,"text":"(unused; should be null)","labels":[]}
{"id":49188,"text":"The exception to be encapsulated in a TransformerFactoryConfigurationError","labels":[]}
{"id":49189,"text":"the cause (or null if none)","labels":[]}
{"id":49190,"text":"the namespace URI of the attribute (specify null if not applicable)","labels":[]}
{"id":49191,"text":"True if the specified cell was selected.","labels":[]}
{"id":49192,"text":"The possibly null detail string explaining more about the problem with resolving a link.","labels":[]}
{"id":49193,"text":"the detail message, may be null","labels":[]}
{"id":49194,"text":"a parameter name pattern; must match the parameter or column name as it is stored in the database","labels":[]}
{"id":49195,"text":"The non-null hostname verifier callback.","labels":[]}
{"id":49196,"text":"If mapper is null then (k) -> ((o, n) -> n) is assumed.","labels":[]}
{"id":49197,"text":"if true, the border is painted","labels":[]}
{"id":49198,"text":"specifies whether dialog blocks input to other windows when shown.","labels":[]}
{"id":49199,"text":"The maximum number of bytes to be transferred; must be non-negative","labels":[]}
{"id":49200,"text":"Can be null to have the factory use the default transformer.","labels":[]}
{"id":49201,"text":"the new default TimeZone, or null","labels":[]}
{"id":49202,"text":"whether this Window can be the focused Window","labels":[]}
{"id":49203,"text":"the event to add, may not be null","labels":[]}
{"id":49204,"text":"the value to be returned, if no value is present.","labels":[]}
{"id":49205,"text":"The minimum capacity of the internal byte buffer, or -1 if an implementation-dependent default capacity is to be used","labels":[]}
{"id":49206,"text":"chained exception","labels":[]}
{"id":49207,"text":"the position in this SerialClob object at which to start the search; the first position is 1; must not be less than 1 nor greater than the length of this SerialClob object","labels":[]}
{"id":49208,"text":"for the types java.sql.Types.DECIMAL and java.sql.Types.NUMERIC, this is the number of digits after the decimal point.","labels":[]}
{"id":49209,"text":"the name of the environment property to add; may not be null","labels":[]}
{"id":49210,"text":"a list of user-defined types (JAVA_OBJECT, STRUCT, or DISTINCT) to include; null returns all types","labels":[]}
{"id":49211,"text":"The possibly null ID of the matching rule to use to order the attribute values.","labels":[]}
{"id":49212,"text":"the time-zone ID, not null","labels":[]}
{"id":49213,"text":"The parent class loader for the class loader created by this method; may be null for the bootstrap class loader","labels":[]}
{"id":49214,"text":"whether to enable the current input method for composition","labels":[]}
{"id":49215,"text":"If true, the name of binding is relative to the target context; if false, the name of binding is a URL string.","labels":[]}
{"id":49216,"text":"The possibly null exception that caused the naming operation to fail.","labels":[]}
{"id":49217,"text":"This value may be null.","labels":[]}
{"id":49218,"text":"a List of BufferedImage thumbnails for this image, or null.","labels":[]}
{"id":49219,"text":"the authenticator, or null.","labels":[]}
{"id":49220,"text":"the wall offset, not null","labels":[]}
{"id":49221,"text":"The possibly null attributes associated with refInfo.","labels":[]}
{"id":49222,"text":"an array of the indexes of the columns in the inserted row that should be made available for retrieval by a call to the method getGeneratedKeys","labels":[]}
{"id":49223,"text":"the operation which should be performed when the user closes the frame","labels":[]}
{"id":49224,"text":"the number of existing child views to remove; this should be a value >= 0 and <= (getViewCount() - offset)","labels":[]}
{"id":49225,"text":"The text message of the exception.","labels":[]}
{"id":49226,"text":"the text, in MessageFormat, to be used as the footer, or null for no footer","labels":[]}
{"id":49227,"text":"the end date, exclusive, which is converted to an OffsetDateTime, not null","labels":[]}
{"id":49228,"text":"detail message, or null if no detail message","labels":[]}
{"id":49229,"text":"the field to get, not null","labels":[]}
{"id":49230,"text":"The exception thrown","labels":[]}
{"id":49231,"text":"the array of protocols (or null)","labels":[]}
{"id":49232,"text":"a string identifying the file or null if not known.","labels":[]}
{"id":49233,"text":"The offset within the array of the first float to be written; must be non-negative and no larger than dst.length","labels":[]}
{"id":49234,"text":"the ImageObserver object to be notified as the image is being prepared.","labels":[]}
{"id":49235,"text":"the detail message pertaining to this exception.","labels":[]}
{"id":49236,"text":"object to be notified as more of the image is scaled and converted.","labels":[]}
{"id":49237,"text":"the time to wait before starting this recording, not null","labels":[]}
{"id":49238,"text":"true if the parser produced will convert CDATA nodes to Text nodes and append it to the adjacent (if any) text node; false otherwise.","labels":[]}
{"id":49239,"text":"Possibly null additional detail about this exception.","labels":[]}
{"id":49240,"text":"a ParsePosition object with index and error index information as described above","labels":[]}
{"id":49241,"text":"The error message for the exception.","labels":[]}
{"id":49242,"text":"The valid combination also depends on a Toolkit.areExtraMouseButtonsEnabled() value as follows: If support for extended mouse buttons is disabled by Java then it is allowed to use only the following standard button masks: InputEvent.BUTTON1_DOWN_MASK, InputEvent.BUTTON2_DOWN_MASK, InputEvent.BUTTON3_DOWN_MASK.","labels":[]}
{"id":49243,"text":"a boolean, where true means this internal frame should become selected (currently active) and false means it should become deselected","labels":[]}
{"id":49244,"text":"the desired encoding after conversion","labels":[]}
{"id":49245,"text":"the list of desired SNIServerNames (or null)","labels":[]}
{"id":49246,"text":"flag indicating whether to return the delimiters as tokens.","labels":[]}
{"id":49247,"text":"a Collection with one entry per name (or null)","labels":[]}
{"id":49248,"text":"An instance of this class can be constructed where this parameter is null, but the standard connectors will never do so.","labels":[]}
{"id":49249,"text":"the position at which the item should be inserted","labels":[]}
{"id":49250,"text":"This is the number of bytes the driver will send to the DBMS; lengths of 0 or less are are undefined but will cause an invalid length exception to be thrown in the underlying JDBC driver.","labels":[]}
{"id":49251,"text":"true if Popup should be heavy weight, otherwise popup type will be selected by popup factory.","labels":[]}
{"id":49252,"text":"The object identifier (OID) of the algorithm to check for (or null).","labels":[]}
{"id":49253,"text":"Must be non-null.","labels":[]}
{"id":49254,"text":"The error information encapsulated in a TransformerException.","labels":[]}
{"id":49255,"text":"a Ref object representing an SQL REF value; cannot be null","labels":[]}
{"id":49256,"text":"the composite type of this composite data instance; must not be null.","labels":[]}
{"id":49257,"text":"the Locale for which the boolean is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":49258,"text":"The local address to bind the socket, or null to bind the socket to an automatically assigned socket address","labels":[]}
{"id":49259,"text":"the new, non-null BoundedRangeModel to use","labels":[]}
{"id":49260,"text":"the object to bind; possibly null","labels":[]}
{"id":49261,"text":"a boolean value indicating whether integrity should be enabled or not.","labels":[]}
{"id":49262,"text":"For a parallel execution, this function may be called multiple times and must return a fresh value each time.","labels":[]}
{"id":49263,"text":"The object to attach to the I\/O operation; can be null","labels":[]}
{"id":49264,"text":"vector containing the names of the new columns; if this is null then the model has no columns","labels":[]}
{"id":49265,"text":"a function to be applied after the subscriber has completed","labels":[]}
{"id":49266,"text":"the operation which should be performed when the user closes the dialog","labels":[]}
{"id":49267,"text":"a flag indicating whether auto-generated keys should be returned; one of Statement.RETURN_GENERATED_KEYS or Statement.NO_GENERATED_KEYS","labels":[]}
{"id":49268,"text":"the locale to be used when creating or comparing subformats","labels":[]}
{"id":49269,"text":"the usage mode that this credential element should add to the credential.","labels":[]}
{"id":49270,"text":"the flavor object which caused the exception.","labels":[]}
{"id":49271,"text":"if non-null, a primitive array in which to return the pixel data","labels":[]}
{"id":49272,"text":"the pattern to add, not null","labels":[]}
{"id":49273,"text":"include columns that are nullable.","labels":[]}
{"id":49274,"text":"whether or not the JPopupMenu is inherited","labels":[]}
{"id":49275,"text":"the ItemListener that is to be notified","labels":[]}
{"id":49276,"text":"the locale for error reporting.","labels":[]}
{"id":49277,"text":"if true, the data in the raster has been premultiplied with alpha.","labels":[]}
{"id":49278,"text":"the TabSet instance which this instance should be compared to.","labels":[]}
{"id":49279,"text":"Possibly null detail explaining the exception.","labels":[]}
{"id":49280,"text":"String describing the reason for the exception.","labels":[]}
{"id":49281,"text":"Possibly null string containing additional detail about this exception.","labels":[]}
{"id":49282,"text":"the target namespace of the XML Schema [XML Schema Part 1] when resolving XML Schema resources.","labels":[]}
{"id":49283,"text":"The source buffer from which floats are to be read; must not be this buffer","labels":[]}
{"id":49284,"text":"an Array object representing an SQL ARRAY value; cannot be null.","labels":[]}
{"id":49285,"text":"If non-null, returns the samples in this array","labels":[]}
{"id":49286,"text":"the end date, exclusive, which may be in any chronology, not null","labels":[]}
{"id":49287,"text":"the uri to bind to the default namespace, may be null","labels":[]}
{"id":49288,"text":"the location in the model where the fragment should start it's representation >= 0.","labels":[]}
{"id":49289,"text":"The factory must not modify inAttrs.","labels":[]}
{"id":49290,"text":"The non-null naming listener on which to invoke the method.","labels":[]}
{"id":49291,"text":"After initiating capture, all events of the specified type will be dispatched to the registered EventListener before being dispatched to any EventTargets beneath them in the tree.","labels":[]}
{"id":49292,"text":"If null, no controls are used.","labels":[]}
{"id":49293,"text":"the array of ciphersuites (or null)","labels":[]}
{"id":49294,"text":"a boolean value indicating if the initiator should be authenticated to the acceptor as an anonymous principal.","labels":[]}
{"id":49295,"text":"the exception that was thrown when the system attempted to load the named type, or null if unavailable or inapplicable","labels":[]}
{"id":49296,"text":"the end instant, exclusive, not null","labels":[]}
{"id":49297,"text":"time in seconds before which the validation process is expected to be completed, otherwise the validation process is aborted.","labels":[]}
{"id":49298,"text":"Implementations must either recognize and process the input or thrown an IllegalArgumentException.","labels":[]}
{"id":49299,"text":"the logical style to assign to the paragraph, null if none","labels":[]}
{"id":49300,"text":"A non-null control.","labels":[]}
{"id":49301,"text":"The bytes in positions off through off+len-1 should have the format of a valid class file as defined by The Java™ Virtual Machine Specification.","labels":[]}
{"id":49302,"text":"The non-null exception that triggered this continuation.","labels":[]}
{"id":49303,"text":"true if the view has a strike\/line through it, otherwise false","labels":[]}
{"id":49304,"text":"If null, the checker is ignored (not added to list).","labels":[]}
{"id":49305,"text":"null if the iteration of the directory completes without an error; otherwise the I\/O exception that caused the iteration of the directory to complete prematurely","labels":[]}
{"id":49306,"text":"The non-null LdapName instance to compare against.","labels":[]}
{"id":49307,"text":"the specified SampleModel, or null","labels":[]}
{"id":49308,"text":"whether or not suppressed exceptions are enabled","labels":[]}
{"id":49309,"text":"the string used to identify the MIME type for this flavor; if the mimeType does not specify a \"class=\" parameter, or if the class is not successfully loaded, then an IllegalArgumentException is thrown","labels":[]}
{"id":49310,"text":"the flavor to be printed, or null","labels":[]}
{"id":49311,"text":"This value is always the one passed to a release method, or the current state value upon entry to a condition wait.","labels":[]}
{"id":49312,"text":"The error information encapsulated in a SAX parse exception.","labels":[]}
{"id":49313,"text":"if non-null, returns the samples in this array","labels":[]}
{"id":49314,"text":"the containing type, or null if none","labels":[]}
{"id":49315,"text":"the name of the remote host, or null for the loopback address.","labels":[]}
{"id":49316,"text":"the Locale for which the string is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":49317,"text":"or TYPE1_FONT if a Type 1 resource is specified.","labels":[]}
{"id":49318,"text":"null can be used to specify that a mechanism specific default syntax should be assumed by each mechanism that examines the byte array.","labels":[]}
{"id":49319,"text":"A nonnull name to be resolved relative to this context.","labels":[]}
{"id":49320,"text":"if true and border property is not null, the border is painted.","labels":[]}
{"id":49321,"text":"the Object to store; refer to UIDefaults for details on how null is handled","labels":[]}
{"id":49322,"text":"the required capabilities for creating the buffer strategy; cannot be null","labels":[]}
{"id":49323,"text":"the FontMetrics used to measure the string width, must be obtained from the correct font and graphics.","labels":[]}
{"id":49324,"text":"the subject key identifier (or null)","labels":[]}
{"id":49325,"text":"the non-null item to be inserted","labels":[]}
{"id":49326,"text":"the formatter style to obtain, not null","labels":[]}
{"id":49327,"text":"null if not launched.","labels":[]}
{"id":49328,"text":"the defining loader of the class to be transformed, may be null if the bootstrap loader","labels":[]}
{"id":49329,"text":"a boolean indicating whether or not to use anchoring bounds.","labels":[]}
{"id":49330,"text":"If null, an appropriate ColorModel is used.","labels":[]}
{"id":49331,"text":"The entity public identifier, or null if not available.","labels":[]}
{"id":49332,"text":"This value should also be < p1.","labels":[]}
{"id":49333,"text":"Return locations only within this source file or null to return locations.","labels":[]}
{"id":49334,"text":"information related to the error, if available","labels":[]}
{"id":49335,"text":"indicates if lines should be wrapped","labels":[]}
{"id":49336,"text":"background color, or null","labels":[]}
{"id":49337,"text":"the action string (or null if the set of permitted actions is empty)","labels":[]}
{"id":49338,"text":"Implementations must either recognize and process the input or throw an IllegalArgumentException.","labels":[]}
{"id":49339,"text":"whether or not tick marks should be painted","labels":[]}
{"id":49340,"text":"If s is null, this method clears the current Clip.","labels":[]}
{"id":49341,"text":"the period to subtract, not null","labels":[]}
{"id":49342,"text":"true if row is expanded, false otherwise","labels":[]}
{"id":49343,"text":"The fully qualified host name of the server, or null if the server is not bound to any specific host name.","labels":[]}
{"id":49344,"text":"The filter that was specified when the listener was added.","labels":[]}
{"id":49345,"text":"The exception handler for this stream; if null the default exception listener will be used.","labels":[]}
{"id":49346,"text":"whether node is selected","labels":[]}
{"id":49347,"text":"the tab index where the title should be set","labels":[]}
{"id":49348,"text":"the fully qualified name of the unavailable type","labels":[]}
{"id":49349,"text":"Exception causing the abort.","labels":[]}
{"id":49350,"text":"the RowSet object that is to be added to this JoinRowSet object; it must implement the Joinable interface and have a match column set","labels":[]}
{"id":49351,"text":"This should be > getStartOffset() and <= getEndOffset().","labels":[]}
{"id":49352,"text":"one of the following constants: ResultSetMetaData.columnNoNulls, ResultSetMetaData.columnNullable, or ResultSetMetaData.columnNullableUnknown","labels":[]}
{"id":49353,"text":"This must be a valid hit on the TextLayout.","labels":[]}
{"id":49354,"text":"It is null if the object bound is null.","labels":[]}
{"id":49355,"text":"the desired locale, not null.","labels":[]}
{"id":49356,"text":"a Locale for which the return value should be localized.","labels":[]}
{"id":49357,"text":"The line number of the end of the text that caused the error or warning.","labels":[]}
{"id":49358,"text":"The contents of encrypedData are copied to protect against subsequent modification when constructing this object.","labels":[]}
{"id":49359,"text":"The stream to which any initialization statements should be written.","labels":[]}
{"id":49360,"text":"close the underlying socket when this socket is closed.","labels":[]}
{"id":49361,"text":"If zero, all referring objects are returned.","labels":[]}
{"id":49362,"text":"An Object value which needs to be checked, whether it can be part of this FilterRowSet object.","labels":[]}
{"id":49363,"text":"a database vendor specific exception code","labels":[]}
{"id":49364,"text":"The nonnull string filter (see RFC2254).","labels":[]}
{"id":49365,"text":"the text style to use, not null","labels":[]}
{"id":49366,"text":"Specifies whether the EventListener being removed was registered as a capturing listener or not.","labels":[]}
{"id":49367,"text":"whether node has focus","labels":[]}
{"id":49368,"text":"A Class defining an interface that the result must implement.","labels":[]}
{"id":49369,"text":"time in seconds before which the validation process is expected to be completed,else the validation process is aborted.","labels":[]}
{"id":49370,"text":"the offset to check, null returns false","labels":[]}
{"id":49371,"text":"the encryption algorithm parameter specification, which may be null","labels":[]}
{"id":49372,"text":"The reason for the exception.","labels":[]}
{"id":49373,"text":"doc flavor to test, or null","labels":[]}
{"id":49374,"text":"This is always an absolute URI, unless it is null (likely because the XMLReader was given an InputSource without one).","labels":[]}
{"id":49375,"text":"the text to parse such as \"10:15:30\", not null","labels":[]}
{"id":49376,"text":"The system identifier, a URI reference [IETF RFC 2396], of the external resource being referenced, or null if no system identifier was supplied.","labels":[]}
{"id":49377,"text":"A time value of zero will cause excess threads to terminate immediately after executing tasks.","labels":[]}
{"id":49378,"text":"if true then support GZIP compatible compression","labels":[]}
{"id":49379,"text":"when true, return only indices for unique values; when false, return indices regardless of whether unique or not","labels":[]}
{"id":49380,"text":"The second element must be must be greater than 0.","labels":[]}
{"id":49381,"text":"a predicate to apply to elements to determine when the stream must terminate.","labels":[]}
{"id":49382,"text":"the list of URLs (separated by spaces) to load the class from, or null","labels":[]}
{"id":49383,"text":"the instant to create the date-time from, not null","labels":[]}
{"id":49384,"text":"a String describing the reason for the exception.","labels":[]}
{"id":49385,"text":"This must be an instance of class Severity","labels":[]}
{"id":49386,"text":"This parameter can be null, which indicates that implementations of this interface are free to select an alias applicable to any engine.","labels":[]}
{"id":49387,"text":"the new viewport to be used; if viewport is null, the old viewport is still removed and the new viewport is set to null","labels":[]}
{"id":49388,"text":"a PopupMenu or null to remove any popup menu","labels":[]}
{"id":49389,"text":"entities), applications must use the value \"http:\/\/www.w3.org\/TR\/REC-xml\".","labels":[]}
{"id":49390,"text":"the type whose class value must be computed or retrieved","labels":[]}
{"id":49391,"text":"The source buffer from which doubles are to be read; must not be this buffer","labels":[]}
{"id":49392,"text":"an event object describing the source of the event and containing the SQLException that the driver is about to throw","labels":[]}
{"id":49393,"text":"the menu to be used for the tray icon's popup menu; if the value is null no popup menu is shown","labels":[]}
{"id":49394,"text":"If non-null, the handle must return Iterator or a subtype.","labels":[]}
{"id":49395,"text":"This value should also be > p0.","labels":[]}
{"id":49396,"text":"the date style to use, null means no date required","labels":[]}
{"id":49397,"text":"if non-null, procedure to invoke upon exception thrown in method onNext","labels":[]}
{"id":49398,"text":"If the timeout period expires before the operation completes, a SQLException will be thrown.","labels":[]}
{"id":49399,"text":"The I\/O exception thrown when the connect failed.","labels":[]}
{"id":49400,"text":"the password that should be used to compute the key","labels":[]}
{"id":49401,"text":"true if cell has focus","labels":[]}
{"id":49402,"text":"the nested exception","labels":[]}
{"id":49403,"text":"the array into which the elements of this list are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":[]}
{"id":49404,"text":"The file position at which the transfer is to begin; must be non-negative","labels":[]}
{"id":49405,"text":"the new log writer; to disable logging, set to null","labels":[]}
{"id":49406,"text":"Resource bundle to localize msg; can be null.","labels":[]}
{"id":49407,"text":"Alternatively pass in null for msgProp to request the default QOP.","labels":[]}
{"id":49408,"text":"The offset within the buffer array of the first buffer from which bytes are to be transferred; it must be non-negative and no larger than dsts.length.","labels":[]}
{"id":49409,"text":"Also, the delegationSubjects parameter itself can be null, which is equivalent to an array of null values with the same size as the names and filters arrays.","labels":[]}
{"id":49410,"text":"true if wrap will be asked to provide privacy, false otherwise.","labels":[]}
{"id":49411,"text":"If it and the exception are both null, and no switch points were specified, this represents an unconditional invocation.","labels":[]}
{"id":49412,"text":"The group indicates the VM in which the object should be activated.","labels":[]}
{"id":49413,"text":"an array of objects containing the values of the arguments passed in the method invocation on the proxy instance, or null if the method takes no arguments","labels":[]}
{"id":49414,"text":"the new locale, not null","labels":[]}
{"id":49415,"text":"This will be null if this is a subregion.","labels":[]}
{"id":49416,"text":"an optional AffineTransform to be applied to the coordinates as they are returned in the iteration, or null if untransformed coordinates are desired","labels":[]}
{"id":49417,"text":"the unknown directive, may be null","labels":[]}
{"id":49418,"text":"a boolean value indicating whether replay detection should be enabled over the established context or not.","labels":[]}
{"id":49419,"text":"Resource bundle to localize msg, can be null","labels":[]}
{"id":49420,"text":"the suffix string to be used in generating the file's name; may be null, in which case \".tmp\" is used","labels":[]}
{"id":49421,"text":"the thread pool or null to associate the channel with the default thread pool","labels":[]}
{"id":49422,"text":"true if the AWTKeyStroke should represent a key release; false otherwise","labels":[]}
{"id":49423,"text":"the provider to register, not null","labels":[]}
{"id":49424,"text":"destination of tool errors, and user code errors","labels":[]}
{"id":49425,"text":"The offset within the array of the first short to be written; must be non-negative and no larger than dst.length","labels":[]}
{"id":49426,"text":"true if the view represents a subscript, otherwise false","labels":[]}
{"id":49427,"text":"The Object whose notifyAll method will be called after Runnable.run has returned or thrown an exception or after the event was disposed","labels":[]}
{"id":49428,"text":"If true, useCapture indicates that the user wishes to initiate capture.","labels":[]}
{"id":49429,"text":"If true then this channel will be placed in blocking mode; if false then it will be placed non-blocking mode","labels":[]}
{"id":49430,"text":"true if color samples are assumed to be premultiplied by the alpha samples; false otherwise","labels":[]}
{"id":49431,"text":"the XMLCryptoContext containing additional context (may be null if not applicable)","labels":[]}
{"id":49432,"text":"No elements of this array can be null.","labels":[]}
{"id":49433,"text":"the type for which to check if the member is accessible","labels":[]}
{"id":49434,"text":"the non-null content type","labels":[]}
{"id":49435,"text":"a description of why the exception might be thrown","labels":[]}
{"id":49436,"text":"the handler for internal worker threads that terminate due to unrecoverable errors encountered while executing tasks.","labels":[]}
{"id":49437,"text":"the prefix string to be used in generating the file's name; may be null","labels":[]}
{"id":49438,"text":"indicates whether this container will be used to provide focus traversal policy","labels":[]}
{"id":49439,"text":"the ImageReadParam being used, or null.","labels":[]}
{"id":49440,"text":"A possibly null string containing details of the exception.","labels":[]}
{"id":49441,"text":"An integer that indicates whether the item was selected or deselected.","labels":[]}
{"id":49442,"text":"the object to use as the default uncaught exception handler.","labels":[]}
{"id":49443,"text":"If negative, it is interpreted as meaning the sequence number that the next notification will have.","labels":[]}
{"id":49444,"text":"the exception that caused termination, or null if execution completed normally","labels":[]}
{"id":49445,"text":"the offset before the transition, not null","labels":[]}
{"id":49446,"text":"a catalog name; must match the catalog name as it is stored in the database;\"\" retrieves those without a catalog; null means catalog name should not be used to narrow down the search.","labels":[]}
{"id":49447,"text":"The possibly null object to set resolved object to.","labels":[]}
{"id":49448,"text":"the tab index where the component should be set","labels":[]}
{"id":49449,"text":"push promise handler, may be null","labels":[]}
{"id":49450,"text":"This is null when the node is being deleted.","labels":[]}
{"id":49451,"text":"cannot be null.","labels":[]}
{"id":49452,"text":"Use either an extended _DOWN_MASK or old _MASK modifiers, however do not mix models in the one event.","labels":[]}
{"id":49453,"text":"If null, then the default initial context is implied.","labels":[]}
{"id":49454,"text":"The DragGestureListener to notify when a gesture is detected","labels":[]}
{"id":49455,"text":"The InetAddress of the site requesting authentication, or null if not known.","labels":[]}
{"id":49456,"text":"If this value is null, the DragGestureRecognizer is not associated with any Component.","labels":[]}
{"id":49457,"text":"If null, all instances will be reported","labels":[]}
{"id":49458,"text":"The suffix string to be used in generating the file's name; may be null, in which case the suffix \".tmp\" will be used","labels":[]}
{"id":49459,"text":"the unqualified name of the method or field (ignored if kind is CONSTRUCTOR)","labels":[]}
{"id":49460,"text":"the locale for which the resource bundle should be loaded","labels":[]}
{"id":49461,"text":"The maximum number of longs to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":49462,"text":"how long to wait before completing normally with the given value, in units of unit","labels":[]}
{"id":49463,"text":"the japaneseEra name; non-null","labels":[]}
{"id":49464,"text":"true if simultaneous row and column selection is allowed","labels":[]}
{"id":49465,"text":"If null, it means no detail will be recorded.","labels":[]}
{"id":49466,"text":"JFormattedTextField.AbstractFormatter to use when the component has focus","labels":[]}
{"id":49467,"text":"If a non-standard targetSqlType is supplied, this method will not throw a SQLException.","labels":[]}
{"id":49468,"text":"true if the view represents a superscript, otherwise false","labels":[]}
{"id":49469,"text":"if a directory is currently selected.","labels":[]}
{"id":49470,"text":"can be used to indicate if this MenuElement is active (if it is a menu) or is on the part of the menu path that changed (if it is a menu item).","labels":[]}
{"id":49471,"text":"desired encoding of the stream after processing","labels":[]}
{"id":49472,"text":"the ImageProducer that is feeding this instance of the filter - also the ImageProducer that the request should be forwarded to if necessary","labels":[]}
{"id":49473,"text":"true if should time out, else false","labels":[]}
{"id":49474,"text":"element to be removed from this Vector, if present","labels":[]}
{"id":49475,"text":"The error or warning message.","labels":[]}
{"id":49476,"text":"Only extended modifiers are allowed to be used as a value for this parameter (see the InputEvent.getModifiersEx() class for the description of extended modifiers).","labels":[]}
{"id":49477,"text":"exception message","labels":[]}
{"id":49478,"text":"the filtered input stream to set as this object's inputstream, or null if no change.","labels":[]}
{"id":49479,"text":"the Component this label is for, or null if the label is not the label for a component","labels":[]}
{"id":49480,"text":"the text to parse such as \"2007-12-03\", not null","labels":[]}
{"id":49481,"text":"The value of this parameter must be one of: INITIATE_AND_ACCEPT, ACCEPT_ONLY, and INITIATE_ONLY.","labels":[]}
{"id":49482,"text":"an ImageReadParam, or null.","labels":[]}
{"id":49483,"text":"true indicates that DTLS handshake retransmissions should be enabled; false indicates that DTLS handshake retransmissions should be disabled","labels":[]}
{"id":49484,"text":"the method handle selected by the switch point after it is invalidated","labels":[]}
{"id":49485,"text":"the last access time, or null to not change the value","labels":[]}
{"id":49486,"text":"The value is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":49487,"text":"true if the policy should be respected","labels":[]}
{"id":49488,"text":"Can be null for no custom strategy.","labels":[]}
{"id":49489,"text":"one of the ResultSet constants specifying a type: ResultSet.TYPE_FORWARD_ONLY, ResultSet.TYPE_SCROLL_INSENSITIVE, or ResultSet.TYPE_SCROLL_SENSITIVE","labels":[]}
{"id":49490,"text":"module and\/or package relative to which the file should be named, or the empty string if none","labels":[]}
{"id":49491,"text":"the fallback method handle for when a switch point is invalidated, a guard returns false, or invalidating exception is thrown.","labels":[]}
{"id":49492,"text":"an optional list of file attributes to set atomically when creating the file","labels":[]}
{"id":49493,"text":"A null value indicates that the elements' natural ordering should be used","labels":[]}
{"id":49494,"text":"a catalog name; \"\" retrieves those without a catalog; null means drop catalog name from the selection criteria","labels":[]}
{"id":49495,"text":"an array of int, with each element indicating the update count, Statement.SUCCESS_NO_INFO or Statement.EXECUTE_FAILED for each SQL command in the batch for JDBC drivers that continue processing after a command failure; an update count or Statement.SUCCESS_NO_INFO for each SQL command in the batch prior to the failure for JDBC drivers that stop processing after a command failure","labels":[]}
{"id":49496,"text":"value of null indicates that this optional field is not set.","labels":[]}
{"id":49497,"text":"an array of int indicating the columns that form a primary key for this CachedRowSet object; every element in the array must be greater than 0 and less than or equal to the number of columns in this rowset","labels":[]}
{"id":49498,"text":"the allocation given to the view, which may need to be adjusted.","labels":[]}
{"id":49499,"text":"the value to be returned, if no value is present","labels":[]}
{"id":49500,"text":"It may be null for anonymous Loggers.","labels":[]}
{"id":49501,"text":"true if the column is automatically numbered; false if it is not","labels":[]}
{"id":49502,"text":"The new error listener.","labels":[]}
{"id":49503,"text":"the current phase number on entry to this method, before this phaser is advanced","labels":[]}
{"id":49504,"text":"the server host name with which to connect, or null for the loopback address.","labels":[]}
{"id":49505,"text":"The non-null address of the object.","labels":[]}
{"id":49506,"text":"This value is conveyed to tryAcquireShared(int) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":49507,"text":"whether or not the stack trace should be writable","labels":[]}
{"id":49508,"text":"true if this Window should appear at the default location, false if at the current location","labels":[]}
{"id":49509,"text":"the current (non null) Number for this sequence","labels":[]}
{"id":49510,"text":"the positive\/negative output style, not null","labels":[]}
{"id":49511,"text":"whether this SortingFocusTraversalPolicy transfers focus down-cycle implicitly","labels":[]}
{"id":49512,"text":"The class of the result, or null.","labels":[]}
{"id":49513,"text":"Note that while null is not prohibited, it is not acceptable as a parameter.","labels":[]}
{"id":49514,"text":"for java.sql.JDBCType.DECIMAL or java.sql.JDBCType.NUMERIC types, this is the number of digits after the decimal point.","labels":[]}
{"id":49515,"text":"an attribute name pattern; must match the attribute name as it is declared in the database","labels":[]}
{"id":49516,"text":"the string used to identify the MIME type for this flavor; if the class specified by \"class=\" parameter is not successfully loaded, then a ClassNotFoundException is thrown","labels":[]}
{"id":49517,"text":"the required day-of-week, null if the month-day should not be changed","labels":[]}
{"id":49518,"text":"The exact format of the string is unspecified, may be null.","labels":[]}
{"id":49519,"text":"This parameter may be null if no data has been removed.","labels":[]}
{"id":49520,"text":"a boolean which determines whether or not the tab is selected","labels":[]}
{"id":49521,"text":"the SecureRandomParameters the newly created SecureRandom object must support.","labels":[]}
{"id":49522,"text":"true if cell is selected","labels":[]}
{"id":49523,"text":"final value after the shift","labels":[]}
{"id":49524,"text":"the list of URLs (space-separated) from which the returned class loader will load classes from, or null","labels":[]}
{"id":49525,"text":"Note that when a DOMResult is used, a validator might just pass the same DOM node from DOMSource to DOMResult (in which case source.getNode()==result.getNode()), it might copy the entire DOM tree, or it might alter the node given by the source.","labels":[]}
{"id":49526,"text":"The warning information encapsulated in a transformer exception.","labels":[]}
{"id":49527,"text":"The fallback method is such that when it's invoked, it'll try to obtain an adequate target GuardedInvocation for the invocation, and subsequently invoke relink(GuardedInvocation, MethodHandle) or resetAndRelink(GuardedInvocation, MethodHandle), and finally invoke the target.","labels":[]}
{"id":49528,"text":"the other rules, null returns false","labels":[]}
{"id":49529,"text":"In the event that the implementation method is an instance method and this signature has any parameters, the first parameter in the invocation signature must correspond to the receiver.","labels":[]}
{"id":49530,"text":"true if the password should be displayed as it is being typed.","labels":[]}
{"id":49531,"text":"The possibly null environment properties to be used in the creation of the object factory and the context.","labels":[]}
{"id":49532,"text":"the Namespace URI, or the empty string if the element has no Namespace URI or if Namespace processing is not being performed","labels":[]}
{"id":49533,"text":"This index starts from 0 and is relative only to the rows contained inside this section, not all the rows in the table.","labels":[]}
{"id":49534,"text":"If resultClass is null, a vendor specific Result implementation will be returned.","labels":[]}
{"id":49535,"text":"An optional list of file attributes to set atomically when creating the file","labels":[]}
{"id":49536,"text":"when populating, the number of rows interval on which the CachedRowSet populated should fire; the default value is zero; cannot be less than fetchSize or zero","labels":[]}
{"id":49537,"text":"If true the check box is selected","labels":[]}
{"id":49538,"text":"If zero, all instances are returned.","labels":[]}
{"id":49539,"text":"The Namespace URI, or the empty string if the name has no Namespace URI.","labels":[]}
{"id":49540,"text":"the tab index where the background should be set","labels":[]}
{"id":49541,"text":"If chunklen is less than or equal to zero, a default value will be used.","labels":[]}
{"id":49542,"text":"the writer, non-null","labels":[]}
{"id":49543,"text":"an array of column names indicating the columns that should be returned from the inserted row or rows","labels":[]}
{"id":49544,"text":"the chronology ID or calendar system type, not null","labels":[]}
{"id":49545,"text":"This value represents the location of the stream and may be null.","labels":[]}
{"id":49546,"text":"This queue will hold only the Runnable tasks submitted by the execute method.","labels":[]}
{"id":49547,"text":"The number of shorts to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":49548,"text":"an integer specifying the maximum age of the cookie in seconds; if zero, the cookie should be discarded immediately; otherwise, the cookie's max age is unspecified.","labels":[]}
{"id":49549,"text":"A hint as to whether or not current look and feel should provide window decorations","labels":[]}
{"id":49550,"text":"the query to invoke, not null","labels":[]}
{"id":49551,"text":"true if the column can be used in a WHERE clause; false if it cannot","labels":[]}
{"id":49552,"text":"the parent of component2; this may differ from the actual parent and it may be null","labels":[]}
{"id":49553,"text":"class loader from which the class must be loaded","labels":[]}
{"id":49554,"text":"the new resolver style, not null","labels":[]}
{"id":49555,"text":"textual explanation of the mechanism error code","labels":[]}
{"id":49556,"text":"the client's address the socket is bound to, or null for the anyLocal address.","labels":[]}
{"id":49557,"text":"an ImageReadParam used to control the reading process, or null.","labels":[]}
{"id":49558,"text":"the certificate chain for the corresponding public key (only required if the given key is of type java.security.PrivateKey).","labels":[]}
{"id":49559,"text":"an array of the names of the columns that should be returned from the inserted row","labels":[]}
{"id":49560,"text":"the query defining the type to parse to, not null","labels":[]}
{"id":49561,"text":"If null, the default SSL socket factory is used.","labels":[]}
{"id":49562,"text":"Can be null, which has no effects on current cookie policy.","labels":[]}
{"id":49563,"text":"the local address the socket is bound to, or null for the anyLocal address.","labels":[]}
{"id":49564,"text":"If null, set the model to zero columns","labels":[]}
{"id":49565,"text":"the serialization filter to set as the process-wide filter; not null","labels":[]}
{"id":49566,"text":"the destination point or null","labels":[]}
{"id":49567,"text":"the number of ElementSpec.StartTagTypes with a direction of ElementSpec.JoinNextDirection that should be generated before inserting, but after the end tags have been generated","labels":[]}
{"id":49568,"text":"a method handle transformer filtering out internal objects, or null.","labels":[]}
{"id":49569,"text":"If null, it sets the link resolved name field to null.","labels":[]}
{"id":49570,"text":"The position at which the locked region is to start; must be non-negative","labels":[]}
{"id":49571,"text":"if true, dump all locked ownable synchronizers.","labels":[]}
{"id":49572,"text":"A value of zero indicates that the cursor will be positioned before the first row; a positive number indicates the row number counting from the beginning of the result set; a negative number indicates the row number counting from the end of the result set","labels":[]}
{"id":49573,"text":"additively modifies the HSB brightness component of the color returned (ignored if default color is returned).","labels":[]}
{"id":49574,"text":"ALL must be a flavor supported by the PrintJob & PrintService.","labels":[]}
{"id":49575,"text":"The offset within the string of the last char to be read, plus one; must be non-negative and no larger than string.length()","labels":[]}
{"id":49576,"text":"an AudioFormat object specifying the supported audio format of the returned line, or null for any audio format","labels":[]}
{"id":49577,"text":"the DriverAction implementation to be used when DriverManager#deregisterDriver is called","labels":[]}
{"id":49578,"text":"a List of BufferedImages, or null.","labels":[]}
{"id":49579,"text":"For a connected SctpChannel the address is the preferred peer address of the association to send the message to, or null to use the peer primary address.","labels":[]}
{"id":49580,"text":"the job attributes to be applied to the print job, or null for none","labels":[]}
{"id":49581,"text":"The possibly null ASN.1 BER encoded value of the extended response.","labels":[]}
{"id":49582,"text":"the non-null attribute name","labels":[]}
{"id":49583,"text":"The column number of the end of the text that cause the error or warning.","labels":[]}
{"id":49584,"text":"the field being checked, may be null","labels":[]}
{"id":49585,"text":"Note that (new int[][] { new int[] { 1, 1 }, new int[] { 1, 2 } }), is an invalid set of page ranges because the two ranges overlap.","labels":[]}
{"id":49586,"text":"whether or not line ends should be round","labels":[]}
{"id":49587,"text":"upon return from the method, this object will contain the applied QOP, the privacy state of the message, and supplementary information stating if the token was a duplicate, old, out of sequence or arriving after a gap.","labels":[]}
{"id":49588,"text":"the amount of data to retain, 0 if infinite","labels":[]}
{"id":49589,"text":"a file manager; if null use the tool's standard filemanager","labels":[]}
{"id":49590,"text":"If the JDBC driver does not support milliseconds, the JDBC driver will round the value up to the nearest second.","labels":[]}
{"id":49591,"text":"the bounds that this internal frame should be restored to","labels":[]}
{"id":49592,"text":"The index at which the parse error occurred, or -1 if the index is not known","labels":[]}
{"id":49593,"text":"the FontMetrics used to measure the advance string width, must be obtained from the correct font and graphics.","labels":[]}
{"id":49594,"text":"When drawing the header, the value of row is -1","labels":[]}
{"id":49595,"text":"The specified array is copied by this call; changes in the specified array after the method invocation returns will have no affect on this Throwable's stack trace.","labels":[]}
{"id":49596,"text":"the temporal object used to refine the result, not null","labels":[]}
{"id":49597,"text":"the object to check, can be null","labels":[]}
{"id":49598,"text":"true if root handles should be displayed; otherwise, false","labels":[]}
{"id":49599,"text":"the Blob object from which this SerialBlob object is to be constructed; cannot be null.","labels":[]}
{"id":49600,"text":"The possibly null environment to be used in the creation of the object factory and the object.","labels":[]}
{"id":49601,"text":"true if the engine should start its handshaking in \"client\" mode","labels":[]}
{"id":49602,"text":"an arrival phase number, or negative value if terminated; this argument is normally the value returned by a previous call to arrive or arriveAndDeregister.","labels":[]}
{"id":49603,"text":"If -1 is specified for the channel value, the track will receive data from all channels.","labels":[]}
{"id":49604,"text":"A possibly null binding before the change.","labels":[]}
{"id":49605,"text":"The nonnull string name of the object resolved relative to this context.","labels":[]}
{"id":49606,"text":"The list must contain at least one entry.","labels":[]}
{"id":49607,"text":"a byte array containing the distinguished name in ASN.1 DER encoded form (or null)","labels":[]}
{"id":49608,"text":"the name of the file containing the execution point represented by the stack trace element, or null if this information is unavailable","labels":[]}
{"id":49609,"text":"the offset at and after the transition, not null","labels":[]}
{"id":49610,"text":"true if the progress bar should render a string","labels":[]}
{"id":49611,"text":"if true, start loading any images that are not yet being loaded","labels":[]}
{"id":49612,"text":"the unknown type, may be null","labels":[]}
{"id":49613,"text":"a non-null object to return if the first argument is null","labels":[]}
{"id":49614,"text":"a table name pattern; must match the table name as it is stored in the database","labels":[]}
{"id":49615,"text":"true if, and only if, the invoker can provide no additional input bytes beyond those in the given buffer","labels":[]}
{"id":49616,"text":"true if classes loaded by this class loader will henceforth have assertions enabled by default, false if they will have assertions disabled by default.","labels":[]}
{"id":49617,"text":"If true, include details about the resolved object in addition to the other information.","labels":[]}
{"id":49618,"text":"the field to set in the result, not null","labels":[]}
{"id":49619,"text":"the sources of authentication keys or null","labels":[]}
{"id":49620,"text":"true enables read-only mode; false disables it","labels":[]}
{"id":49621,"text":"The result type must be int.","labels":[]}
{"id":49622,"text":"the Locale for which the border is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":49623,"text":"the element representing the tag; the element can be used to determine the nesting for situations where the attributes will differ if nested inside of other elements","labels":[]}
{"id":49624,"text":"The third element must be either 3 or 4.","labels":[]}
{"id":49625,"text":"the uri to bind to the prefix, may be null","labels":[]}
{"id":49626,"text":"the instant to get the previous transition after, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":49627,"text":"changes to the element this view is responsible for (may be null if there were no changes).","labels":[]}
{"id":49628,"text":"If null, this method has no effect.","labels":[]}
{"id":49629,"text":"This may never have the value \"xml\" or \"xmlns\".","labels":[]}
{"id":49630,"text":"if true, the activator contacts the group to obtain the remote object's reference; if false, returning the cached value is allowed.","labels":[]}
{"id":49631,"text":"All changes made before s was set will be undone.","labels":[]}
{"id":49632,"text":"the exception that was raised while loading the class","labels":[]}
{"id":49633,"text":"the type whose class value must be removed","labels":[]}
{"id":49634,"text":"if true, the returned BufferedImage is TYPE_INT_ARGB; otherwise it is TYPE_INT_RGB","labels":[]}
{"id":49635,"text":"if true, then bytes will be written to the end of the file rather than the beginning","labels":[]}
{"id":49636,"text":"a flag indicating whether this text component is user editable.","labels":[]}
{"id":49637,"text":"a file manager; if null use the compiler's standard filemanager","labels":[]}
{"id":49638,"text":"the start date, inclusive, specifying the chronology of the calculation, not null","labels":[]}
{"id":49639,"text":"Will not be null.","labels":[]}
{"id":49640,"text":"the source name containing the line number, or null to match all source names","labels":[]}
{"id":49641,"text":"The nonnull naming event.","labels":[]}
{"id":49642,"text":"the component being painted; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":49643,"text":"an array of column indexes indicating the columns that should be returned from the inserted row or rows","labels":[]}
{"id":49644,"text":"The file or resource name describing the location of a script error causing the ScriptException to be thrown.","labels":[]}
{"id":49645,"text":"The exception to be wrapped.","labels":[]}
{"id":49646,"text":"the first day of the week, not null","labels":[]}
{"id":49647,"text":"the month of the month-day of the first day of the cutover week, not null","labels":[]}
{"id":49648,"text":"Indicates if overwrite or overstrike mode is used","labels":[]}
{"id":49649,"text":"Range ends after refNode.","labels":[]}
{"id":49650,"text":"an optional line separator: can be null, in which case lines will be delimited in the manner of BufferedReader.readLine().","labels":[]}
{"id":49651,"text":"The offset within the array of the first float to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":49652,"text":"boolean specifying whether or not multiple selections can be made from the list of choices.","labels":[]}
{"id":49653,"text":"If host is null and if local host name cannot be resolved to an IP, then host defaults to numeric IP address of one of the active network interfaces.","labels":[]}
{"id":49654,"text":"The nonnull listener.","labels":[]}
{"id":49655,"text":"if true, the tool bar can be moved; false otherwise","labels":[]}
{"id":49656,"text":"This parameter may be null, in which case there is no new cached value.","labels":[]}
{"id":49657,"text":"the object reference to check for nullity","labels":[]}
{"id":49658,"text":"the string to display, may be null","labels":[]}
{"id":49659,"text":"The behaviour on a null argument depends on the conversion.","labels":[]}
{"id":49660,"text":"True if this is a constrained property.","labels":[]}
{"id":49661,"text":"the Component that is the basis for a focus traversal operation if the specified event represents a focus traversal key for the Component","labels":[]}
{"id":49662,"text":"if true, the true number of images will be returned even if a search is required.","labels":[]}
{"id":49663,"text":"an integer specifying the kind of message to display: ERROR_MESSAGE, INFORMATION_MESSAGE, WARNING_MESSAGE, QUESTION_MESSAGE, or PLAIN_MESSAGE","labels":[]}
{"id":49664,"text":"True if the derived color should be a UIResource, false if it should not be","labels":[]}
{"id":49665,"text":"if true, extend the current selection","labels":[]}
{"id":49666,"text":"true if add and setLayout are forwarded, false if they should operate directly on the JWindow.","labels":[]}
{"id":49667,"text":"If values.size() is less that the length of the array, the first values.size() elements are set.","labels":[]}
{"id":49668,"text":"Any of the descriptors can be null, in which case it is skipped.","labels":[]}
{"id":49669,"text":"the zone offset to change to, not null","labels":[]}
{"id":49670,"text":"The number of doubles to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":49671,"text":"a locale; might be null","labels":[]}
{"id":49672,"text":"If year is DatatypeConstants.FIELD_UNDEFINED, then eon is set to null.","labels":[]}
{"id":49673,"text":"If it is greater than or equal to the length of this string, it has the same effect as if it were equal to one less than the length of this string: this entire string may be searched.","labels":[]}
{"id":49674,"text":"a Comparator for comparing non-null values","labels":[]}
{"id":49675,"text":"the new parent, or null if the view is being removed from a parent","labels":[]}
{"id":49676,"text":"the element the content is inserted before","labels":[]}
{"id":49677,"text":"the end date, exclusive, which is converted to a LocalDate, not null","labels":[]}
{"id":49678,"text":"of a non-null object to return if the first argument is null","labels":[]}
{"id":49679,"text":"the index after the last array element that can be used in the char array","labels":[]}
{"id":49680,"text":"If the style argument does not conform to one of the expected integer bitmasks then the style is set to PLAIN.","labels":[]}
{"id":49681,"text":"indicates whether you want this JComponent to be focusable or not","labels":[]}
{"id":49682,"text":"The offset within the array of the first byte to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":49683,"text":"the position that's most important to be visible; null if there's no recommendation for a visible position within current composed text","labels":[]}
{"id":49684,"text":"the set of preferred zone ids, not null","labels":[]}
{"id":49685,"text":"the class loader to locate the provider or null to only attempt to locate an installed provider","labels":[]}
{"id":49686,"text":"If true and if the notification is periodic, the notification is scheduled with a fixed-rate execution scheme.","labels":[]}
{"id":49687,"text":"set to true if client authentication is requested, or false if no client authentication is desired.","labels":[]}
{"id":49688,"text":"the message of the exception.","labels":[]}
{"id":49689,"text":"true if the cell is to be rendered with selection highlighting","labels":[]}
{"id":49690,"text":"the value subtracted from the input values before indexing into the arrays","labels":[]}
{"id":49691,"text":"This is never null when invoked by a SAX2 parser.","labels":[]}
{"id":49692,"text":"a boolean value indicating whether mutual authentication should be used or not.","labels":[]}
{"id":49693,"text":"Component which should receive a FOCUS_GAINED event before any pending KeyEvents","labels":[]}
{"id":49694,"text":"the time-zone to use to convert the instant to date-time, not null","labels":[]}
{"id":49695,"text":"the function to use to compute the returned CompletionStage if this CompletionStage completed exceptionally","labels":[]}
{"id":49696,"text":"Must not be less than the start of newParagraph, and must not be greater than the end of newParagraph.","labels":[]}
{"id":49697,"text":"true if read-only; false if updatable","labels":[]}
{"id":49698,"text":"the boolean value that determines whether file hiding is turned on","labels":[]}
{"id":49699,"text":"the Action for the JTextField, or null","labels":[]}
{"id":49700,"text":"method handle used for test, must return boolean","labels":[]}
{"id":49701,"text":"a management interface for a platform MXBean with one single instance in the Java virtual machine being monitored, if implemented.","labels":[]}
{"id":49702,"text":"the list object to select; use null to clear the selection","labels":[]}
{"id":49703,"text":"the amount of space available for the bouncing box to move in; for a horizontal progress bar, for example, this should be the inside width of the progress bar (the component width minus borders)","labels":[]}
{"id":49704,"text":"the synchronized lines for which synchronization should be released, or null for all this mixer's synchronized lines","labels":[]}
{"id":49705,"text":"Since a Line2D object is always flat, this parameter is ignored.","labels":[]}
{"id":49706,"text":"the textual explanation of the mechanism error code.","labels":[]}
{"id":49707,"text":"The name given to the composite type this instance represents; cannot be a null or empty string.","labels":[]}
{"id":49708,"text":"whether or not suppression is enabled or disabled","labels":[]}
{"id":49709,"text":"an object that has implemented the javax.sql.RowSetListener interface and wants to be notified of any events that occur on this RowSet object; May be null.","labels":[]}
{"id":49710,"text":"name value map of the settings to set, not null","labels":[]}
{"id":49711,"text":"a String object identifying the table from which this CachedRowSet object was derived; cannot be null but may be an empty string","labels":[]}
{"id":49712,"text":"If this exception is not a RuntimeException or Error, the actual exception thrown will be a RuntimeException with cause ex.","labels":[]}
{"id":49713,"text":"the undeclared checked exception that was thrown","labels":[]}
{"id":49714,"text":"the index following the code point that should be returned","labels":[]}
{"id":49715,"text":"String value that will be incorporated in message for this exception.","labels":[]}
{"id":49716,"text":"the end date, exclusive, which is converted to a ZonedDateTime, not null","labels":[]}
{"id":49717,"text":"true if the node is expanded","labels":[]}
{"id":49718,"text":"the ImageReaderSpi that is invoking this constructor, or null.","labels":[]}
{"id":49719,"text":"the window to act as owner or null if this window has no owner","labels":[]}
{"id":49720,"text":"The index, relative to the current position, of the first character in the subsequence; must be non-negative and no larger than remaining()","labels":[]}
{"id":49721,"text":"It must match the name of a ModelMBeanAttributeInfo.","labels":[]}
{"id":49722,"text":"whether the color is obtained from SystemColor or Color.decode","labels":[]}
{"id":49723,"text":"The address to bind the socket, or null to bind to an automatically assigned socket address","labels":[]}
{"id":49724,"text":"Can be null, which is equivalent to an empty Map.","labels":[]}
{"id":49725,"text":"the array of Objects to be loaded into the data model, non-null","labels":[]}
{"id":49726,"text":"Specifies the node newly created if any, or null.","labels":[]}
{"id":49727,"text":"the array used to return the three HSB values, or null","labels":[]}
{"id":49728,"text":"Specifies whether or not meta key was depressed during the Event.","labels":[]}
{"id":49729,"text":"true if the progress bar should paint its border; otherwise, false","labels":[]}
{"id":49730,"text":"a file object to be used as hint for placement; might be null","labels":[]}
{"id":49731,"text":"true if the named class is to have assertions enabled when (and if) it is initialized, false if the class is to have assertions disabled.","labels":[]}
{"id":49732,"text":"The locator object for the error or warning (may be null).","labels":[]}
{"id":49733,"text":"the attributes to listen on, or null to mean all attributes that can change, as determined by the job","labels":[]}
{"id":49734,"text":"Passing negative parameter is not recommended.","labels":[]}
{"id":49735,"text":"The non-null mechanism name.","labels":[]}
{"id":49736,"text":"the locale, not null","labels":[]}
{"id":49737,"text":"check whether this permission is granted to the specified domain.","labels":[]}
{"id":49738,"text":"If true, sets the access permission to allow execute operations; if false to disallow execute operations","labels":[]}
{"id":49739,"text":"The public identifier of the external entity being referenced, or null if no public identifier was supplied or if the resource is not an entity.","labels":[]}
{"id":49740,"text":"a String describing the exception.","labels":[]}
{"id":49741,"text":"the instant to find the offset for, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":49742,"text":"an Action that knows how to render the audio associated with the system or user activity that is occurring; a value of null, is ignored","labels":[]}
{"id":49743,"text":"the uncaught exception.","labels":[]}
{"id":49744,"text":"whether a gap between the container and components that touch the border of the container should automatically be created","labels":[]}
{"id":49745,"text":"the date-based adjuster, not null","labels":[]}
{"id":49746,"text":"how long to linger for, if on is true.","labels":[]}
{"id":49747,"text":"A ContentHandler or a null value.","labels":[]}
{"id":49748,"text":"This parameter describes which action should be taken between the new set of nodes being inserted and the existing children of the context node.","labels":[]}
{"id":49749,"text":"false indicates that an existing session must be resumed.","labels":[]}
{"id":49750,"text":"the string to display; if the text is null, the tool tip is turned off for this component","labels":[]}
{"id":49751,"text":"the URL to load the class from, or null","labels":[]}
{"id":49752,"text":"the Class object that corresponds to the annotation type, not null","labels":[]}
{"id":49753,"text":"All positions that track change at or after the given location will move.","labels":[]}
{"id":49754,"text":"The unit size in bytes, must be a power of 2","labels":[]}
{"id":49755,"text":"timestamp of current event, or the current, system time if the current event has no timestamp, or the AWT cannot determine which event is currently being handled","labels":[]}
{"id":49756,"text":"Array of band indices, or null to use all bands","labels":[]}
{"id":49757,"text":"if this recording should be dumped when the JVM exits","labels":[]}
{"id":49758,"text":"true if table view should draw vertical lines","labels":[]}
{"id":49759,"text":"If null is passed, the wrapped implementation is ignored and ctors is returned.","labels":[]}
{"id":49760,"text":"The function f may return null to indicate that the property k will not be added to the resulting configuration.","labels":[]}
{"id":49761,"text":"true if the view is underlined, otherwise false","labels":[]}
{"id":49762,"text":"The time period in milliseconds, or 0 to indicate that no timeout should occur","labels":[]}
{"id":49763,"text":"default zoneoffset if this zoneoffset is DatatypeConstants.FIELD_UNDEFINED.","labels":[]}
{"id":49764,"text":"If true then entries are arranged in ascending order.","labels":[]}
{"id":49765,"text":"if true, inherit initial values for inheritable thread-locals from the constructing thread, otherwise no initial values are inherited","labels":[]}
{"id":49766,"text":"the cause exception, may be null","labels":[]}
{"id":49767,"text":"the start instant, inclusive, not null","labels":[]}
{"id":49768,"text":"Must not be less than zero.","labels":[]}
{"id":49769,"text":"This parameter can be null, which indicates that implementations need not check the ssl parameters","labels":[]}
{"id":49770,"text":"if false, return the true cell bounds - computed by subtracting the intercell spacing from the height and widths of the column and row models","labels":[]}
{"id":49771,"text":"the instant to create the time from, not null","labels":[]}
{"id":49772,"text":"the KeyStore.LoadStoreParameter that specifies how to load the keystore, which may be null","labels":[]}
{"id":49773,"text":"the name of the font, or null","labels":[]}
{"id":49774,"text":"This must have been passed to Predicate as one of the columns for filtering while initializing a Predicate","labels":[]}
{"id":49775,"text":"for java.sql.Types.DECIMAL or java.sql.Types.NUMERIC types, this is the number of digits after the decimal point.","labels":[]}
{"id":49776,"text":"The non-null context that fired this event.","labels":[]}
{"id":49777,"text":"Use null to request the default mechanism.","labels":[]}
{"id":49778,"text":"the locale, non-null","labels":[]}
{"id":49779,"text":"It must be a Class that implements interface Attribute.","labels":[]}
{"id":49780,"text":"The SQLException the driver is about to throw to the application","labels":[]}
{"id":49781,"text":"the day-of-week to check for or move the date to, not null","labels":[]}
{"id":49782,"text":"This may be null if there are no attributes.","labels":[]}
{"id":49783,"text":"Socket address to bind to, or null for an unbound socket.","labels":[]}
{"id":49784,"text":"must be a valid value for the openType specified for this attribute; default value not supported for ArrayType and TabularType; can be null, in which case it means that no default value is set.","labels":[]}
{"id":49785,"text":"the event class to unregistered, not null","labels":[]}
{"id":49786,"text":"If true, uncaught exceptions will be reported.","labels":[]}
{"id":49787,"text":"indicates how diagnostic information should be displayed","labels":[]}
{"id":49788,"text":"the length of the text required, not null","labels":[]}
{"id":49789,"text":"The association whose option should be set, or null if this option should be set at the channel's socket level.","labels":[]}
{"id":49790,"text":"a byte array containing the subject public key in ASN.1 DER form (or null)","labels":[]}
{"id":49791,"text":"A boolean indicating whether to generate optimized Huffman tables when writing.","labels":[]}
{"id":49792,"text":"the command to execute when the barrier is tripped, or null if there is no action","labels":[]}
{"id":49793,"text":"the object that represents the default selection for the dialog; only meaningful if options is used; can be null","labels":[]}
{"id":49794,"text":"the parent component of the dialog; can be null","labels":[]}
{"id":49795,"text":"Implementations of the Paint interface are allowed to throw NullPointerException for a null deviceBounds.","labels":[]}
{"id":49796,"text":"the end date, exclusive, which is converted to a YearMonth, not null","labels":[]}
{"id":49797,"text":"The value of this parameter must be one of: GSSCredential.INITIATE_AND_ACCEPT, GSSCredential.ACCEPT_ONLY, and GSSCredential.INITIATE_ONLY.","labels":[]}
{"id":49798,"text":"the string to be parsed and inserted after elem","labels":[]}
{"id":49799,"text":"If null, a null value is added to the attribute.","labels":[]}
{"id":49800,"text":"a boolean indicating whether to use opaque or transparent regions","labels":[]}
{"id":49801,"text":"A non-null object whose state is to be retrieved.","labels":[]}
{"id":49802,"text":"to use when no other frames are active","labels":[]}
{"id":49803,"text":"The offset within the array of the first byte to be written; must be non-negative and no larger than dst.length","labels":[]}
{"id":49804,"text":"If true, this color model supports alpha.","labels":[]}
{"id":49805,"text":"meta-message type (must be less than 128)","labels":[]}
{"id":49806,"text":"a Collection of names (or null)","labels":[]}
{"id":49807,"text":"If null, no builder is installed.","labels":[]}
{"id":49808,"text":"The after module finder to locate modules when not located by the before module finder or in parent configurations","labels":[]}
{"id":49809,"text":"the object whose run method is invoked when this thread is started.","labels":[]}
{"id":49810,"text":"tile with offsets increasing from 0 if true and with offsets decreasing from the end of the allocated space if false.","labels":[]}
{"id":49811,"text":"The new action; must not be null","labels":[]}
{"id":49812,"text":"The possibly null protocol-dependent identification to be used for authorization.","labels":[]}
{"id":49813,"text":"The offset within the array of the first double to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":49814,"text":"an Object; if a null is passed in a null is returned","labels":[]}
{"id":49815,"text":"list of descriptors that describes the fields of the event, not null","labels":[]}
{"id":49816,"text":"the maximum limit of bytes that can be read before the mark position becomes invalid.","labels":[]}
{"id":49817,"text":"Use null to act as a default acceptor principal.","labels":[]}
{"id":49818,"text":"The bytes from positions b.position() through b.position() + b.limit() -1 should have the format of a valid class file as defined by The Java™ Virtual Machine Specification.","labels":[]}
{"id":49819,"text":"Because of this, PrintJobs which require job and page control should use the version of this function which takes JobAttributes and PageAttributes objects.","labels":[]}
{"id":49820,"text":"An object representing value of the attribute before the change.","labels":[]}
{"id":49821,"text":"When doctype is not null, its Node.ownerDocument attribute is set to the document being created.","labels":[]}
{"id":49822,"text":"The number of chars to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":49823,"text":"specifies the local interface to receive multicast datagram packets, or null to defer to the interface set by setInterface(InetAddress) or setNetworkInterface(NetworkInterface)","labels":[]}
{"id":49824,"text":"the Locale for which the font is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":49825,"text":"If this is specified as nullor the implementation does not reuse the specified result, a new result object will be constructed and returned.For XPath 1.0 results, this object will be of type XPathResult.","labels":[]}
{"id":49826,"text":"Elements of this array can be null.","labels":[]}
{"id":49827,"text":"the cause of this exception or null","labels":[]}
{"id":49828,"text":"The child node before which the result nodes will be inserted.","labels":[]}
{"id":49829,"text":"a boolean, false if any node can have children, true if each node is asked to see if it can have children","labels":[]}
{"id":49830,"text":"the address to listen on, if null then bind() must be called to set the address","labels":[]}
{"id":49831,"text":"The possibly null controls to use.","labels":[]}
{"id":49832,"text":"the object to be compared for equality with this CompositeType instance; if obj is null, equals returns false.","labels":[]}
{"id":49833,"text":"the input stream from which the keystore is loaded, or null","labels":[]}
{"id":49834,"text":"the component whose maximum size is being queried; this argument is often ignored, but might be used if the UI object is stateless and shared by multiple components","labels":[]}
{"id":49835,"text":"The number of bytes to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":49836,"text":"a MessageFormat specifying the text to be used in printing a footer, or null for none","labels":[]}
{"id":49837,"text":"the local date-time, not null","labels":[]}
{"id":49838,"text":"If prefix is either null or the empty string, then failed native method resolutions are not retried for this transformer.","labels":[]}
{"id":49839,"text":"Any exception","labels":[]}
{"id":49840,"text":"the offset, not null","labels":[]}
{"id":49841,"text":"The possibly null search controls.","labels":[]}
{"id":49842,"text":"parameters for the Policy, which may be null.","labels":[]}
{"id":49843,"text":"the temporal amount to convert, not null","labels":[]}
{"id":49844,"text":"the fully qualified name of an SQL UDT or the type name of the SQL structured type being referenced by a REF type; ignored if the parameter is not a UDT or REF type","labels":[]}
{"id":49845,"text":"true if this frame is resizable; false otherwise.","labels":[]}
{"id":49846,"text":"a list of arbitrary string tag\/value pairs as connection arguments; normally at least a \"user\" and \"password\" property should be included","labels":[]}
{"id":49847,"text":"the certificate chain for the corresponding public key (only useful if the protected key is of type java.security.PrivateKey).","labels":[]}
{"id":49848,"text":"the array containing the pixel to be returned or null","labels":[]}
{"id":49849,"text":"the zone to combine with, not null","labels":[]}
{"id":49850,"text":"the other temporal object, exclusive, not null","labels":[]}
{"id":49851,"text":"the operation to perform after this operation","labels":[]}
{"id":49852,"text":"the index at which an error occurred","labels":[]}
{"id":49853,"text":"The cause of this error, or null if the cause is not known","labels":[]}
{"id":49854,"text":"the Vector to be loaded into the data model, non-null","labels":[]}
{"id":49855,"text":"name of the field to get, not null","labels":[]}
{"id":49856,"text":"a Runnable to invoke when the object becomes phantom reachable","labels":[]}
{"id":49857,"text":"whether there will be a trailing array parameter, of type Object[]","labels":[]}
{"id":49858,"text":"If null, it means this naming exception has no root cause.","labels":[]}
{"id":49859,"text":"This should be >= getStartOffset() and < getEndOffset().","labels":[]}
{"id":49860,"text":"a primitive array in which to return the pixel data or null.","labels":[]}
{"id":49861,"text":"Amount to offset the text when painting","labels":[]}
{"id":49862,"text":"A value of null means match all formats.","labels":[]}
{"id":49863,"text":"This value is conveyed to tryRelease(long) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":49864,"text":"client window's bounds on the screen; or null if the client window is iconified or invisible","labels":[]}
{"id":49865,"text":"the end temporal, exclusive, converted to be of the same type as this object, not null","labels":[]}
{"id":49866,"text":"a schema name; must match the schema name as it is stored in the database; null means schema name should not be used to narrow down the search.","labels":[]}
{"id":49867,"text":"the BiFunction to generate the id string or null","labels":[]}
{"id":49868,"text":"If true, the modality type property is set to DEFAULT_MODALITY_TYPE otherwise the dialog is modeless","labels":[]}
{"id":49869,"text":"a namespace prefix (or null to remove any existing mapping).","labels":[]}
{"id":49870,"text":"The non-null list of names of all the cipher suites to enable.","labels":[]}
{"id":49871,"text":"if true then use GZIP compatible compression","labels":[]}
{"id":49872,"text":"the locale to use, not null","labels":[]}
{"id":49873,"text":"a boolean -- true if the event {should?\/did?}","labels":[]}
{"id":49874,"text":"It must be greater than or equal to zero.","labels":[]}
{"id":49875,"text":"the unknown annotation value, may be null","labels":[]}
{"id":49876,"text":"the 3rd error message argument","labels":[]}
{"id":49877,"text":"the new value for the log level (may be null)","labels":[]}
{"id":49878,"text":"one of the following ResultSetMetaData constants: columnNoNulls, columnNullable, or columnNullableUnknown","labels":[]}
{"id":49879,"text":"the number of characters in the stream; lengths of 0 or less are undefined but will cause an invalid length exception to be thrown in the underlying JDBC driver.","labels":[]}
{"id":49880,"text":"if true, the proxy is for an MXBean, and appropriate mappings will be applied to method parameters and return values.","labels":[]}
{"id":49881,"text":"The string must be an XML name.","labels":[]}
{"id":49882,"text":"the text to parse such as \"2007-12-03T10:15:30\", not null","labels":[]}
{"id":49883,"text":"It should be used by this call site as the ultimate fallback when it can't invoke its target with the passed arguments.","labels":[]}
{"id":49884,"text":"- the popup that will be assigned to this component may be null","labels":[]}
{"id":49885,"text":"The handle's result type must be int.","labels":[]}
{"id":49886,"text":"This is the empty string when a default mapping scope ends.","labels":[]}
{"id":49887,"text":"The notation's system identifier, or null if none was given.","labels":[]}
{"id":49888,"text":"true if the table view should allow reordering; otherwise false","labels":[]}
{"id":49889,"text":"For XML, this is case-sensitive, otherwise it depends on the case-sensitivity of the markup language in use.","labels":[]}
{"id":49890,"text":"if true, sets palette border and title","labels":[]}
{"id":49891,"text":"if true consistency is checked","labels":[]}
{"id":49892,"text":"a boolean value indicating whether sequence checking should be enabled over the established context or not.","labels":[]}
{"id":49893,"text":"Specifies whether or not the event can bubble.","labels":[]}
{"id":49894,"text":"true if the alpha bits are valid; false otherwise","labels":[]}
{"id":49895,"text":"a boolean indicating whether or not to allow caching","labels":[]}
{"id":49896,"text":"array containing the names of the new columns; if this is null then the model has no columns","labels":[]}
{"id":49897,"text":"A line number describing the location of a script error causing the ScriptException to be thrown.","labels":[]}
{"id":49898,"text":"If positive, block for up to timeout milliseconds while waiting for a reference to be added to this queue.","labels":[]}
{"id":49899,"text":"the array into which the elements of the deque are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose","labels":[]}
{"id":49900,"text":"The first parameter is 1, the second is 2, and so on; must be 1 or greater","labels":[]}
{"id":49901,"text":"The prefix string to be used in generating the file's name; must be at least three characters long","labels":[]}
{"id":49902,"text":"Specify null to return all Certificates (if supported).","labels":[]}
{"id":49903,"text":"whether this window should be focused on subsequently being shown or being moved to the front","labels":[]}
{"id":49904,"text":"true if the path is expanded","labels":[]}
{"id":49905,"text":"the desired audio format after conversion","labels":[]}
{"id":49906,"text":"the BufferedImage to be written to, or null.","labels":[]}
{"id":49907,"text":"the category of a PrintServiceAttribute supported by this service - may not be null","labels":[]}
{"id":49908,"text":"whether or not to generate new parameters for the modulus length requested.","labels":[]}
{"id":49909,"text":"a window to use as the full-screen window; null if returning to windowed mode.","labels":[]}
{"id":49910,"text":"the ActionListener that is to be notified","labels":[]}
{"id":49911,"text":"the method handle to invoke after arguments are combined","labels":[]}
{"id":49912,"text":"A non-null LexicalHandler for handling lexical parse events.","labels":[]}
{"id":49913,"text":"determines if the newly constructed object has fractional metrics.","labels":[]}
{"id":49914,"text":"the new override zone, null if no override","labels":[]}
{"id":49915,"text":"whether or not the mouse is currently over the divider","labels":[]}
{"id":49916,"text":"A pointer to the MBeanServer object that must be passed to the MBeans when invoking their MBeanRegistration interface.","labels":[]}
{"id":49917,"text":"the set of values, not null","labels":[]}
{"id":49918,"text":"the number of ocurrences before generating an event.","labels":[]}
{"id":49919,"text":"The maximum number of shorts to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":49920,"text":"the day-of-week to move the date to, not null","labels":[]}
{"id":49921,"text":"if true, an input component whose parent is parentComponent is provided to allow the user to input a value.","labels":[]}
{"id":49922,"text":"The association whose option should be retrieved, or null if this option should be retrieved at the channel's socket level.","labels":[]}
{"id":49923,"text":"if true, metadata may be ignored during reads.","labels":[]}
{"id":49924,"text":"alpha must be a floating point number in the inclusive range [0.0, 1.0].","labels":[]}
{"id":49925,"text":"the number of threads to keep in the pool, even if they are idle","labels":[]}
{"id":49926,"text":"the instant to use as the clock, not null","labels":[]}
{"id":49927,"text":"The signature and return type that should be enforced dynamically at invocation time.","labels":[]}
{"id":49928,"text":"the end time, exclusive, which is converted to a LocalTime, not null","labels":[]}
{"id":49929,"text":"The non-null class name of the object to which this reference refers.","labels":[]}
{"id":49930,"text":"whether or not to verify the JarInputStream if it is signed.","labels":[]}
{"id":49931,"text":"the ImageObserver object to be notified as the image is being prepared","labels":[]}
{"id":49932,"text":"This will never be null.","labels":[]}
{"id":49933,"text":"The value of zero means that call sites will never be considered unstable.","labels":[]}
{"id":49934,"text":"the fully-qualified name of an SQL user-defined type; ignored if the parameter is not a user-defined type or SQL REF value","labels":[]}
{"id":49935,"text":"Whether waitForIdle is automatically invoked","labels":[]}
{"id":49936,"text":"The possibly null request controls to use for the new context.","labels":[]}
{"id":49937,"text":"the Window to act as owner or null if this window has no owner","labels":[]}
{"id":49938,"text":"true if the decimal separator is always shown; false otherwise","labels":[]}
{"id":49939,"text":"An object that implements the URIResolver interface, or null.","labels":[]}
{"id":49940,"text":"the audio format before conversion","labels":[]}
{"id":49941,"text":"The non-null NamingException that was thrown.","labels":[]}
{"id":49942,"text":"the native whose corresponding DataFlavors should be returned.","labels":[]}
{"id":49943,"text":"the text displayed for the particular message; may be null","labels":[]}
{"id":49944,"text":"This is just past the ':' (if there is one) that specifies the determination of the protocol name.","labels":[]}
{"id":49945,"text":"the formatter to use, not null","labels":[]}
{"id":49946,"text":"The namespace URI of the document element to create or null.","labels":[]}
{"id":49947,"text":"the underlying reason for this SQLWarning (which is saved for later retrieval by the getCause() method); may be null indicating the cause is non-existent or unknown.","labels":[]}
{"id":49948,"text":"Character used when formatting if the value does not completely fill the mask","labels":[]}
{"id":49949,"text":"A null value will cause a SQLException to be thrown.","labels":[]}
{"id":49950,"text":"The Array object passed to this method must return a non-null Object for all getArray() method calls.","labels":[]}
{"id":49951,"text":"the element the content is inserted after","labels":[]}
{"id":49952,"text":"the end date, exclusive, which is converted to a Year, not null","labels":[]}
{"id":49953,"text":"The declared system identifier for the external DTD subset, or null if none was declared.","labels":[]}
{"id":49954,"text":"if true, recursively enumerate all subgroups","labels":[]}
{"id":49955,"text":"the set of properties to set when the group is recreated.","labels":[]}
{"id":49956,"text":"The index, relative to the current position, of the character following the last character in the subsequence; must be no smaller than start and no larger than remaining()","labels":[]}
{"id":49957,"text":"The public identifier of the external entity being referenced, or null if none was supplied.","labels":[]}
{"id":49958,"text":"a reference to be checked against null","labels":[]}
{"id":49959,"text":"If true, the execute permission applies only to the owner's execute permission; otherwise, it applies to everybody.","labels":[]}
{"id":49960,"text":"May be null, to indicate the default platform encoding.","labels":[]}
{"id":49961,"text":"the Japanese era, not null","labels":[]}
{"id":49962,"text":"This value is conveyed to tryRelease(int) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":49963,"text":"A string representing the attribute's default value, or null if there is none.","labels":[]}
{"id":49964,"text":"The offset within the buffer array of the first buffer into which bytes are to be transferred; must be non-negative and no larger than dsts.length","labels":[]}
{"id":49965,"text":"true if this button is to be selected, otherwise false","labels":[]}
{"id":49966,"text":"It is recommended to use the InputEvent.getMaskForButton(button) method to obtain the mask for any mouse button by its number.","labels":[]}
{"id":49967,"text":"whether node is expanded","labels":[]}
{"id":49968,"text":"the destination WritableRaster, or null","labels":[]}
{"id":49969,"text":"the LoadStoreParameter that specifies how to load the keystore, which may be null","labels":[]}
{"id":49970,"text":"the target object to be adjusted, not null","labels":[]}
{"id":49971,"text":"This name is internally converted to the canonical lower case format before performing the match.","labels":[]}
{"id":49972,"text":"If it is null, the thread calling sendNotification will invoke the handleNotification method itself.","labels":[]}
{"id":49973,"text":"Can be null, which is equivalent to an empty map.","labels":[]}
{"id":49974,"text":"true if this component should be opaque","labels":[]}
{"id":49975,"text":"whether focus traversal keys are enabled for this Component","labels":[]}
{"id":49976,"text":"extra parameters, can be null.","labels":[]}
{"id":49977,"text":"Specifies whether dispatch should catch Throwable when executing the Runnable's run method, or should instead propagate those Throwables to the EventDispatchThread's dispatch loop","labels":[]}
{"id":49978,"text":"the method handle to invoke after arguments are retyped","labels":[]}
{"id":49979,"text":"the locale for which the resource bundle should be instantiated","labels":[]}
{"id":49980,"text":"The specific error message.","labels":[]}
{"id":49981,"text":"The maximum number of buffers to be accessed; must be non-negative and no larger than srcs.length - offset","labels":[]}
{"id":49982,"text":"number of parameters (excluding the final array parameter if any)","labels":[]}
{"id":49983,"text":"the position at which to start folding and at which to insert the folding result; if this is 0, the effect is the same as for foldArguments(MethodHandle, MethodHandle).","labels":[]}
{"id":49984,"text":"the method handle to invoke after arguments are reordered","labels":[]}
{"id":49985,"text":"When used with invokedynamic, this is stacked automatically by the VM.","labels":[]}
{"id":49986,"text":"DialogType.COMMON, DialogType.NATIVE, or DialogType.NONE.","labels":[]}
{"id":49987,"text":"if > 0, specifies a fixed response body length and that exact number of bytes must be written to the stream acquired from getResponseBody(), or else if equal to 0, then chunked encoding is used, and an arbitrary number of bytes may be written.","labels":[]}
{"id":49988,"text":"May be null or \"-\", which represents a member that is implied by any member but does not imply any other member.","labels":[]}
{"id":49989,"text":"the character set used for decoding bytes; if null use the platform default","labels":[]}
{"id":49990,"text":"The possibly null attributes to be bound with the object.","labels":[]}
{"id":49991,"text":"the String representing the URL that must be parsed.","labels":[]}
{"id":49992,"text":"the instant to find the offset information for, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":49993,"text":"the position to parse from, updated with length parsed and the index of any error, not null","labels":[]}
{"id":49994,"text":"the collection of SNIMatchers (or null)","labels":[]}
{"id":49995,"text":"If null, no such information is available.","labels":[]}
{"id":49996,"text":"If null then the existing parameters (if any) remain unchanged.","labels":[]}
{"id":49997,"text":"A non-null byte array containing the encoded bytes from the server.","labels":[]}
{"id":49998,"text":"the end date, exclusive, not null","labels":[]}
{"id":49999,"text":"the caption displayed above the text, usually in bold; may be null","labels":[]}
{"id":50000,"text":"It is not an error for it to be a different string.","labels":[]}
{"id":50001,"text":"a description of the property list, or null if no comment is desired.","labels":[]}
{"id":50002,"text":"whether or not the tab should be enabled","labels":[]}
{"id":50003,"text":"the maximum amount that the control points for a given curve can vary from collinear before a subdivided curve is replaced by a straight line connecting the endpoints.","labels":[]}
{"id":50004,"text":"the first column is 1, the second is 2, and so on; must be between 1 and the number of columns, inclusive between 1 and the number of columns, inclusive","labels":[]}
{"id":50005,"text":"If true, the writer will write the data to the end of the file rather than the beginning.","labels":[]}
{"id":50006,"text":"This cannot be null but may be empty.","labels":[]}
{"id":50007,"text":"The exception or error to be encapsulated in a SchemaFactoryConfigurationError.","labels":[]}
{"id":50008,"text":"an optional AffineTransform to be applied to the coordinates as they are returned in the iteration, or null if untransformed coordinates are desired.","labels":[]}
{"id":50009,"text":"the offset to combine with, not null","labels":[]}
{"id":50010,"text":"the new text to be set; if null the old text will be deleted","labels":[]}
{"id":50011,"text":"the object whose field should be modified","labels":[]}
{"id":50012,"text":"true if authorization is allowed; false otherwise","labels":[]}
{"id":50013,"text":"The nonnull name of the object resolved relative to this context.","labels":[]}
{"id":50014,"text":"the field to get the range for, not null","labels":[]}
{"id":50015,"text":"whether or not to paint labels","labels":[]}
{"id":50016,"text":"The following standard button masks are also accepted: InputEvent.BUTTON1_MASK InputEvent.BUTTON2_MASK InputEvent.BUTTON3_MASK However, it is recommended to use InputEvent.BUTTON1_DOWN_MASK, InputEvent.BUTTON2_DOWN_MASK, InputEvent.BUTTON3_DOWN_MASK instead.","labels":[]}
{"id":50017,"text":"the string to clip, may be null","labels":[]}
{"id":50018,"text":"element to be removed from this queue, if present","labels":[]}
{"id":50019,"text":"the keystore password, which may be null","labels":[]}
{"id":50020,"text":"\"standard\" input; use System.in if null","labels":[]}
{"id":50021,"text":"name\/value map of the settings to set, not null","labels":[]}
{"id":50022,"text":"if positive, block for up to timeout milliseconds; if zero, block indefinitely; must not be negative","labels":[]}
{"id":50023,"text":"must be valid for the openType specified for this parameter; can be null, in which case it means that no minimal value is set.","labels":[]}
{"id":50024,"text":"the temporal object to add the amount to, not null","labels":[]}
{"id":50025,"text":"true if classes loaded by this classloader and belonging to the named package or any of its subpackages will have assertions enabled by default, false if they will have assertions disabled by default.","labels":[]}
{"id":50026,"text":"Elements of the array can be null.","labels":[]}
{"id":50027,"text":"if true, resizing is allowed; otherwise false","labels":[]}
{"id":50028,"text":"Detail about this exception.","labels":[]}
{"id":50029,"text":"the field to append, not null","labels":[]}
{"id":50030,"text":"a WritableRaster to hold the returned portion of the image, or null.","labels":[]}
{"id":50031,"text":"If this parameter is null then the cursor for this window will be set to the type Cursor.DEFAULT_CURSOR.","labels":[]}
{"id":50032,"text":"A null gc implies that the validate method should skip the compatibility test.","labels":[]}
{"id":50033,"text":"if non-null, the handler invoked upon a drop to a subscriber, with arguments of the subscriber and item; if it returns true, an offer is re-attempted (once)","labels":[]}
{"id":50034,"text":"if true, the border is painted.","labels":[]}
{"id":50035,"text":"the fully-qualified name of an SQL user-defined type; ignored if the parameter is not a user-defined type or REF","labels":[]}
{"id":50036,"text":"The context to be sent to the listener with the notification when a notification is emitted.","labels":[]}
{"id":50037,"text":"the cause (can be null)","labels":[]}
{"id":50038,"text":"If true, this component is enabled; otherwise this component is disabled","labels":[]}
{"id":50039,"text":"true if minValue is inclusive.","labels":[]}
{"id":50040,"text":"Specifying a name is optional; if it is omitted, name should be null.","labels":[]}
{"id":50041,"text":"The before module finder to find modules","labels":[]}
{"id":50042,"text":"If the value of this parameter is less than the actual signature length, this method will throw a SignatureException.","labels":[]}
{"id":50043,"text":"an optional AffineTransform to be applied to the coordinates as they are returned in the iteration, or null if the untransformed coordinates are desired.","labels":[]}
{"id":50044,"text":"object to be removed from this set, if present","labels":[]}
{"id":50045,"text":"true if the components should continuously be redrawn as the divider changes position","labels":[]}
{"id":50046,"text":"a mechanism-specific XML structure from which to unmarshal the parameters from (may be null if not required or optional)","labels":[]}
{"id":50047,"text":"the era of the correct type for the chronology, not null","labels":[]}
{"id":50048,"text":"This value is conveyed to tryAcquire(int) but is otherwise uninterpreted and can represent anything you like.","labels":[]}
{"id":50049,"text":"May be null if none of the messages require localization.","labels":[]}
{"id":50050,"text":"true if the check box menu item is on, otherwise false","labels":[]}
{"id":50051,"text":"the initial orientation -- it must be either HORIZONTAL or VERTICAL","labels":[]}
{"id":50052,"text":"true implies the track should be muted, false implies the track should be unmuted.","labels":[]}
{"id":50053,"text":"For example, for formatting a number 123456789 in Locale.US locale, if the given fieldPosition is NumberFormat.INTEGER_FIELD, the begin index and end index of fieldPosition will be set to 0 and 11, respectively for the output string 123,456,789.","labels":[]}
{"id":50054,"text":"If the returned value is cd, then cd.getCompositeType().equals(ct) should be true.","labels":[]}
{"id":50055,"text":"The offset within the array of the first int to be written; must be non-negative and no larger than dst.length","labels":[]}
{"id":50056,"text":"a boolean value, true if this event is a trigger for a popup-menu","labels":[]}
{"id":50057,"text":"of the class, or null if not known","labels":[]}
{"id":50058,"text":"a list of paths, if null use the default search path for this location","labels":[]}
{"id":50059,"text":"The object to be attached; may be null","labels":[]}
{"id":50060,"text":"If both arrays are empty, then an empty descriptor is created.","labels":[]}
{"id":50061,"text":"if true, component c will be validated before being painted","labels":[]}
{"id":50062,"text":"The group to which the newly constructed channel should be bound, or null for the default group","labels":[]}
{"id":50063,"text":"The string code can only be a string unit type (i.e.","labels":[]}
{"id":50064,"text":"true if Expect continue to be sent","labels":[]}
{"id":50065,"text":"the authority key identifier (or null)","labels":[]}
{"id":50066,"text":"a schema name; must match the schema name as it is stored in this database; \"\" retrieves those without a schema; null means that the schema name should not be used to narrow the search","labels":[]}
{"id":50067,"text":"the asynchronous exception to throw.","labels":[]}
{"id":50068,"text":"Possibly null detail about this exception.","labels":[]}
{"id":50069,"text":"Use true if rolling up, false otherwise.","labels":[]}
{"id":50070,"text":"Note that this object should not be modified by the PropertyEditor, rather the PropertyEditor should create a new object to hold any modified value.","labels":[]}
{"id":50071,"text":"\"standard\" error; use System.err if null","labels":[]}
{"id":50072,"text":"This method does nothing if img is null.","labels":[]}
{"id":50073,"text":"If null, then all attribute changes will cause an attributeChangeNotification to be issued.","labels":[]}
{"id":50074,"text":"the event class to register, not null","labels":[]}
{"id":50075,"text":"the local date-time to query, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":50076,"text":"An appropriate IIOParamController, or null.","labels":[]}
{"id":50077,"text":"The error information encoded as an exception.","labels":[]}
{"id":50078,"text":"The class loader to be used to load provider-configuration files and provider classes, or null if the system class loader (or, failing that, the bootstrap class loader) is to be used","labels":[]}
{"id":50079,"text":"the type, not null","labels":[]}
{"id":50080,"text":"an array of Strings indicating the class names of any additional formats supported by this object, or null if there are none.","labels":[]}
{"id":50081,"text":"The error or warning message, or null to use the message from the embedded exception.","labels":[]}
{"id":50082,"text":"If true, Containers should re-layout their components as the Container is being resized.","labels":[]}
{"id":50083,"text":"The offset within the array of the first long to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":50084,"text":"The non-null RDN to add.","labels":[]}
{"id":50085,"text":"the ImageWriterSpi that is constructing this object, or null.","labels":[]}
{"id":50086,"text":"true if the least double is desired; false otherwise","labels":[]}
{"id":50087,"text":"the destination path, or null if recording should not be dumped at stop","labels":[]}
{"id":50088,"text":"the guarded invocation that the call site should use to build its target method handle.","labels":[]}
{"id":50089,"text":"the initial Cursor for this drag operation or null for the default cursor handling; see class level documentation for more details on the cursor handling mechanism during drag and drop","labels":[]}
{"id":50090,"text":"The Image to drag or null","labels":[]}
{"id":50091,"text":"true if the column is case sensitive; false if it is not","labels":[]}
{"id":50092,"text":"the month-of-year to represent, not null","labels":[]}
{"id":50093,"text":"delay in milliseconds before task is to be executed.","labels":[]}
{"id":50094,"text":"This parameter can be null if the caller is not interested in it.","labels":[]}
{"id":50095,"text":"name of the method in the annotation interface to find, not null","labels":[]}
{"id":50096,"text":"the output stream to which RMI calls should be logged","labels":[]}
{"id":50097,"text":"used to indicate that the child should be notified that it is no longer nested in this BeanContext.","labels":[]}
{"id":50098,"text":"the JTable that is asking the renderer to draw; can be null","labels":[]}
{"id":50099,"text":"This may be the parent before or after the change, depending on the type of change","labels":[]}
{"id":50100,"text":"Cannot be null.","labels":[]}
{"id":50101,"text":"the NetworkInterface through which the test will be done, or null for any interface","labels":[]}
{"id":50102,"text":"The local name (without prefix), or the empty string if Namespace processing is not being performed.","labels":[]}
{"id":50103,"text":"the tab index where the foreground should be set","labels":[]}
{"id":50104,"text":"the day-of-week, not null","labels":[]}
{"id":50105,"text":"If defaultsis null or a field within the specified defaults is undefined, just use java.util.GregorianCalendar defaults.","labels":[]}
{"id":50106,"text":"one of the ResultSet constants specifying a concurrency level: ResultSet.CONCUR_READ_ONLY or ResultSet.CONCUR_UPDATABLE","labels":[]}
{"id":50107,"text":"if true the class will be initialized.","labels":[]}
{"id":50108,"text":"the object to be compared for equality with this SimpleType instance; if obj is null or is not an instance of the class SimpleType, equals returns false.","labels":[]}
{"id":50109,"text":"The radix to use when scanning numbers","labels":[]}
{"id":50110,"text":"The options to provide to the agent's agentmain method (can be null).","labels":[]}
{"id":50111,"text":"the time-zone, which may be an offset, not null","labels":[]}
{"id":50112,"text":"the second list, may be empty but not null","labels":[]}
{"id":50113,"text":"the reference URI (may be null)","labels":[]}
{"id":50114,"text":"the format style to use, not null","labels":[]}
{"id":50115,"text":"the temporal object to convert, not null","labels":[]}
{"id":50116,"text":"the non-null Image to be used","labels":[]}
{"id":50117,"text":"the local date-time to query for valid offsets, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":50118,"text":"an associative, non-interfering, stateless function that accepts two partial result containers and merges them, which must be compatible with the accumulator function.","labels":[]}
{"id":50119,"text":"true if this button will be capable of being the default button on the RootPane; otherwise false","labels":[]}
{"id":50120,"text":"true if the column is a signed number; false if it is not","labels":[]}
{"id":50121,"text":"the new error handler","labels":[]}
{"id":50122,"text":"the index of the value to get in this TabularData instance; must be valid with this TabularData instance's row type definition; must not be null.","labels":[]}
{"id":50123,"text":"the exception to nest","labels":[]}
{"id":50124,"text":"The array cannot be null.","labels":[]}
{"id":50125,"text":"The number of ints to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":50126,"text":"the destination for the filtering operation or null","labels":[]}
{"id":50127,"text":"true if the KeyStroke should represent a key release; false otherwise.","labels":[]}
{"id":50128,"text":"If a listener was registered twice, one with capture and one without, each must be removed separately.","labels":[]}
{"id":50129,"text":"The qualified name (with prefix), or the empty string if qualified names are not available.","labels":[]}
{"id":50130,"text":"the qualified name (with prefix), or the empty string if qualified names are not available","labels":[]}
{"id":50131,"text":"The parent class loader for each of the class loaders created by this method; may be null for the bootstrap class loader","labels":[]}
{"id":50132,"text":"a String object containing an SQL query that will be set as this RowSet object's command property; may be null but may not be an empty string","labels":[]}
{"id":50133,"text":"the default value for the Object reference, or null.","labels":[]}
{"id":50134,"text":"the literal to append, not null","labels":[]}
{"id":50135,"text":"the month-day to use, not null","labels":[]}
{"id":50136,"text":"the size after truncation","labels":[]}
{"id":50137,"text":"the width to use when justifying the line.","labels":[]}
{"id":50138,"text":"the other time to compare to, not null","labels":[]}
{"id":50139,"text":"the input stream from which the AudioInputStream should be constructed","labels":[]}
{"id":50140,"text":"if true, retrieves all locked ownable synchronizers.","labels":[]}
{"id":50141,"text":"array of strings, each element of which has environment variable settings in the format name=value, or null if the subprocess should inherit the environment of the current process.","labels":[]}
{"id":50142,"text":"the DragGestureRecognizer to notify when a drag gesture is detected","labels":[]}
{"id":50143,"text":"If flags == USE_ALL_BEANINFO then we use all of the BeanInfo classes we can discover.","labels":[]}
{"id":50144,"text":"The Unicode character generated by this event, or CHAR_UNDEFINED (for key-pressed and key-released events which do not map to a valid Unicode character)","labels":[]}
{"id":50145,"text":"This parameter can be null.","labels":[]}
{"id":50146,"text":"if false, any node without children is a leaf node; if true, only nodes that do not allow children are leaf nodes","labels":[]}
{"id":50147,"text":"the field to query the range for, not null","labels":[]}
{"id":50148,"text":"If it is a parameter entity, the name will begin with '%', and if it is the external DTD subset, it will be the string \"[dtd]\"","labels":[]}
{"id":50149,"text":"The possibly null SSL socket factory to use.","labels":[]}
{"id":50150,"text":"the child views to add; this value can be null to indicate no children are being added (useful to remove)","labels":[]}
{"id":50151,"text":"doc flavor for a supposed job, or null","labels":[]}
{"id":50152,"text":"a procedure name pattern; must match the function name as it is stored in the database","labels":[]}
{"id":50153,"text":"parameters for the Configuration, which may be null.","labels":[]}
{"id":50154,"text":"if true charset is ignoring","labels":[]}
{"id":50155,"text":"whether or not the stack trace is writable","labels":[]}
{"id":50156,"text":"If the default ScriptContext of the ScriptEngine defines additional scopes, any of them can be passed to get the corresponding Bindings.","labels":[]}
{"id":50157,"text":"the security manager or null","labels":[]}
{"id":50158,"text":"If the parameter is of JDBC type JDBCType.NUMERIC or JDBCType.DECIMAL, the version of registerOutParameter that accepts a scale value should be used.","labels":[]}
{"id":50159,"text":"Any exception.","labels":[]}
{"id":50160,"text":"The offset within the array of the first char to be read; must be non-negative and no larger than array.length","labels":[]}
{"id":50161,"text":"the error message.","labels":[]}
{"id":50162,"text":"an initial listener; can be null","labels":[]}
{"id":50163,"text":"the flag to indicate bundle reloading; true if reloading an expired resource bundle, false otherwise","labels":[]}
{"id":50164,"text":"the password, which may be null","labels":[]}
{"id":50165,"text":"if true, rollover effects should be painted","labels":[]}
{"id":50166,"text":"the text to parse such as \"--12-03\", not null","labels":[]}
{"id":50167,"text":"A null record is silently ignored and is not published","labels":[]}
{"id":50168,"text":"the length, in bytes, to which the BLOB value that this Blob object represents should be truncated","labels":[]}
{"id":50169,"text":"an IIOMetadata object that will be used for writing, or null.","labels":[]}
{"id":50170,"text":"The source document must be an XML fragment, i.e.","labels":[]}
{"id":50171,"text":"if true, the values will be clamped to the range 1..255","labels":[]}
{"id":50172,"text":"the component to be displayed when this tab is clicked.","labels":[]}
{"id":50173,"text":"Passing negative value is not recommended.","labels":[]}
{"id":50174,"text":"the length of the valid message data in the array, including the status byte; it should be non-negative and less than or equal to data.length","labels":[]}
{"id":50175,"text":"the reference type, as a URI (may be null)","labels":[]}
{"id":50176,"text":"the instant to create the date from, not null","labels":[]}
{"id":50177,"text":"If the region being drawn is ScrollBarSlider, then the component will be JScrollBar.","labels":[]}
{"id":50178,"text":"the composite data value to be added as a new row to this TabularData instance; must be of the same composite type as this instance's row type; must not be null.","labels":[]}
{"id":50179,"text":"the mechanism level error code for the problem causing this exception to be thrown.","labels":[]}
{"id":50180,"text":"Input schemas must be XML documents or XML elements and must not be null.","labels":[]}
{"id":50181,"text":"the raw non-localized logging message (may be null)","labels":[]}
{"id":50182,"text":"The number of arguments that the returned function must accept.","labels":[]}
{"id":50183,"text":"the local name (without prefix), or the empty string if Namespace processing is not being performed","labels":[]}
{"id":50184,"text":"the reference ID (may be null)","labels":[]}
{"id":50185,"text":"the exception that occurred during ServerSocket creation","labels":[]}
{"id":50186,"text":"A CertSelector used to select which Certificates should be returned.","labels":[]}
{"id":50187,"text":"a filter object (may be null)","labels":[]}
{"id":50188,"text":"If the underlying file system can not distinguish the owner's read permission from that of others, then the permission will apply to everybody, regardless of this value.","labels":[]}
{"id":50189,"text":"a error message","labels":[]}
{"id":50190,"text":"the minimum CRL number accepted (or null)","labels":[]}
{"id":50191,"text":"the remapping function to recompute a value if present","labels":[]}
{"id":50192,"text":"list of annotation elements that describes the annotations on the event, not null","labels":[]}
{"id":50193,"text":"If this parameter is null then the default attributes are used.","labels":[]}
{"id":50194,"text":"All information after the sharp sign indicates an anchor.","labels":[]}
{"id":50195,"text":"If null, no builder is set.","labels":[]}
{"id":50196,"text":"A string representing the attribute defaulting mode (\"#IMPLIED\", \"#REQUIRED\", or \"#FIXED\") or null if none of these applies.","labels":[]}
{"id":50197,"text":"If true, the modality type property is set to DEFAULT_MODALITY_TYPE, otherwise the dialog is modeless.","labels":[]}
{"id":50198,"text":"A boolean that equals true if the event is one of a series of multiple adjusting events, otherwise false","labels":[]}
{"id":50199,"text":"true if name is a name relative to the target context (which is named by the first parameter of the listBindings() method); false if name is a URL string.","labels":[]}
{"id":50200,"text":"the 1st error message argument","labels":[]}
{"id":50201,"text":"the onError argument sent to subscribers","labels":[]}
{"id":50202,"text":"Exception that we may have caught to reissue as an InvalidTargetObjectTypeException.","labels":[]}
{"id":50203,"text":"the exception handler for the parser, or null to use the default exception handler","labels":[]}
{"id":50204,"text":"It must be an IANA-registered name of a SASL mechanism.","labels":[]}
{"id":50205,"text":"the standard offset, not null","labels":[]}
{"id":50206,"text":"This object may be reused by the DOM implementation across multiple calls to the handleError method.","labels":[]}
{"id":50207,"text":"The offset within the array of the first long to be written; must be non-negative and no larger than dst.length","labels":[]}
{"id":50208,"text":"an ObjectInputFilter applied when deserializing invocation arguments; may be null","labels":[]}
{"id":50209,"text":"the mapping function to apply to a value, if present","labels":[]}
{"id":50210,"text":"one of the Strings returned by getCompressionTypes, or null to remove any previous setting.","labels":[]}
{"id":50211,"text":"The element to insert before, or null for the tail of the list.","labels":[]}
{"id":50212,"text":"If name is null, the logical font name of the new Font as returned by getName() is set to the name \"Default\".","labels":[]}
{"id":50213,"text":"Use null to specify the default principal.","labels":[]}
{"id":50214,"text":"If null, this exception has no detail message.","labels":[]}
{"id":50215,"text":"true to indicate that this RowSet object is read-only; false to indicate that it is updatable","labels":[]}
{"id":50216,"text":"a Mixer.Info object representing the desired mixer, or null for the system default mixer","labels":[]}
{"id":50217,"text":"to be browsable, must be non-null","labels":[]}
{"id":50218,"text":"value indicating which of start's neighbors or start should be returned","labels":[]}
{"id":50219,"text":"Additional spliterator characteristics of this spliterator's source or elements beyond SIZED and SUBSIZED which are always reported","labels":[]}
{"id":50220,"text":"an ImageTypeSpecifier indicating the type of image to be written, or null.","labels":[]}
{"id":50221,"text":"if true and border property is not null, the border is painted","labels":[]}
{"id":50222,"text":"The specification only defines the URI DEFAULT_OBJECT_MODEL_URI, http:\/\/java.sun.com\/jaxp\/xpath\/dom for the W3C DOM, the org.w3c.dom package, and implementations are free to introduce other URIs for other object models.","labels":[]}
{"id":50223,"text":"the name of the host, or null.","labels":[]}
{"id":50224,"text":"An Object value which needs to be checked, whether it can be part of this FilterRowSet.","labels":[]}
{"id":50225,"text":"the type of listeners requested; this parameter should specify an interface that descends from java.util.EventListener","labels":[]}
{"id":50226,"text":"the object to use as this thread's uncaught exception handler.","labels":[]}
{"id":50227,"text":"if true the image will be loaded when first asked for, otherwise it will be asynchronously.","labels":[]}
{"id":50228,"text":"If null it is ignored.","labels":[]}
{"id":50229,"text":"Must be a String that conforms to the URI syntax.","labels":[]}
{"id":50230,"text":"if the width of children should be synchronized","labels":[]}
{"id":50231,"text":"the filter expression to use for the search; may not be null","labels":[]}
{"id":50232,"text":"If null, an identity transform is used.","labels":[]}
{"id":50233,"text":"null is a valid value","labels":[]}
{"id":50234,"text":"If null, check whether the attribute has an attribute value whose value is null.","labels":[]}
{"id":50235,"text":"A value of null may be a valid value for some socket options.","labels":[]}
{"id":50236,"text":"the action to run before completing the returned CompletableFuture","labels":[]}
{"id":50237,"text":"If a specific type is specified, then the result will be returned as the corresponding type.For XPath 1.0 results, this must be one of the codes of the XPathResult interface.","labels":[]}
{"id":50238,"text":"The only legal values are KEY_LOCATION_UNKNOWN, KEY_LOCATION_STANDARD, KEY_LOCATION_LEFT, KEY_LOCATION_RIGHT, and KEY_LOCATION_NUMPAD.","labels":[]}
{"id":50239,"text":"If flags == IGNORE_IMMEDIATE_BEANINFO then we ignore any BeanInfo associated with the specified beanClass.","labels":[]}
{"id":50240,"text":"the destination's ColorModel, which can be null.","labels":[]}
{"id":50241,"text":"true when this array describes primitive arrays.","labels":[]}
{"id":50242,"text":"If a is null then any previously set authenticator is removed.","labels":[]}
{"id":50243,"text":"the File from which file format information should be extracted","labels":[]}
{"id":50244,"text":"true to request a shared lock, in which case this channel must be open for reading (and possibly writing); false to request an exclusive lock, in which case this channel must be open for writing (and possibly reading)","labels":[]}
{"id":50245,"text":"The Namespace URI, or the empty string if the element has no Namespace URI or if Namespace processing is not being performed.","labels":[]}
{"id":50246,"text":"May be null, in which case no additional checkers will be used.","labels":[]}
{"id":50247,"text":"the Paint object to be used to generate color during the rendering process, or null","labels":[]}
{"id":50248,"text":"true if this menu item is on the part of the menu path that changed, false if this menu is part of the a menu path that changed, but this particular part of that path is still the same","labels":[]}
{"id":50249,"text":"The initial Cursor for this drag operation or null for the default cursor handling; see DragSourceContext for more details on the cursor handling mechanism during drag and drop","labels":[]}
{"id":50250,"text":"if true, the portion preceding the advance should be used, if false the portion after should be used.","labels":[]}
{"id":50251,"text":"(Note that this is not resolved against the document base URI.)","labels":[]}
{"id":50252,"text":"the field to check, null returns false","labels":[]}
{"id":50253,"text":"true if the component was internally created","labels":[]}
{"id":50254,"text":"Used to indicate if literal characters in mask should be returned in stringToValue","labels":[]}
{"id":50255,"text":"the initial Cursor for this drag operation, or null for the default cursor handling; see class level documentation for more details on the cursor handling during drag and drop","labels":[]}
{"id":50256,"text":"the pattern string to parse; not null","labels":[]}
{"id":50257,"text":"true if, and only if, the invoker can provide no additional input characters beyond those in the given buffer","labels":[]}
{"id":50258,"text":"If it is negative, it has the same effect as if it were -1: -1 is returned.","labels":[]}
{"id":50259,"text":"the underlying model to use, or null","labels":[]}
{"id":50260,"text":"true if the lenient mode is to be turned on; false if it is to be turned off.","labels":[]}
{"id":50261,"text":"the DOM Node that caused the exception, or null.","labels":[]}
{"id":50262,"text":"place in newTypes where the non-skipped target parameters must occur","labels":[]}
{"id":50263,"text":"the text to parse, not null","labels":[]}
{"id":50264,"text":"whether or not to paint the slider track","labels":[]}
{"id":50265,"text":"The number of longs to be read from the given array; must be non-negative and no larger than array.length - offset","labels":[]}
{"id":50266,"text":"if true make the cookie HTTP only, i.e.","labels":[]}
{"id":50267,"text":"An implementation should avoid retrieving the lookup if it is not needed so as to avoid the expense of AccessController.doPrivileged call.","labels":[]}
{"id":50268,"text":"JFormattedTextField.AbstractFormatter to use when the JFormattedTextField does not have focus","labels":[]}
{"id":50269,"text":"the duration of each visible tick, not negative, not null","labels":[]}
{"id":50270,"text":"the stratum to use for comparing line number and source name, or null to use the defaultStratum().","labels":[]}
{"id":50271,"text":"ignore encoding errors if true","labels":[]}
{"id":50272,"text":"true if the newly created copy should be stopped immediately, false otherwise","labels":[]}
{"id":50273,"text":"If true, the write permission applies only to the owner's write permission; otherwise, it applies to everybody.","labels":[]}
{"id":50274,"text":"Any new event type must not begin with any upper, lower, or mixed case version of the string \"DOM\".","labels":[]}
{"id":50275,"text":"The TargetedNotification array in the returned NotificationResult can have more elements than this if the same notification appears more than once.","labels":[]}
{"id":50276,"text":"The context to be sent to the listener when a notification is emitted.","labels":[]}
{"id":50277,"text":"the array of attributes to set atomically when creating the symbolic link","labels":[]}
{"id":50278,"text":"the text after the insertion","labels":[]}
{"id":50279,"text":"If null, an array of appropriate type and size will be allocated","labels":[]}
{"id":50280,"text":"the other object to compare to, null returns false","labels":[]}
{"id":50281,"text":"Can be null.","labels":[]}
{"id":50282,"text":"triplets of the rest of primes, null can be specified if there are only two prime factors (p and q)","labels":[]}
{"id":50283,"text":"the MIDI controller numbers for which change notification should be cancelled, or null to cancel for all controllers","labels":[]}
{"id":50284,"text":"the name of the table that exports the key; must match the table name as it is stored in the database","labels":[]}
{"id":50285,"text":"The data type must be either DataBuffer.TYPE_BYTE or DataBuffer.TYPE_USHORT.","labels":[]}
{"id":50286,"text":"the type of files to be displayed: JFileChooser.FILES_ONLY JFileChooser.DIRECTORIES_ONLY JFileChooser.FILES_AND_DIRECTORIES","labels":[]}
{"id":50287,"text":"It must accept its own return type (if non-void) plus an int parameter (for the counter), and may accept any number of additional types.","labels":[]}
{"id":50288,"text":"the minimum number of integer digits to be shown; if less than zero, then zero is used.","labels":[]}
{"id":50289,"text":"true if the progress bar should change to indeterminate mode; false if it should revert to normal.","labels":[]}
{"id":50290,"text":"the keytab File object, must not be null","labels":[]}
{"id":50291,"text":"the component that will display the string, may be null","labels":[]}
{"id":50292,"text":"true if the pixels should always be converted to the default RGB ColorModel","labels":[]}
{"id":50293,"text":"The possibly null Attributes that is to be bound with the object.","labels":[]}
{"id":50294,"text":"the unqualified name of the method (ignored if kind is CONSTRUCTOR)","labels":[]}
{"id":50295,"text":"null means no environment is being recorded for this exception.","labels":[]}
{"id":50296,"text":"the compilation units to compile, null means no compilation units","labels":[]}
{"id":50297,"text":"This parameter may be null if the current execution Thread has no associated ProtectionDomains.","labels":[]}
{"id":50298,"text":"the target exception","labels":[]}
{"id":50299,"text":"Additional detail about this exception.","labels":[]}
{"id":50300,"text":"the expected name of the class, or null if not known, using '.'","labels":[]}
{"id":50301,"text":"true if the list should scroll to display the selected object, if one exists; otherwise false","labels":[]}
{"id":50302,"text":"The non-null components to add.","labels":[]}
{"id":50303,"text":"true means do not initialize the initial DirContext; false is equivalent to calling new InitialDirContext()","labels":[]}
{"id":50304,"text":"List of ObjectNames of MBeans expected to be unregistered due to relation removal (can be null)","labels":[]}
{"id":50305,"text":"the standard offset in force at the cutover, not null","labels":[]}
{"id":50306,"text":"If host is null and if local host name can be resolved to an IP, then host defaults to local host name as determined by InetAddress.getLocalHost().getHostName().","labels":[]}
{"id":50307,"text":"whether this window should share the input context that corresponds to this input method context","labels":[]}
{"id":50308,"text":"the filter, may be null","labels":[]}
{"id":50309,"text":"May be null, in which case all bits of all component samples will be significant.","labels":[]}
{"id":50310,"text":"The possibly null environment properties to use when for the new context.","labels":[]}
{"id":50311,"text":"a database vendor-specific exception code","labels":[]}
{"id":50312,"text":"the non-null mime type for the content editing support","labels":[]}
{"id":50313,"text":"a non-null handle to return the number of iterations this loop should run.","labels":[]}
{"id":50314,"text":"If null, the class name of obj is returned by getClassName().","labels":[]}
{"id":50315,"text":"the message to generate when a ImagingOpException is thrown","labels":[]}
{"id":50316,"text":"It returns masks for a limited number of buttons only.","labels":[]}
{"id":50317,"text":"a filter to select which notifications are to be delivered to the listener, or null if all notifications are to be delivered.","labels":[]}
{"id":50318,"text":"If null, the resolved object field is set to null.","labels":[]}
{"id":50319,"text":"a boolean indicating whether or not to follow HTTP redirects.","labels":[]}
{"id":50320,"text":"If there are no attributes, it shall be an empty Attributes object.","labels":[]}
{"id":50321,"text":"If null, all pixels are valid.","labels":[]}
{"id":50322,"text":"An input source reference that must be non-null and that will be passed to the parse method of the reader.","labels":[]}
{"id":50323,"text":"when true, the alignment value 0.0f means left\/top; when false, it means right\/bottom.","labels":[]}
{"id":50324,"text":"The attachment for the resulting key; may be null","labels":[]}
{"id":50325,"text":"the prefix string to be used in generating the directory's name; may be null","labels":[]}
{"id":50326,"text":"the MouseEvent that triggered the popup to be shown, or null if the popup is not being shown as the result of a mouse event","labels":[]}
{"id":50327,"text":"the type of the Font, which is TRUETYPE_FONT if a TrueType resource is specified.","labels":[]}
{"id":50328,"text":"the Date, or null for the current time","labels":[]}
{"id":50329,"text":"the item to be added; if this parameter is null then the item is treated as an empty string, \"\"","labels":[]}
{"id":50330,"text":"the offset ID, not null","labels":[]}
{"id":50331,"text":"JFormattedTextField.AbstractFormatter to use when the value of the JFormattedTextField is null.","labels":[]}
{"id":50332,"text":"true if the parser produced will validate documents as they are parsed; false otherwise.","labels":[]}
{"id":50333,"text":"This must be different from the ID of any connection previously opened by this connector server.","labels":[]}
{"id":50334,"text":"the index of the column in the model that supplies the data for this column in the table; the model index remains the same even when columns are reordered in the view","labels":[]}
{"id":50335,"text":"possibly null obj to check.","labels":[]}
{"id":50336,"text":"If the components array is null, a new array is allocated.","labels":[]}
{"id":50337,"text":"the nested exception.","labels":[]}
{"id":50338,"text":"the interface of which all members of this attribute set must be an instance.","labels":[]}
{"id":50339,"text":"the ResultSet type; one of ResultSet.TYPE_FORWARD_ONLY, ResultSet.TYPE_SCROLL_INSENSITIVE, or ResultSet.TYPE_SCROLL_SENSITIVE","labels":[]}
{"id":50340,"text":"destination of user code error output.","labels":[]}
{"id":50341,"text":"The number of seconds that credentials should remain valid.","labels":[]}
{"id":50342,"text":"provide default field values to use when corresponding field for this instance is FIELD_UNDEFINED or null.","labels":[]}
{"id":50343,"text":"the tab index which should be enabled\/disabled","labels":[]}
{"id":50344,"text":"The warning information encapsulated in a SAX parse exception.","labels":[]}
{"id":50345,"text":"the exception","labels":[]}
{"id":50346,"text":"The format is not defined, but any implementation must ensure that the string returned by method toXMLString on an existing descriptor can be used to instantiate an equivalent descriptor when instantiated using this constructor.","labels":[]}
{"id":50347,"text":"the time formatter style to obtain, not null","labels":[]}
{"id":50348,"text":"A non-null properties that specify the syntax of this compound name.","labels":[]}
{"id":50349,"text":"the inappropriate value.","labels":[]}
{"id":50350,"text":"an instance object of the declaring class of this reflected object if it is an instance method or field","labels":[]}
{"id":50351,"text":"a Proxy object specifying what kind of proxying should be used.","labels":[]}
{"id":50352,"text":"the name in string form (not null)","labels":[]}
{"id":50353,"text":"The super sharding key may be null.","labels":[]}
{"id":50354,"text":"If true, this rule selects the first dayOfWeek on or after dayOfMonth.","labels":[]}
{"id":50355,"text":"an integer specifying the maximum number of items to display in the list before using a scrollbar","labels":[]}
{"id":50356,"text":"an info object that describes the desired mixer, or null for the default mixer","labels":[]}
{"id":50357,"text":"true if policy mapping is to be inhibited, false otherwise","labels":[]}
{"id":50358,"text":"true to specify that the split pane should provide a collapse\/expand widget","labels":[]}
{"id":50359,"text":"the component to be displayed when this tab is clicked","labels":[]}
{"id":50360,"text":"a boolean which determines whether the AcceptAll file filter is an available choice in the choosable filter list","labels":[]}
{"id":50361,"text":"For example, if the region being rendered is Button, then c will be a JButton.","labels":[]}
{"id":50362,"text":"If null is specified, a mapping of all DataFlavors known to the data transfer subsystem to their most preferred String natives will be returned.","labels":[]}
{"id":50363,"text":"Specifically, the lookup context must have private access privileges.","labels":[]}
{"id":50364,"text":"location to find a Tab after","labels":[]}
{"id":50365,"text":"JFormattedTextField.AbstractFormatter used if a more specific is not specified","labels":[]}
{"id":50366,"text":"the function used to decide whether a file should be included in the returned stream","labels":[]}
{"id":50367,"text":"the new row header to be used; if null the old row header is still removed and the new rowHeader is set to null","labels":[]}
{"id":50368,"text":"currently unused and must be set to null","labels":[]}
{"id":50369,"text":"an associative, non-interfering, stateless function for combining two values, which must be compatible with the accumulator function","labels":[]}
{"id":50370,"text":"the WebRowSet object to be parsed, whose xmlReader field must contain a reference to this XmlReader object","labels":[]}
{"id":50371,"text":"a Collection from which elements are drawn, must be non-null","labels":[]}
{"id":50372,"text":"If the attribute set ignores the character case of its attribute ids, the case of attrID is ignored.","labels":[]}
{"id":50373,"text":"the Locale for which the object is desired; refer to UIDefaults for details on how a null Locale is handled","labels":[]}
{"id":50374,"text":"The size of the region to be mapped; must be non-negative and no greater than Integer.MAX_VALUE","labels":[]}
{"id":50375,"text":"The ErrorHandler to be used by the parser.","labels":[]}
{"id":50376,"text":"null indicates that all attributes should be retrieved; an empty array indicates that none should be retrieved.","labels":[]}
{"id":50377,"text":"the text to parse such as \"2007\", not null","labels":[]}
{"id":50378,"text":"the list of URLs (space-separated) to load classes from, or null","labels":[]}
{"id":50379,"text":"If this is zero the caret will not blink.","labels":[]}
{"id":50380,"text":"one of Calendar.ERA Calendar.YEAR Calendar.MONTH Calendar.WEEK_OF_YEAR Calendar.WEEK_OF_MONTH Calendar.DAY_OF_MONTH Calendar.DAY_OF_YEAR Calendar.DAY_OF_WEEK Calendar.DAY_OF_WEEK_IN_MONTH Calendar.AM_PM Calendar.HOUR Calendar.HOUR_OF_DAY Calendar.MINUTE Calendar.SECOND Calendar.MILLISECOND This method fires a ChangeEvent if the calendarField has changed.","labels":[]}
{"id":50381,"text":"The behavior is unspecified if this parameter is negative.","labels":[]}
{"id":50382,"text":"true if grouping is used; false otherwise","labels":[]}
{"id":50383,"text":"if true, recursively enumerate all subgroups of this thread group","labels":[]}
{"id":50384,"text":"if true, execute after shutdown, else don't","labels":[]}
{"id":50385,"text":"the printing mode that the printable should use","labels":[]}
{"id":50386,"text":"Identifies behavior when focus is lost","labels":[]}
{"id":50387,"text":"true if the high endpoint is to be included in the returned view","labels":[]}
{"id":50388,"text":"this object specifies the user-defined credentials to be passed in to the server in order to authenticate the caller before creating the RMIConnection.","labels":[]}
{"id":50389,"text":"the base date used to calculate the base value for the range of valid values in the parsed chronology, not null","labels":[]}
{"id":50390,"text":"the temporal object to query, not null","labels":[]}
{"id":50391,"text":"a mapping function to produce keys, must be non-null","labels":[]}
{"id":50392,"text":"the bitwise inclusive OR of the following flags: WIDTH, HEIGHT, PROPERTIES, SOMEBITS, FRAMEBITS, ALLBITS, ERROR, ABORT.","labels":[]}
{"id":50393,"text":"true indicates that all word tokens should be lowercased.","labels":[]}
{"id":50394,"text":"the BeanContextServiceRevokedListener to notify if the service should later become revoked","labels":[]}
{"id":50395,"text":"the array into which the elements of this collection are to be stored, if it is big enough; otherwise, a new array of the same runtime type is allocated for this purpose.","labels":[]}
{"id":50396,"text":"determines the Frame in which the dialog is displayed; if null, or if the parentComponent has no Frame, a default Frame is used","labels":[]}
{"id":50397,"text":"the map of fields to values, which can be updated, not null","labels":[]}
{"id":50398,"text":"The StringJoiner whose contents should be merged into this one","labels":[]}
{"id":50399,"text":"true if the width preference has changed","labels":[]}
{"id":50400,"text":"The feature name, which is a non-null fully-qualified URI.","labels":[]}
{"id":50401,"text":"the working directory of the subprocess, or null if the subprocess should inherit the working directory of the current process.","labels":[]}
{"id":50402,"text":"a non-null reference to a JComponent","labels":[]}
{"id":50403,"text":"true if color samples are premultiplied by the alpha sample; false otherwise","labels":[]}
{"id":50404,"text":"whether this invocation completes the message","labels":[]}
{"id":50405,"text":"true if name is relative to the target context of the search (which is named by the first parameter of the search() method); false if name is a URL string.","labels":[]}
{"id":50406,"text":"the instant to get the next transition after, not null, but null may be ignored if the rules have a single offset for all instants","labels":[]}
{"id":50407,"text":"the child node to look for previous child before it","labels":[]}
{"id":50408,"text":"Range ends before refNode","labels":[]}
{"id":50409,"text":"Specifies whether or not shift key was depressed during the Event.","labels":[]}
{"id":50410,"text":"color to be used for text when the node is selected","labels":[]}
{"id":50411,"text":"the guarded invocation that the call site should incorporate into its target method handle.","labels":[]}
{"id":50412,"text":"the acceptor function that must be successfully invoked to accept the push promise","labels":[]}
{"id":50413,"text":"the date formatter style to obtain, not null","labels":[]}
{"id":50414,"text":"flags used to repaint the button when the image is updated and which determine how much is to be painted","labels":[]}
{"id":50415,"text":"Implementations of the Paint interface are allowed to throw NullPointerException for a null userBounds.","labels":[]}
{"id":50416,"text":"true if a lightweight panel is desired, false otherwise","labels":[]}
{"id":50417,"text":"true if alpha information is present; false otherwise","labels":[]}
{"id":50418,"text":"if this is triggered by a redefine or retransform, the class being redefined or retransformed; if this is a class load, null","labels":[]}
{"id":50419,"text":"an IIOMetadata object representing stream metadata, or null to use default values.","labels":[]}
{"id":50420,"text":"the appendable to format to, not null","labels":[]}
{"id":50421,"text":"The RunnableRunnable whose run() method will be called after the InvocationEvent was dispatched or disposed","labels":[]}
{"id":50422,"text":"The possibly null object containing location or reference information that can be used in creating an object.","labels":[]}
{"id":50423,"text":"true if the group is resizable; if the group is not resizable the preferred size is used for the minimum and maximum size of the group","labels":[]}
{"id":50424,"text":"Range starts before refNode","labels":[]}
{"id":50425,"text":"an exception code used by a particular database vendor","labels":[]}
{"id":50426,"text":"the zone ID to use, not null","labels":[]}
{"id":50427,"text":"If null, then no name is specified.","labels":[]}
{"id":50428,"text":"The possibly null environment properties used when creating the context.","labels":[]}
{"id":50429,"text":"The options to provide to the Agent_OnAttach[_L] function (can be null).","labels":[]}
{"id":50430,"text":"must be valid for the openType specified for this attribute; can be null, in which case it means that no maximal value is set.","labels":[]}
{"id":50431,"text":"the service of interest (should be non-null)","labels":[]}
{"id":50432,"text":"If true, the read permission applies only to the owner's read permission; otherwise, it applies to everybody.","labels":[]}
{"id":50433,"text":"The maximum number of floats to be written to the given array; must be non-negative and no larger than dst.length - offset","labels":[]}
{"id":50434,"text":"The non-null object to compare against.","labels":[]}
{"id":50435,"text":"the Class object corresponding to the annotation type, not null","labels":[]}
{"id":50436,"text":"The Namespace URI, or the empty string if none is available or Namespace processing is not being performed.","labels":[]}
{"id":50437,"text":"The name can be the fully qualified method name including the classname, or just the method name if the classname is defined in the 'class' field of the operation descriptor.","labels":[]}
{"id":50438,"text":"the object containing the details of the transfer, not null.","labels":[]}
{"id":50439,"text":"object to be notified as more of the image is converted.","labels":[]}
{"id":50440,"text":"a diagnostic listener for non-fatal diagnostics; if null use the compiler's default method for reporting diagnostics","labels":[]}
{"id":50441,"text":"should be null.","labels":[]}
